{"_id":{"$oid":"579a66d57c6fb8225aa9c776"},"Report":{"Rating":"5","Text":"Not much to see but the hot springs are worth the hike."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c777"},"Report":{"Rating":"3","Text":"The proximity to San Francisco is super convenient. We took a quick 2.5 hour drive on Friday evening, and slept in the back of a Getaround Prius in a parking lot near the trailhead. We got a late start (late for what we wanted) and were on the trail by 9:30am. It was foggy for the first 3 miles or so, which was great. It kept the temperature down during the steep initial ascent. The single track trail is well maintained, and relatively easy as far as wilderness trails go. The main challenge is the length. There's a great resting place at the 5 mile mark.\r We arrive at Sykes camp around 1:30pm, and the sites were starting to fill up. By evening, every possible camp site was filled. Not a great location for solitude. Some camps were playing music, other camps were building campfires during a fire ban. There were no outhouses, and lots of toilet paper scraps scattered around in the brush. I would happily pay a fee for a wilderness permit if they figured out a toilet solution. The amount of traffic this place gets is pretty incredible, and I wonder how it's affecting the area. There was even some toilet paper scraps near the creek, which is pretty nasty.\r We avoided the hot springs that evening because of the amount of people camping in the area. We woke up at 5:30am and hiked in the morning light down to the pools and had a nice quiet soak. I was again surprised to see all the campsites filled with campers, even all the way down to the hot springs. There was a tent set up right at the pools as well.\r All in all, it was a fun trip, but don't come here for solitude or to be surrounded by people who treat the outdoors with kindness."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c778"},"Report":{"Rating":"1","Text":"We hiked in and back in one day.  A little over 20 miles from the truck and back.  Our group was in good shape, but it was rough.  There is a lot of up and down and elevation gain.  I kept telling myself \"soon you'll be at the beautiful springs!\"We arrived at the hot springs and we all looked at one another like \"soooo.... THIS is what we are hiking 20 miles for?\".  Teeny tiny sulphur pools FILLED with algae (think long billowing aggressive algae).  Super crowded.  We had to wait for a little pod to empty out. I didn't want to get near them, except I knew my muscles probably needed it to make the 10 miles back.  The springs were more of a tepid \"I'm going to get a disease here\" temp instead of hot.  I have done amazing hikes in big sur and surrounding areas.  This was the least beautiful and completely underwhelming. We were hiking inland so I expected maybe something like big basin?  Beautiful green forest and ferns and waterfalls.  No.  Brushy forest and an occasional creek crossing.  We weren't even tempted to take photos along the way.  The trail is super narrow so we were single-file the whole way and sang songs and chatted to pass the time.  The only nice thing about this hike was the workout and being with friends.  I wouldn't recommend to anyone."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c779"},"Report":{"Rating":"3","Text":"This hike is very strenuous.  The first 4 miles to ventana is the hardest.  From Ventana to Terrace Ceek is moderate and a good break from the uphill from the station to Ventana.  From Terrace Creek to Barlow Flats is moderate; from Barlow Flats to Sykes is moderate to difficult.  The last 3 miles is tough because it's uphill in the sun, with little shade, then downhill to get to Sykes.  It's a scenic path with beautiful views.  The river is crossed several times.  The entire time on the path there is room for only 1 person.  There is very little room and you're literally on the cliff of the mountain the whole time.  There is not room for off trailing and was honestly a bit boring for how long the hike is.  Once you get into Sykes camp, the trail goes left and right.  The hot springs are to your LEFT.  It's confusing and very many people got confused and didn't know where to go.  The trail gets lost for a little bit; if you keep continuing to the left, you'll find them.  The trail will go up on rocks which was very narrow and scary because of the rocks, you can also go through the river.  Once you get close, it's hard to take your backpack with you.  The small trail to the springs is very narrow and hard to get to because of the rocks.  I would recommend finding the springs without your packs, find a campsite, and then enjoy.  The Hot Springs felt great and was truly an amazing experience.  The river is beautiful and the camp is very comfortable.  When we got to the springs, there was no one there.  We got there Wednesday and left Thursday morning.  At night the springs were crowded.  We stayed the first night in Ventana.  The Ventana camp is a mile down with beautiful views.  It's a tough hike back uphill to get back to the Pine Ridge Trail.If you're willing to do a tough hike and test your uphill abilities, this is a great hike.  If you're looking for scenery and a nice calm scenic hike, this is not for you.  There are no coastal views, and you're looking at the path the entire time."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77a"},"Report":{"Rating":"5","Text":"Challenging, beautiful and worth it! go mid week and leave on Saturday to avoid crowded campsites."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77b"},"Report":{"Rating":"5","Text":"Great trail! You'll cross beautiful springs, look over the ocean, see the amazing valley below, and travel along the lush ridge line.  Definitely backpack out to Sykes Hot Springs and stay over for a night."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77c"},"Report":{"Rating":"5","Text":"Beautiful trail, very scenic on top and nice creeks at the bottom. I recommend carrying Fly repellent because there are lots of huge flies, I also recommend bringing a pump water filter because you will need to stay hydrated and will have to get water from the  creeks. My partner and I took 4 days to get to Skykes and back to the parking lot. We took a steady pace and camped in between at Terrace Creek and Ventana Camps. I recommend coming prepared to camp out unless you can make it to the hot springs and back all in one day. Besides that, the steep hike up was worth the experience and the hot springs and creeks are beautiful, especially for the sore muscles. I have to say I underestimated the difficulty, its definitely a challenge, but very worth it."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77d"},"Report":{"Rating":"4","Text":"Hundreds of people on the weekend but tranquil and lovely on Monday."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77e"},"Report":{"Rating":"5","Text":"One of the most memorable trails I've done. I completely the trail from Big Sur to Tassajara in 2 days. I camped at Redwood Creek, about 3 miles after skykes. Awesome spot for astrophotography. The trail is pretty steep and mostly dry after Redwood Creek, but the seclusion is unbeatable. For this being one of the most popular backcountry trail, I only saw 2 people after skykes."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c77f"},"Report":{"Rating":"4","Text":"Not an expert hiker by any means, our group consisted of 7 people of these 3 kids 9-13 years old, be ware this route is tough, we only made it to Ventana which is only 6 miles in, took us 6 hours to get to camp as most of the first 5 miles are all uphill then you have 1 mile downhill to camp.We would definitely do this route again as the views are breath taking, the trail is a bit narrow but it just adds to the experience as do the fallen trees on the trail and the streams that you have to cross, definitely a must do if you haven't yet."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c780"},"Report":{"Rating":"5","Text":"Perfect two night trip. We went on Thurs-Sat. Stayed night one at Terrace Creek camp 5 miles in, then 10 mile there and back day hike to Sykes, and spent night #2 at Terrace. I thought it was perfect. We avoided the crowd at Sykes camp and were able to leisure along the trail without a time crunch or worry of crowds. Definitely recommend going during the week as the the two small hot springs are often crowded. Would do it all again though."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c781"},"Report":{"Rating":"4","Text":"Fun hike. Started at Big Sur station, $5 for all day parking."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c782"},"Report":{"Rating":"4","Text":"Good times."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c783"},"Report":{"Rating":"5","Text":"Great place to go especially during the week when things are not so crowded.  Tough hike up from the parking lot up to the first camp and there is a washout of the trail to work around but after that it is easier.  It was generally dry along the trail with lots of poison oak and wild raspberry plants though were are a few spring runoffs down the trail as you approach Sykes.  Congrats to the volunteers for trekking out the trash from the campground."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c784"},"Report":{"Rating":"4","Text":"Trail was challenging, especially the first 5 miles. Very steep switchbacks with a lot of nats and flys. There were a also a lot of nats and flys at the camp sites but they didn't bite and when it got cold they disappeared. No mosquitos, yea. Went Monday-Thursday 10-26-10-29 and only had it to ourselves for about 4 hours so it's very popular"},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d67c6fb8225aa9c785"},"Report":{"Rating":"1","Text":"This is the heaviest used trail in the Ventana Wilderness. PLEASE practice Leave No Trace camping. Toilet Paper is trash, pack it out.  This is a beautiful trail but heavily overused, if you are looking for a wilderness experience this is not the place."},"Name":"Pine Ridge Trail to Sykes Hot Springs"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c786"},"Report":{"Rating":"4","Text":"Very good one. Nice place and perfect time :)"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c787"},"Report":{"Rating":"1","Text":"toàn những cảnh đẹp . thiên nhiên kỹ vỹ quá. nững cảnh đẹp này còn lưu giữ đến mai sau"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c788"},"Report":{"Rating":"4","Text":"I did this trail by accident with my sister on New Years Day. It was great though, the trail was all down hill in the beginning a little steep and slippery but beautiful. It was a bit crowded but that doesn't bother me really. The falls were really very pretty, but again it was a little crowded. ALSO the traffic situation was crap! Everyone in a hurry while others are trying to appreciate and then coming out of the whole park at night was all backed up with traffic. I personally hated that the most."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c789"},"Report":{"Rating":"5","Text":"amazing place thank you"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78a"},"Report":{"Rating":"4","Text":"Prepare for lots of stairs and uphill climbs. \n\r\nThere was one medium sized waterfall and a few tiny ones. This hike is moderate to advanced in my opinion.\n\r\nThe beginning was a little hard to find but we asked a biker and he pointed us to the correct way."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78b"},"Report":{"Rating":"4","Text":"Oh, I want to leave my daily routine and go there!!!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78c"},"Report":{"Rating":"5","Text":"Really fantastic hike, but it is definitely strenuous, not moderate! Beginning is very steep and then there is a lot of up and down climbs after the steep ascent. I have done several other 7 mile trails rated anywhere between moderate and strenuous. This was definitely one of the most strenuous hikes that I've done.\n\r\nScenery was really fantastic. Even though there is a drought, the stream and waterfalls were still very beautiful. You cross through all different types of terrain and surroundings - redwoods, marsh, dry scrub, etc. The lake view between the Helen Markt and Kent Trails was beautiful and very peaceful. My friend and I were the only people there for a good 15 minutes. While hiking on the Kent and High Marsh Trails, we literally only passed one other person. Definitely a great loop to do if you want some solitude (though the beginning at the Cataract Trail is very popular).\n\r\nAlso definitely take more water than you think you might need!!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78d"},"Report":{"Rating":"5","Text":"Cataract Trail Loop is really great trail to be on. One my favorite one, Covered all most the times, exposed towards top multiple times.\n\r\nSeveral small water fall and creek running all the way. Very pleasant hike. Lake side view at Kent Trail to Helen Markt Trail is great place to hangout and have food. You can meditate with emptiness of nature over their.\n\r\nGood Shoe is shoe highly recommended , trail is sloppy and not well managed so be careful while walking.\n\r\nEvery bit is enjoyable. Falls, Mountains, RedWood, Herb Tress, Across. You will also cross are where their mark of past wilf fire."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78e"},"Report":{"Rating":"4","Text":"Bức tranh thiên nhiên hùng vĩ"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c78f"},"Report":{"Rating":"3","Text":"i really love this place"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c790"},"Report":{"Rating":"5","Text":"Well worth the wait really loved the view. One of the earth's greatest sites!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c791"},"Report":{"Rating":"4","Text":"nice place........... :)"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c792"},"Report":{"Rating":"4","Text":"Very beautiful - worth a visit!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c793"},"Report":{"Rating":"4","Text":"The West Ridgecrest Blvd was closed at Rock Springs Parking Area when we reached there at 8am. The sign says it's open from 9am to sunset. Plan accordingly if you are taking this road.\n\r\nWe ended up hiking the Cataract trail back and forth from Rock Springs Parking Area instead of this loop. The first half was sunny and the second half was pretty good with the little waterfalls all over. It gets crowded by noon."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c794"},"Report":{"Rating":"5","Text":"Started early around 7-8am It was an overcast day and they said partly cloudy and showers in the afternoon. Great trail! Tons of stairs and waterfalls along the way up. Be careful. Wear good hiking shoes. Bring snacks and water. A light workout coat if your going early. You'll eventually take it off. Great leg workout! If your into photography or even posting pictures for your friends and family on facebook and instagram. Get ready there are tons of waterfalls and great scenery to capture!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c795"},"Report":{"Rating":"5","Text":"This blog contains review of Health Insurance, Life Insurance, Home Insurance, Car Insurance, Travel Insurance and others\r\nhttp://www.all-insurance-que.com"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c796"},"Report":{"Rating":"5","Text":"very nice place i would love to go there oneday"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c797"},"Report":{"Rating":"5","Text":"Totally awesome :) I highly recommend it"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c798"},"Report":{"Rating":"5","Text":"It was awesome trail with beautiful waterfalls . Loved it"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c799"},"Report":{"Rating":"3","Text":"nice waterfall/.............. love it"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79a"},"Report":{"Rating":"5","Text":"a must visit place... very adventures"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79b"},"Report":{"Rating":"5","Text":"Awesome place... amazing waterfalls"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79c"},"Report":{"Rating":"4","Text":"The place was awesome and very relaxing waterfalls."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79d"},"Report":{"Rating":"3","Text":"great waterfall. i will come there once more time if i have a chance :)"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79e"},"Report":{"Rating":"3","Text":"We did this trip yesterday.  I would rate it as strenuous mainly because you drop back down to water level and then hike back up to be able to hike down.  The upper part was the most picturesque.\n\r\nThe distance in our device registered almost 10 miles.\n\r\nWe modified it a bit by taking the fire road from the picnic area.  We turned left off the road at the fist opportunity and came out on a Knoll that was spectacular.  Then we hooked back up to the trail mentioned in this write up.\n\r\nNext time I'll try making a loop from the top section only."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c79f"},"Report":{"Rating":"5","Text":"This trail is one of the most beautiful ones I have done in the recent times. We started out very early in the day. We reached the cataract trail starting point by 7:45AM. There were not many visitors yet. We got the parking quite easily.\n\r\nI would not recommend this to beginners. It is quite strenous and would recommend some practise before attempting it. \n\r\nThere are lot of waterfalls and water streams along the path. The path is good to do even on hot summer days given the fact that the path is mostly covered with huge trees and thick forest.\n\r\nMake sure you enjoy the path at every phase of it. I highly recommend this trail to people who love nature. Last but not the lease, stop and take a look at the Alpine Dam which is nearby.\n\r\nHappy Hiking !"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a0"},"Report":{"Rating":"5","Text":"The hike is beautiful - after recent rains, it felt like all of the Cataract part of the trail was one huge continuous waterfall.  It is a challenging hike, so bring water and plan for a full day if you are doing the whole loop.  Hiking poles are a good idea on this trail if you usually use them.  There are not a lot of people here due to the small parking area, and it is a good idea to go on an off day, not the weekend."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a1"},"Report":{"Rating":"5","Text":"Amazing waterfalls! I would love to be there."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a2"},"Report":{"Rating":"5","Text":"Good thing I came across your blog. Great Article Thanks!\r\nWant more Pop Culture? Log onto WWW.POPCULTUREZ.COM!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a3"},"Report":{"Rating":"5","Text":"Awesome place! must back there soon"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a4"},"Report":{"Rating":"4","Text":"Wonderful hike! Thanks SO much for sharing."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a5"},"Report":{"Rating":"5","Text":"Great hike!  The beginning is steep but the waterfalls make the climb worthwhile.  I finished my entire camelpak (50 oz) which I did not expect on a hike of this length so definitely plan to bring extra water."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a6"},"Report":{"Rating":"4","Text":"Great, vigorous hike. Beautiful woods and waterfalls.  So glad I brought extra water (like someone else suggested) and also sooo happy to have my hiking poles!!  Not as many vista points as I was expecting, but the woods and waterfalls provided plenty of beauty."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a7"},"Report":{"Rating":"4","Text":"This hike is indeed beautiful. I love the views of other mountains, the lake and of course, the waterfalls! I did not, however, expect that it be a serious climb... BOTH WAYS! Our GPS reported that we climbed almost 2400 ft in 7.9 miles- that's a lot for me. There are very few times during this hike where I actually felt like we were on flat ground. The steep decline (the same steep incline with lots of stairs in the beginning) on the way back felt treacherous since by that time my legs were fatigued."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a8"},"Report":{"Rating":"4","Text":"Just starting a review here, as I have not hiked the whole trail yet.  Let it be known, that the first part of the trail, is not for the faint of heart.  Intense, steep ascent."},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d77c6fb8225aa9c7a9"},"Report":{"Rating":"5","Text":"Wonderful hike! Thanks SO much for sharing.  Bring extra water, Be sure to take Alpine Trail once you've completed Helen Market to return to the beginning!"},"Name":"Cataract Trail Loop in Marin County"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7aa"},"Report":{"Rating":"3","Text":"What a great trip, i will be there soon"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7ab"},"Report":{"Rating":"5","Text":"Excellent trail for a one day long-distance hike or run.  I started at Castle Rock 8:30am, enjoyed lunch at the store in Big Basin HQ, and finished at Waddell Beach 3pm.  Soft ground, mostly downhill, well-marked trail, and spectacular scenery make this long day feel relatively easy.  The most difficult part of this trail is the shuttle required.  I highly recommend this trip to those who want to do  it in a single day.\n\r\nFor those looking for a multi-day backpacking experience, this one will have limited appeal.  The first third of the trip feels like you are slipping into the wilderness of the Santa Cruz mountains until the middle third when you are within eyesight or earshot of highway 9 or 236.  The final third is beautiful but crowded with day-hikers and casual bicyclists.  This trail may be among the best within 1 hour of the bay area but lacks much sense of a wilderness experience."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7ac"},"Report":{"Rating":"1","Text":"Very underwhelming. You're in the trees 99% of the time. There are only a few views during the entire 3 day hike and none of them are very pretty. The trail ends at a parking lot a mile uphill of the ocean which is also the first and only time you see the ocean the entire time. The only reason to do this trail is if you live in the South Bay and you need to train for something else or want to test out gear. It is not worth doing for the hike for its own sake."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7ad"},"Report":{"Rating":"5","Text":"Very, very interesting place for every user here."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7ae"},"Report":{"Rating":"5","Text":"I did this hike in Aug 2015 and was a lot of fun. I would recommend to anyone who enjoys being in the nature, is reasonably fit - physically, so that you can carry about 30lbs of weight and walk for 10 miles a day.\r\nWe started from Castle Rock State park, first night stayed at Waterman gap and second day at Jay Camp ( near Big Basin HQ). Each day we were on the trail by 10:30/11 am and reach our destination by 4/4:30 pm.  Then lot of time to sit, relax, chat and enjoy the surroundings.\r\nWe dropped a car at Rancho Del Oso State park on Friday night, and had a friend drop us at Castle Rock State park on Saturday morning. Started our hike at 11 am.\r\nWe did the hike with trail mix, protein bars and water. Pasta/Noodles for dinner and oatmeal for breakfast. No water till you reach your campsite ( do confirm it has drinking water available), so carry enough, although for me 2 liters was enough, while walking.\n\r\nCautions:\r\nEvery pound counts. It might seem very light when you pick an item, you plan to carry. Would highly recommend to do a practice hike with the weight you plan to carry prior to the hike, to get an idea how much you can really carry and for how long.\r\nPit toilets. I found it to be much cleaner than couple of my prior experience, but still these are NOT flush toilets. Since you are ready for backpacking , hopefully you would be willing to tolerate it.\r\nNo benches at the camping site. Almost all car camping sites have wooden benches where you can sit/cook and eat. None on the sites we stayed, and you realize how important these are only after 6 hrs of strenuous workout, and the reach your destination, looking for space to sit.\r\nWould highly recommend carrying sleeping pads: For me a good night sleep is more important than a delicious dinner. Found it difficult to find a flat surface to camp in Jay Camp for 2.  You realize if its really flat only after you lie flat on the ground.\r\nMosquitoes: Do carry Mosquitoe repellent. \r\nIf you do not have strong knees, atleast one hiking stick is helpful.\n\r\nEnd of the day if you enjoy nature and have a good company, you will enjoy the experience. I did, and would recommend to all enthusiasts.\r\nLastly Berry creek fall had water, although not a lot."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7af"},"Report":{"Rating":"5","Text":"Excellent training day-hike for ultralight backpackers like myself. Easily finished the whole 31 miles (from Castle Rock) in 11.5 hours and ready for more. I've done this route as a day-hike twice before and every time it was a great workout. Go get some!\n\r\nBeginners should skip my review and carefully read what other backpackers wrote about this hike.\n\r\nAdvanced hikers/runners who did something similar in the past should skip my review as well - just figure out transportation situation and go, do your thing ;)\n\r\nIntermediate hikers, who wants to test their endurance and get into long-distance hiking... should probably look for some tips on sites like Andrew Skurka's (http://andrewskurka.com/). \r\nTo avoid injury, do a few shorter hikes (15-20 miles) a week or two before this one. Wear comfortable shoes and good socks. Make sure you have enough fuel - there is a store at Big Basin HQ, but I would call them before the trip to make sure they will be open if you plan on getting food there. Same goes for water - after some rains, you can easily find and filter water along the trail, but during the dry season, you might be out of luck. Check with the rangers before your hike to get an idea about the conditions on the trail. Hiking poles are a good idea - you can do it without the poles, but your knees might not like it.\n\r\nHere's the way I usually do this hike:\r\nMeet one of my buddies at Waddell Beach and leave one car there. Drive to Castle Rock and start hiking. At the end, we pick up the car from the beach and drive back to CR for the second car. Go home and take a shower.\n\r\nI prefer to wear: \r\nlight trail-running shoes with Wrightsocks (built-in liner), runner shorts, light synthetic t-shirt.\n\r\nI like to bring my Exos 48 backpack and carry:\r\nheadlamp, down jacket (MH Ghost Whisperer), light warm hat, sun hat, water filter (Sawyer Mini), Camelbak (3L), hiking poles (Black Diamond Alpine Carbon Cork), and my poncho-tarp if it's raining. Oh, you might want to bring some moleskin just in case a blister sneaks up on you (unless you don't mind them).\n\r\nFood:\r\nI did this trail once entirely on fresh fruits (bananas, apples, strawberries, etc.). Feels great, but a bit of a hassle. Protein bars, gel shots, electrolyte powders are much easier to deal with. You should know what works for you though.\n\r\nThat's about it. Have fun and share your experience with others!"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b0"},"Report":{"Rating":"2","Text":"SINGAQQ - Agen Judi Poker \u0026 Bandar Domino Online Indonesia\n\r\n- Selamat Datang Di WWW. SINGAQQ .COM Adalah Bandar Domino Online Dan Bandar Poker Online.\r\n- SINGAQQ.COM - Agen Poker Online Terpercaya \u0026 Bandar Domino QQ Online Terbesar Di Asia."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b1"},"Report":{"Rating":"5","Text":"u need very comfortable shoes.... quite a difficult hike"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b2"},"Report":{"Rating":"5","Text":"i visted with my wife...  it was a wonderful experience"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b3"},"Report":{"Rating":"5","Text":"I was really amazing place"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b4"},"Report":{"Rating":"5","Text":"Great thanks for info, i want to going their"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b5"},"Report":{"Rating":"4","Text":"This was my first backpacking trip over 25 miles as an adult. It was really cool and very diverse. Me and 2 male friends hiked from Castle Rock to Waddell Beach over 3 days/2 nights. Mostly downhill with some good uphill sections too. The first day 2 days are a mix of downhill and level, with the random uphill section. Day 3 from Big Basin to Waddell starts with 2 miles of climbing steadily (not hard) and then is a gradual downhill for the rest of the day. One of the other reviewers here said it's steep downhill, which it isn't. Maybe a few very small parts, but it's a super easy last day along the creek, past some farms, and out to the beach. Don't bother bringing anything to filter water. I took a liter gatorade bottle of water for each day and was fine. You can refill at Waterman and Jay camps. Nice hike. Would definitely do it again. Probably the longest structured thru-hike you can do in the bay area."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b6"},"Report":{"Rating":"4","Text":"like information, i wait strip"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b7"},"Report":{"Rating":"4","Text":"This was my first backpacking trip and I went with an inexperienced friend. It’s definitely doable for beginners if you’re a bit adventurous and reasonably fit!\n\r\nIf you’re doing backcountry camping (not car camping), you must call to reserve your spot (no online reservations). They take reservations up to 2 months in advance: http://www.parks.ca.gov/?page_id=26658. \n\r\nWe paid an $8 reservation fee. Once we arrived, we paid $15 per night of camping, and since we had more than one car, we paid an additional $10 per night. We left all of our cash payments in a fee box at the parking lots (the Park will send you instructions on this). Bring exact change!\n\r\nWe booked Waterman Gap for night one, and Jay Camp for night two. Both have potable water. There is also the option of staying at Sunset Camp on the second night. It is more rustic, and there is no potable water, but the Ranger recommended it to us, as you get pass three waterfalls on this trail. We opted for Jay since it’s next to Park Headquarters (A general store! Water! Showers!), and this was our first trip.\n\r\nDay One\r\nWe parked one car at Waddell Beach, and drove the second up to Castle Rock State Park. We brought a really basic map printed from my computer, thinking we’d pick up a more detailed map at one of the parking lots. But there were none left! The basic map was adequate, but we had to guess which way to turn at a few trails. Luckily, we made the right decisions, but spoke to a few campers who went 5 miles out of the way after a wrong turn! I would recommend getting a detailed map from the park ahead of time (I believe you can call to place an order). And bring a compass!\n\r\nReally great views shortly after starting your Day One hike. You’ll pass potable water a few miles in, at Castle Rock camp. We stayed at Waterman Gap the first night.\n\r\nDay Two\r\nThe Skyline to the Sea hike is sometimes referred to as “all downhill.” Don’t be fooled! Day two starts with a few miles of uphill hiking. Get a good breakfast in before starting! You’ll need your energy! I found Day Two to be the most physically strenuous. You’ll start to see the beautiful Redwoods, and you’ll get some more great views of the Santa Cruz mountains. We even saw a few mountain lions!\n\r\nWe followed the trail to Big Basin Headquarters, and stocked up on goodies at the general store. It closed at 4pm on the day we arrived. We got there just in time to get some beer, some jerky, some more trail mix, and some pastries! They’ve also got an outdoor store, where you can pick up other camping supplies if needed. We were also able to pick up a detailed trail map for our third day of hiking.\n\r\nThey have hot showers with the highest water pressure I’ve ever felt. It was glorious! Bring quarters. It was 25 cents for two minutes of water.\n\r\nDay Three\r\nWe were pretty sore this day. All the hiking with 20 pounds on our backs caught up with us. We also had blisters. I would definitely recommend bringing moleskin or something comparable.\n\r\nThere was a bit of uphill on day three as well. Although this trail was supposed to be longer (about 2 or 3 miles longer than the previous two days), we completed it in about the same amount of time- 5 hours. The trails through the redwoods near the river are really beautiful. Lots of beautiful spots to pause for a snack. And you’ll pass a waterfall!\n\r\nWe eventually made it back to where we parked, near the ocean. We were disappointed to find that there were no ocean views on our trip at all. Perhaps there are if you venture off of Skyline to the Sea at all?\n\r\nAll in all, it was a great trip for beginners! I’ll pack slightly differently next time (I need a camel pack, versus water bottles), and thicker hiking socks! Pack as lightly as possible, and have fun!!"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b8"},"Report":{"Rating":"5","Text":"This was my first backpacking trip and I had an amazing time! The terrain is very diverse which keeps the hike very interesting. It has some great views of the santa cruz mountains and berry creek falls was beautiful! I do find it a bit misleading when people say that this hike is mainly downhill. It definitely has its share of uphill climbs. But anyways, you must experience this excellent trail!"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7b9"},"Report":{"Rating":"5","Text":"Two of us are doing the trail from 9/22 to 9/25 - we only have one car so if anyone else is hiking those days and is willing to carpool, please email me at keelssd(at)gmail(dot)com. If anyone has any suggestions on how to get a ride back, that would be greatly appreciated also!"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7ba"},"Report":{"Rating":"5","Text":"Great info, i cant wait to start this trip."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7bb"},"Report":{"Rating":"5","Text":"I only hiked from the top of Big Basin in Boulder Creek Down to Waddell Creek at the ocean. It takes one longish day and it's very steep downhill. Tough on your knees if you rush. Don't! You can take the bus to the top and leave your car at Waddell Creek for the end of the hike. Very Nice Views. Constantly changing weather."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7bc"},"Report":{"Rating":"4","Text":"I've done this trail a number of times over the last 5 years.  Each time, I start at Castle Rock State Park and return, making it a 6 day hike.  It's a great early season hike when the Sierras have too much snow."},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7bd"},"Report":{"Rating":"5","Text":"I've done the full trail once and most of the trail a second time.  It's a great 3 day trip and fairly easy (slight downhill the whole way).  You pass a variety of scenery and terrain (rocky and dry to forests with creeks, all the way to the ocean).  You feel far away from people most of the hike, but can still stop at the Big Basin headquarters if you want to pick some stuff up (like marshmallows...).  Great hike, nice scenery, very highly recommend it!"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7be"},"Report":{"Rating":"5","Text":"A must for BA hikers. Not sure if anyone else does this but My friend in I conquered the trail in 1 day insteadof three! read about it on my blog and follow it if you like it!\n\r\nhttp://markhertzler.tumblr.com/"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d87c6fb8225aa9c7bf"},"Report":{"Rating":"5","Text":"Would love to hike the skyline to the sea trail at some point... trying to find the time! Would Oct / Nov be a good time to do it?"},"Name":"Skyline to the Sea Trail"}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c0"},"Report":{"Rating":"3","Text":"This trip was OK but I think I've seen better places."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c1"},"Report":{"Rating":"4","Text":"This is a gorgeous hike--it is will shaded and wooded for the majority of the time and the views of Pacific and the bay are grand! We ended up doing this trail backwards. We started at the Matt Davies trailhead and started climbing from there, which was a gradual ascent to the pan toll ranger station. Once there we took the dipsea trail back to Stinson beach, which led us to an opening with a bench, where we rested and saw great views during our lunch break. I actually recommend doing it backwards because it seemed like the downhill we did would have been rough on the way up!"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c2"},"Report":{"Rating":"5","Text":"This place was unreal. I recommend for anyone looking for a beautiful view!"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c3"},"Report":{"Rating":"5","Text":"Amazing waterfall !! Great pictures !!!"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c4"},"Report":{"Rating":"5","Text":"Great hike, I actually did the hike in reverse.  Parked at the Pan Toll ranger station and hiked down to Stinson Beach.  Great place to have a nibble and a beer there at the Parkside Cafe before the hike back."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c5"},"Report":{"Rating":"5","Text":"a great place to go...amazing experience"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c6"},"Report":{"Rating":"5","Text":"Great Place... Quite a difficult... but must visit once in a life"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c7"},"Report":{"Rating":"4","Text":"wow, so fantastic! nice photo"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c8"},"Report":{"Rating":"5","Text":"We love this lush and scenic trail. A bit muddy beneath the tree cover in wetter months, but we've hiked it in both the rainy and dry seasons.  One of our favorites."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7c9"},"Report":{"Rating":"5","Text":"This is my new favorite hike in the area and the directions were perfect."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7ca"},"Report":{"Rating":"5","Text":"Super. I like this photos."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7cb"},"Report":{"Rating":"5","Text":"Very great hike, I followed this counter-clockwise version of the trip and enjoyed it a lot.  Park at Stinson beach near the south end of the parking lot if there's space available and hike up to dipsea to begin.  Weekends will have a ton of people on Dipsea but once you get to the Steep Ravine portion there will still be a small crowd but less than before.  Beautiful hike, enjoy!!"},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66d97c6fb8225aa9c7cc"},"Report":{"Rating":"5","Text":"Followed this yesterday -- one of the coolest hikes I've ever been on.  Love the way it goes through three distinct microclimates (redwoods, grasslands, monterey pine/ bay forest)."},"Name":"Steep Ravine via Matt Davis, Mt Tamalpais "}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7cd"},"Report":{"Rating":"5","Text":"It a great waterfall that I have ever seen. I am really impressed to visit it."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7ce"},"Report":{"Rating":"5","Text":"This article is very interesting , I was amazed to read\nsbobet\njudi bola\njudi online\nprediksi bola"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7cf"},"Report":{"Rating":"5","Text":"Silver falls was absolutely amazing. Make sure you check that out if you visit this park!"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d0"},"Report":{"Rating":"4","Text":"Beautiful hike through the redwoods. It wasn't too difficult for me, but some of my hiking buddies struggled because of the length of the hike (Almost eleven miles). We met some really kind people on the trail, some of the nicest I've met while hiking. One of my hiking partners dropped her wallet while walking and it was returned to the headquarters with everything still inside. The only downside was the drive (My least favorite part of hiking)."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d1"},"Report":{"Rating":"4","Text":"It's quite OK waterfall."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d2"},"Report":{"Rating":"5","Text":"it is beautiful place"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d3"},"Report":{"Rating":"5","Text":"In general, I like this hike - I wish it was a tad bit longer, but such is life.  Pretty easy to do this as a day hike.\n\r\nIf you're looking to hit this hike w/o running into a bunch of people like is mentioned below, I usually show up about 4pm PST to the park on a weekday and do the trail.   For about a mile or two in you'll see some folks but for the remainder of the 11 mile loop.   This allows you to be able to finish the hike prior to sundown in the summer and close to sundown (perhaps a little after) in the winter.\n\r\nMy calcs show 175 floors climbed on the hike so its not exactly easy as some have mentioned, but then again I do the loop in about 3 hours and 15 mins.   So, if you're doing it at a 5-6 hour pace per the excessive amount of warning signs on the trail - its probably pretty low stress.\n\r\nWater was flowing decently over the cascaded falls including the base fall.   Overall a lovely hike.  I do counter clockwise, as clockwise is sort of a beat down having to trudge up the steps around the falls."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d4"},"Report":{"Rating":"3","Text":"Though this hike is a little long (distance wise) for a day hike, the small elevation change and \"paved\" trail makes for a relatively easy stroll. Though there were a few ephemeral steep parts to the hike, the majority of it was flat and really easy to walk along. Walking at a leisurely pace with a couple stops midway took us about 5 hours to finish the hike.\n\r\nAlmost the entire hike was in the woods, with very little exposure to the sun, which may or may not be a good thing depending on what one's preferences are.\n\r\nThe waterfalls were present, but not very impressive due to the drought that overtook California over the past several years.\n\r\nIt is a relatively popular family oriented hiking location, so you do cross paths with a lot of other groups of people along the way.\n\r\nOverall, it was nice walk, but there are better trails out there if you're a serious hiker."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d5"},"Report":{"Rating":"3","Text":"Though this hike is a little long (distance wise) for a day hike, the small elevation change and \"paved\" trail makes for a relatively easy stroll. Though there were a few ephemeral steep parts to the hike, the majority of it was flat and really easy to walk along. Walking at a leisurely pace with a couple stops midway took us about 5 hours to finish the hike.\n\r\nAlmost the entire hike was in the woods, with very little exposure to the sun, which may or may not be a good thing depending on what one's preferences are.\n\r\nThe waterfalls were present, but not very impressive due to the drought that overtook California over the past several years.\n\r\nIt is a relatively popular family oriented hiking location, so you do cross paths with a lot of other groups of people along the way.\n\r\nOverall, it was nice walk, but there are better trails out there if you're a serious hiker."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d6"},"Report":{"Rating":"4","Text":"We went during a big drought, so there was hardly any running water on the first half of our trail. We were actually worried that all the water falls dried up! Fortunately, we were wrong. The falls were beautiful! The hike was a lot harder than I thought it would be, it felt like we went up hill both ways; don't worry, there was no snow. \r\nGive yourself a lot of time if you want to cruise the scenery, we had a couple of accidents when we took our eyes off the trail to check out the scenery. There's a lot of little roots sticking up waiting to trip you. It took us a little over 5 hours. We had lunch at the falls and we took a lot of pictures. When we went, it hit 85 degrees and we went through a lot of water. \r\nTough hike, but so much fun. I can't wait to do it again."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d7"},"Report":{"Rating":"5","Text":"one of the most beautiful places i ever visited"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d8"},"Report":{"Rating":"5","Text":"not as difficult as people scare of... it fas fun...when u r with your wonderful friends"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7d9"},"Report":{"Rating":"5","Text":"Just completed the loop counter-clockwise (Sunset -\u003e Berry Creek -\u003e Skyline) this morning. It took a little over 4 hours to complete, but I was alone and maintained a pretty fast pace throughout. The hike is very pretty and the sights of those waterfalls are worth the effort. I had never seen banana slugs before (I'm visiting from Belgium where that species does not exist). I spotted a skunk and what I think is a bobcat as well. And those gigantic trees ... wow!!!\n\r\nThe loop is quite strenuous. My GPS indicates a total ascent of 2245-ft which sounds a bit enthusiastic. My legs feel more like I climbed 1500-ft. Even with today's cool weather (55F - 62F) I drank 2 liters (half a gallon) of water. Most of the trail is in the shade except for one (beautiful) short section in limestone, so if you're heading for the trail with higher temperatures pack plenty of water!"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7da"},"Report":{"Rating":"5","Text":"A really beautiful trail; we hiked it in about 6 hours, but I would recommend doing it in 8 or so in order to have more time to stop, take pics, and eat lunch. The trail was a bit crowded at times, but there's a reason there are so many people on the trail :)"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7db"},"Report":{"Rating":"5","Text":"We hiked this loop from 9:15am - 5:00pm. We had enough time to take lots of pictures, observe wildlife, short breaks when our legs were burning during a climb and had lunch by the waterfall. \n\r\nWe hiked the loop counter-clockwise. If you would usually get tired around 7-8 miles, I recommend hiking this loop clockwise. Hiking clockwise is by the flowing creek and other sceneries. If you hike counter clockwise and you dont have much energy in 7 miles, you may not pay attention at the beauty as much because you just want to reach the park headquarters. But if you stay hydrated, eat lots of snacks, wearing proper gear and have great appreciation of everything in the park, you will enjoy whichever direction of the loop you take."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7dc"},"Report":{"Rating":"4","Text":"I am not local to this area, and I had one free day for hiking. I had chosen this trail out of many and do not regret my choice.\r\nFor me it was not easy at all... I planned doing the full loop, but I ended up with going to the Berry Creek Fall and back. I was too exhausted.\r\nWell, I was carrying with me an extensive photography gear, I am not that young and not in my best shape...:-) \r\nIncluding all the stops for photography (that what I canme for), it took me 4 hours to reach the falls. I think I missed one turn somewhere so I actually zigzagged between two trails - which added some distance (2-3 miles maybe). It took me half of the time to get back (a. it was a shorter path, and b. I was too exhausted to make any photographs...).\r\nI enjoyed it very much, not too much water in the waterfalls, but still a refreshing site.\r\nTake a lot of water. Mine finished too early. I almost got dehydrated.\r\nThe trail that leads to the falls \"clock-wise\" (as recommended by the rangers) is fully shaded. As I understood from other hikers, the rest of the trail is much more exposed to the sun, and the climbing is much more strenuous. This, for me, was the final \"nail\" in the coffin.\r\nI enjoyed it much, and I think I am going to enjoy now a good massage..."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7dd"},"Report":{"Rating":"5","Text":"great place ,awesome weather  :)"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7de"},"Report":{"Rating":"5","Text":"Great Guide and great trail, I got there early, I only really saw around 4 other people on my way to the falls, The ranger seemed to recommend taking the lop clock wise, but I did it counter clock wise like this guide advised, It was nice, i went alone so it was almost serene just how quiet and beautiful it is out there."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7df"},"Report":{"Rating":"5","Text":"Our plans to hike Yosemite were thwarted by the government shutdown, so we looked online and found this hike highly recommended.  \n\r\nWe were so blown away by the scenic beauty on the drive up to the park, and felt instantly lilliputian parking under the canopy of Sequoia trees. We got an early start (about 9AM), and were glad to have dressed in lots of layers - temp was in the high 30's.\n\r\nWe followed the rangers recommendation and did the trail clockwise so as to approach the falls from below. Met very few people on the trail till we got above Golden Falls, so we had lots of time to enjoy our visit in peace and quiet. We stripped off our outer layers and stuffed them into our day pack at the falls. Temp had gone up by at least 20 degrees and we were getting nice and warm.\n\r\nBreaking out onto Sunset Ridge after the climb up the falls, it was rewarding to look out over the tops of the trees and get a feel for how high we had climbed - the sun felt really good too. \n\r\nWe dropped down into the basin again and then spend the last few miles slowly climbing back up to the Park HQ. We knew we were close to the end when we heard dogs barking, something that would normally annoy but was, in this situation, a welcome signal that the end was near. By the end of the hike, ambient temp was in the high 70's. \n\r\nThe trail itself took us just under 4 hours, and was one of the most enjoyable mornings we have spent in a long while. The trail is not as difficult as the other we did on the same long weekend (Mt Diablo Grand Loop), but the long climbs up the falls and out of basin, plus the overall length of the trail can challenge beginners.\n\r\nBy the time we finished, the parking lot was full and we were happy to make our way down to Santa Cruz for lunch.\n\r\nI will definitely recommend this trail and park to all our friends."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e0"},"Report":{"Rating":"5","Text":"Wonderful hike.  The falls are beautiful and make for a great place to stop for a bit and have lunch.  If you start late in the day just remember to get out before sunset.  We ended up cutting it pretty close..."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e1"},"Report":{"Rating":"5","Text":"Great hike. Easy terrain, nicely varied. Long enough to get you sweating, especially with the hot weather we got this Saturday."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e2"},"Report":{"Rating":"5","Text":"These hike was absolutely lovely! The trail is well marked and mostly packed dirt. Thankfully all but a small part is under tree cover because we picked a hot day! The climbs are mostly rolling hills, which was perfect. If you're interested in my photos and stories, you can read about it here: http://runningblonde.com/hiking-big-basin-redwoods-state-park/"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e3"},"Report":{"Rating":"5","Text":"This hike was the highlight of our five-day stay at Big Basin. Absolutely loved it. Very glad that we did it counter-clockwise (going out on the Sunset Trail and coming back on the Skyline to the Sea Trail). Climbing down into the waterfalls area was much better than vice-versa, and we were glad that the most scenic part was towards the end of the hike. Can't wait to do this hike again next time we're up there."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e4"},"Report":{"Rating":"5","Text":"Great hike, nice guide - only comment is elevation gain actually is about 2.700', not the 1000 stated in the guide. Makes a big difference!"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e5"},"Report":{"Rating":"5","Text":"My first hike.\r\nI loved it. Completed in 4hrs and 30 mins.\r\nModerately strenuous.\r\nBring something to eat and drink.\r\nBe dressed properly... there are mosquitoes."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e6"},"Report":{"Rating":"5","Text":"This is a tough hike, especially when hauling a ton of photography gear. It's well worth it though. Every part of the trail is beautiful."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e7"},"Report":{"Rating":"5","Text":"Managed to finish the trail in four and half hours with my uncle. The weather was overcast that day, which was perfect for a 10-mile hike. The trail was moist and safe, yet was challenging enough (if you have a heavy backpack on). Signs were visible and helpful. Different directions of a trail lead to different destinations, so please make sure you follow the right one. We got lost the first attempt and ended up coming back on the 2nd day, which turned out an even better hike. Park staff was very friendly and helpful. $10 for parking and a trail map. Beautiful waterfalls. Part of the trail was right by the one of the waterfalls. I will definitely go back and highly recommend this trail."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e8"},"Report":{"Rating":"5","Text":"one of my favorite hikes - especially in the spring when the falls are their fullest, and the forest is full of redwood sorrel and trilliums.  Did it counter clock wise my last time there and enjoyed it better - seemed easier."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7e9"},"Report":{"Rating":"5","Text":"I have made this hike many times. It is an easy less than half day hike. Bring extra clothes and some food. Weather is variable"},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7ea"},"Report":{"Rating":"5","Text":"Great hike. It is definitely a long hike with a lot of uphill climbs. Counter clockwise is the best way to go since the waterfalls go for about a quarter mile downhill along the path. I would not want to have to hike up those the other way. \n\r\nIt probably has closer to 2000 feet total elevation gain throughout the day. There are a number of 600-800 feet climbs you have to make it up.\n\r\nLunch by the falls is perfect and also if you want to take you time and do it overnight, there is a campground right past the top of the falls. Sunset camp is the name. You can find it on the map here: http://www.parks.ca.gov/pages/540/files/BigBasinRedwoodsFinalWebLayout030311.pdf\n\r\nIt takes about 2 hours to get there from San Francisco so it is best to take off early."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7eb"},"Report":{"Rating":"4","Text":"Busted out my VFF footgloves for a nice 8 mile swagger with some friends -- consumed 4 packets of turkey jerky and one chocolate bar. Trail would be ideal for running in most areas, great waterfalls."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7ec"},"Report":{"Rating":"5","Text":"I just did this hike this past weekend with a couple of friends and had a great time.  We were planning on a backpacking trip but learned that the backpacker camps didn't open until May so we were forced into just a day hike--but we picked a good one.  \n\r\nPart of the Skyline to the Sea trail was closed, so we headed along the Dool trail to a crossover trail where we connected to the Skyline to the Sea Trail.  I HIGHLY recommend a clockwise loop because  you get to look at all of the waterfalls as you approach them, rather then walking by the top and away for them and then turning back to look at them.\n\r\nThe trail was a bit muddy in a few parts from recent rains, but other than that not too bad, and it wasn't particularly crowded until we were almost back at the trailhead."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66da7c6fb8225aa9c7ed"},"Report":{"Rating":"5","Text":"Beautiful hike, one of my favorites so far. Not for beginners unless very determined because of length and amount of elevation change."},"Name":"Berry Creek Falls Loop at Big Basin Redwoods State Park"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7ee"},"Report":{"Rating":"5","Text":"It's wonderful fall to view. It's great hike also."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7ef"},"Report":{"Rating":"5","Text":"Rất thích những kỳ vĩ của thiên nhiên."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f0"},"Report":{"Rating":"5","Text":"i must say..it is the best falls in the word and best hikes"},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f1"},"Report":{"Rating":"5","Text":"the best hike... must go with friends only"},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f2"},"Report":{"Rating":"5","Text":"vary adventures place....Great Hike"},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f3"},"Report":{"Rating":"5","Text":"Planing to hike on April 30th 2014 alone....\r\nAnybody who I can join?\r\nI will be staying on Curry village from April 29\n\r\njust afraid of bears and mountain lions"},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f4"},"Report":{"Rating":"5","Text":"took us about 7 hours hiking this trail on an wet, icy, snowy trail using mist trail to nevada falls and taking john muir trail back to parking .... took our time with tons of selfies, rest to drink, snacks etc ..."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f5"},"Report":{"Rating":"5","Text":"Definitely a five star hike, though I'll admit that I did get started VERY early in the morning (7am) to miss the crowds that will gather in summer.  I was on my own at the top of Nevada Fall and had to wait for a couple from France to show up to take my picture!\n\r\nI also suggest taking the John Muir route down, less so because of the knees but because of the traffic that will be coming up behind you if you go early."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f6"},"Report":{"Rating":"4","Text":"The Mist Trail is spectacular, as it climbs up almost vertically next to the Vernal Falls. Only reason I am not giving it 5 stars is that it gets really crowded on peak season days."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f7"},"Report":{"Rating":"5","Text":"The best hike for your time in Yosemite.  Just the hike to Vernal is an amazing experience, but Nevada is nothing to sneeze at. This hike can be very tough on the knees.  If you have tender knees (or plan to), hike down the John Muir Trail, which is a bit longer but much easier on the knees. \n\r\nThe waterfalls and views never fail to impress me, and I've probably seen them 10-15 times."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f8"},"Report":{"Rating":"5","Text":"Great trail.\r\nI did the Mist-John Muir version of the trip. It took 6 hours enjoying and taking photos. We started the trail with only 1,5 litres of water and half the way (on top of Nevada falls) the water was finished and we had to wait almost the end of the trail (footbridge) to drink again. I suggest you to bring 3 litres each if you plan to take the trip in summer.\r\nIf you have camera equipment you should use a backpack water proof."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7f9"},"Report":{"Rating":"5","Text":"Spectacular views. However a never ending uphill hike with rewarding views along the way. Bring a good rain or windbreaker. \n\r\nThe boyfriend proposed to me up here. Nuff said."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66db7c6fb8225aa9c7fa"},"Report":{"Rating":"4","Text":"Highly recommended hike--but 1-3 hours is a misprint. 6 hours is going to be more typical. 4 hours is for well conditioned hikers not taking time to stop and enjoy the scenery."},"Name":"The Mist Trail - Vernal and Nevada Falls"}
{"_id":{"$oid":"579a66dd7c6fb8225aa9c7fb"},"Report":{"Rating":"5","Text":"@ buddies and I went up there for a two night trip,  weather hanges really quick so we set up camp and went to another lake we new of.  The lake was Heather lake and we hiked on th Tahoe rim trail to get there.  Weather changes really fast and the days we went it rained and thundered for about 3 hours starting around 3.  Great experience though.  If you dont know where to stay, go for the tree line."},"Name":"Lake Aloha Hike"}
{"_id":{"$oid":"579a66dd7c6fb8225aa9c7fc"},"Report":{"Rating":"5","Text":"Departing into the Desolation is always a great feeling of peace. Bring a water filtration system to refill at the glacial lakes, and bring sunblock. Amazing views, great photos of the lake reflecting the bright sky and surrounding peaks. Truly gorgeous."},"Name":"Lake Aloha Hike"}
{"_id":{"$oid":"579a66dd7c6fb8225aa9c7fd"},"Report":{"Rating":"4","Text":"I did this hike with our ladies' hiking group-ages 50+ and it was awesome in beauty and variety of flora and vistas, but challenging at points due to the heat of this particular day. So, take lots of water and enjoy a swim in Lake Aloha before heading back! We decided to take the water taxi back to the Echo lakes Lodge at the end of our day and were SO grateful that was available!!"},"Name":"Lake Aloha Hike"}
{"_id":{"$oid":"579a66dd7c6fb8225aa9c7fe"},"Report":{"Rating":"5","Text":"Şirinler 2 full izle\n\r\n1. filmden çok daha iyiydi..inanılmaz eğlendim... gülmek çok iyi geldi ya... bunlarla büyüdük zamanında,özel bir kanalda haberler öncesi az izlemezdik zamanında... yaşım 30 büyük bir zevkle ve tebessümle izledim... gitmenizi tavsiye ederim.\n\r\nbuneya beyler bunun 5 i çıkmış amerikada insanlar buna bakmaktan bıkmışlar artık çok fazla bakmışlar ben bile bıktım ya kuzenim amerikadan getirdi bunun 5 ini olan üste okadar cok baktım ki bilgisayar çalıştırmadı vidioyu yani Amerika'ya gidin orada bunun 5 kat daha güzeli var anlarsınız siz :D\n\n\n\r\nhttp://www.turkcedublajizle.net/sirinler-2-izle.html"},"Name":"Lake Aloha Hike"}
{"_id":{"$oid":"579a66dd7c6fb8225aa9c7ff"},"Report":{"Rating":"5","Text":"I believe parking is free, but you should fill out a day permit for day hikes, and you need to get a wilderness permit from the El Dorado Ranger Station for overnight trips ($5 + $5/person per day)"},"Name":"Lake Aloha Hike"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c800"},"Report":{"Rating":"5","Text":"Excellent hike! Took me about 2.5 hours. The Muir Woods parking lot was full, but it was easy to find parking near Mountain House Inn. Note that Ocean View Trail is now called Canopy View Trail so look for the new name on the signs. In summer it is perhaps better to do the loop the other way around, because the climb up Dipsea Trail when it's hot without much cover is unpleasant. As others mentioned, the Tourist Club is usually closed for guests."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c801"},"Report":{"Rating":"5","Text":"Took 4 kids on the hike: 10, 8, 5, 5 years olds. Great experience, great views. Bring layers of clothing, temperature was changing quickly between sunny and darker spots. Around lunch time sun was beaming for great panoramic views, but fog came in very quickly. Kids were complaining a little bit, but hike is not tiring. Just make sure they hame some entertainment: walkie talkies, binoculars, singing loud. We would stop every hour, overall took about 4.5 for the loop with 2.5 hours of walking."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c802"},"Report":{"Rating":"5","Text":"Wonderful place, I am a huge animal lover and there were the best Bird Feeding Station jaką widziałam  I've ever seen!!"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c803"},"Report":{"Rating":"5","Text":"had great time would like to go again"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c804"},"Report":{"Rating":"5","Text":"Tremendous,,, Wonderful,, Great Hikes,,,, Very Adventures"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c805"},"Report":{"Rating":"3","Text":"It's not true that anyone can use the Tourist Club facilities. That may have been true in the past, but their policy now is that only their members can use their facilities UNLESS there is a special \"guests\" event. \n\r\nSee their website for more information: \r\nhttp://touristclubsf.org/calendar/"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c806"},"Report":{"Rating":"5","Text":"Kitchen Units Newcastle    \n\r\nKitchen Units Newcastle. Thirty Ex Display Kitchens To Clear. www.exdisplaykitchens1.co.uk £ 595 Each with appliances."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c807"},"Report":{"Rating":"5","Text":"Contrary to what this page states, the Tourist Club is always closed to non-members except for events open to guests, which are listed on their website."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c808"},"Report":{"Rating":"5","Text":"Awesome hike with great views."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c809"},"Report":{"Rating":"5","Text":"I used to live in Sonoma County so we hiked Muir all the time -- read the others notes about parking because it gets a bit sticky there often -- and when doing this trail you'll be a bit more tired than expected -- not saying TIRED just a bit more -- i live in colorado and hike 14er's so i do know TIRED very well :) -- we just recently did this trail with my 7 year old who compared to what he normally does I thought this would be easy/moderate having done it years ago but it crushed him (and even he hiked his first 14er this year Mt.Bierstadt :)  \n\r\nNOW FOR THE QUICK BREAKDOWN ----\u003e THIS TRAIL IS AMAZING!! HONESTLY WHAT CAN'T YOU SAY.. START IN A VALLEY IN THE PARK SEE SOME REDWOODS CONTINUE ON TO LUSH LIFE EVERYWHERE.. REDWOODS START GETTING BIGGER AND MORE AMAZING!!.. GO UP DON THE PANARAMIC PEAK AND SEE THE BAY ARE.. THEN BACK DOWN INTO THE REDWOODS CROSSING SOME BRIDGES AND NICE STREAMS.. EXTREMELY PEACEFUL SURROUNDING THE WHOLE TIME.. AND A GREAT WORKOUT THOUGHOUT ALL OF IT!!  NO MATTER WHAT LEVEL YOU HIKE MUIR WOODS SHOULD BE ON YOUR LIST FROM NEVER HIKED TO HIKE DAILY THERE IS PLENTY THERE FOR EVERYONE :)\n\r\ntwo quick facts to share -- yes the redwoods in muir are not quite that of medocino and humbolt county but for the area they are the best!  \u0026 i had NO idea there was a bar -- next time! :)"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c80a"},"Report":{"Rating":"4","Text":"Good hike. But quite short. We hiked until the visiter center then decided to go up BootJack and connect with Matt Davis Trail all the way to Stinson Beach. I think about 10-12 miles in total. Made for a great hike! But his loops is quite small and the half of it we did before going farther out into the forest took us about 40 min., if that."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c80b"},"Report":{"Rating":"5","Text":"Muir woods is definitely worth a visit. Don't count on the tourist club. Only open a few weekend hours 2 times a month."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c80c"},"Report":{"Rating":"5","Text":"Gorgeous 4.5 mile hike along trails that for the most part avoid all the hustle and bustle and the main entrance, although it goes near the visitor center if that interests you. Part of the hike is amid the redwoods and some of it is along more exposed sunny trails- best of both. It took us a little under 2.5 hours. Great way to start the day!"},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66de7c6fb8225aa9c80d"},"Report":{"Rating":"5","Text":"It has been a while; i was only 17 when I took this trip but Muir Woods is one of the greatest places on Earth."},"Name":"Muir Woods and Tourist Club Loop"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c80e"},"Report":{"Rating":"5","Text":"After reading several reviews for this trail I finally convinced my wife that she would enjoy the Panorama Trail hike. She was concerned that you had to be young and in particularly good shape to make this so called Strenuous hike!\r\nThere is a lot of various conclusions from reviews that may lead someone to think this is more difficult than what it actually is. \r\nHaving just completed the hike last week I wanted to set the record straight for someone concerned about the trail \u0026 from a couple in their mid-50s and moderately fit.\r\nWe took the one-way bus tour from the Lodge at Yosemite Falls to Glacier Point. (Note; book as far in advance as possible as both one way and round trip were sold out this day) Glacier Point is one of the best views of the entire park and you want to see that anyway.\r\nWe took the 10 am tour \u0026 started out on Panorama Trailhead at exactly noon.  The weather was good, a high of about 81* F and the falls were roaring in early summer.\r\nI took regular 2 bottles of water and a 2 litter water bladder filled with ice and water and some snacks. (We had a big breakfast and would snack for lunch -Then reward ourselves with Pizza at Half dome camp later for dinner)  \r\nI carried just the one back pack for the two of us and each of us had a camera and walking stick. (one set Trekking Poles come in real handy)\r\nWalking at a moderate pace \u0026 taking in all the views we were probably passed by every other hiker we saw that after noon and the full 8.8 miles took us 7.10 hours to complete. We stopped at every waterfall with brief breaks \u0026 with a long rest / and snack break @ 5.2 miles in and at Nevada falls. We also found the lookout point mentioned in several reviews that is just after Illouette falls. I must note that after the Illouette falls about 2.7 mile into hike there is about a .50 to .75 mile hike up hill before starting down again. During this part of the Hike we were joined by a rather large full grown bear which was both thrilling and terrifying. But kind of mad that part of the hike worthwhile.\r\nMost of the hike is downhill but there is some uphill while hiking. The views of the valley and of all water falls are unbelievable. I am so glad we took the time to enjoy the hike and see the valley and falls from this vantage point. We skipped the trail to Mist falls down (per my agreement to get my wife to go with me) and instead took the John Muir after Nevada falls. The john Muir offers some great view of the falls and is a series of pretty steep switch backs that can be hard on the knees calves and toes but probable the better alternative to Mist trail if you have concerns for your leg joints.\r\nI can from experience say this trail is worth the aches and pains the next day and could be considered a bit strenuous just due to the length and time spent to complete it. The down hills made both of us sore mainly in our calf muscles with my wife’s the worst for a couple days’ afterword’s.  I would say if you have knee or leg issues this could be painful as it is a long hike 8.8 miles. The weather was good for us but if it was hotter it could make it more difficult and you would likely need twice the water I took on our hike with each person carrying a 2 or 3-liter Bladder of water.  Over all there is nothing along the trail that would be considered difficult or scary … unless you have a close incounter with a bear like we did. Even that was kind of thrilling and exciting for the hike.\r\nI strongly recommend the Panorama trail and suggest walking in your home area for 8.5 mile walks before doing the trail. My wife and I were walking daily and doing 8 mile walks every now and then before heading to Yosemite.  This took us a lot longer to complete than just walking around the neighborhood and small hills. But it is completely doable for anyone who wants the adventure.\r\nGOD Bless"},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c80f"},"Report":{"Rating":"5","Text":"PS: Don't miss the Panorama Cliff/Point! It's got incredible panoramic views ranging from Glacier Point to the Royal Arches, North Dome, and the back of Half Dome.\n\r\nYou'll find the trail that veers left to Panorama Point about half a mile (0.8 km) after you cross the bridge over Illilouette Creek. The trail cuts through a stand of manzanitas; be wary of brushing bare skin against the sandpaper-like bark."},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c810"},"Report":{"Rating":"5","Text":"amazing place. I recommend to all"},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c811"},"Report":{"Rating":"5","Text":"had wonderful experience"},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c812"},"Report":{"Rating":"5","Text":"had a lifetime experience..."},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c813"},"Report":{"Rating":"5","Text":"What an unforgettable hike!  We were lucky enough to do this in early May due to the low snowfall this year.  Great views all around, I high recommend pairing this with the 4 Mile Trail if you have the energy.  The reward is at the top with Glacier Point showing off 270 degrees of awesomeness!"},"Name":"The Panorama Trail"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c814"},"Report":{"Rating":"5","Text":"The hike took us about six hours to complete. Really stunning viewpoints; the scenery was one of the most beautiful I have seen. I did experience some altitude sickness, my first time, so it was kind of odd for me. A lot of chipmunks on the summit, so be warned XD There is this really chubby chipmunk that my group called the king of the mountain, say hi for me if you see him."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c815"},"Report":{"Rating":"4","Text":"Great hike. \n\r\nThe whole hike took about 7 hours, and it was great the whole way through!\n\r\nWhile it is not a very strenuous hike, it's definitely not for everyone. There are a lot of flat sections, but also some very steep ones that will get your heart rape up. I would say that going to the top was a challenge, but doing it twice in a day is also very feasible. The hardest part was probably coming back down, where you have to navigate a steep decent along a rocky area that really took a toll on my knees.\n\r\nThere is a good mix of different types of terrains. Some parts are on soft ground in the shaded woods, some are in the exposed sun, some are on soft ground, while others are quite rocky. For a relatively short (distance wise) hike, there is a very good mix of terrains and views. You see several calm lakes along the wake, views of distant mountains, and just a lot of different parts of nature.\n\r\nThere are some good views along the way, but it all pales in comparison to the payoff when you make it to the very very top. The view is breathtaking, and unlike anything I've ever seen. I won't try to describe it, but will say that you just have to see it for yourself! Since the peak of the mountain is relatively high up, in an exposed area, the winds do get a little chilly, so I would recommend planning out your trip in such a way that you make it to the top when its hottest in the day; account for a 4 hour trip up the mountain.\n\r\nOverall, this is a must do lake tahoe hike. I promise that it won't dissapoint!"},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c816"},"Report":{"Rating":"5","Text":"Especially I love this place. :D :D :D"},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c817"},"Report":{"Rating":"5","Text":"This trail was BEAUTIFUL!  Strenuous at times, and definitely tiresome for a beginner, but more than worth it once you reach the top.  When you arrive, look up to the right and find the highest tip of that large mountain (Mt Tallac).  That's where you're going!  Once we hit the ridge with the snow we thought we had made it, but nope... you have to keep hiking up the back side of the mountain towards the tip which is roughly another 45 minutes to an hour depending on your speed.  At the very top I was in pure awe of the view.  The photos I took just don't do it any justice.  You have to be there to feel and experience it.  On a side note, on the way back there is a guidepost that shows something like straight for floating isle... I don't recall the exact name, but we thought no, we just want to get back so we went right towards fallen leaf lake.  This was a mistake and took us way off track towards the south end of fallen leaf lake (see guide #5 going up... we messed it up coming back).  Instead of hiking back on the trail we used our gps to cut back across through the woods as a shortcut towards the car.  Long story short, it worked and we made it to the trail safely... however, I would not recommend anyone else do that.  Stick to the marked trails and you will have a great time."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c818"},"Report":{"Rating":"5","Text":"The snow covered a majority of the trail so we decided to climb up the rocks to the right of where the supposed trail was.  It made for an even better and super memorable experience.  The views from the top are unreal, I highly recommend if you're in South Lake Tahoe.  It can be done in around 5 hours."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c819"},"Report":{"Rating":"5","Text":"This place really is amazing, definitely on my top 10 list of awesome places in the U.S."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c81a"},"Report":{"Rating":"5","Text":"I was there. Amazing views."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c81b"},"Report":{"Rating":"4","Text":"My kids (ages 19 and 22) were looking for a good hike in the South Lake Tahoe area.  Usually we head to Yosemite however with the fires around Yosemite this year we decided to look in South Lake Tahoe.  We read the reviews, downloaded the app along with the trail map.  We started out from the Trailhead at 6:30 am.  The first half of the trail is through the woods.  The trail climbs from the trailhead to a ridge that parallels Fallen Leaf Lake.  The view of the sunrise above Fallen Leaf Lake is spectacular.  The trail winds down to Floating Island Lake then up to Cathedral Lake.  By the time that you hit Cathedral Lake, the terrain changes from forest floor to scree.  Shortly after climbing above Cathedral Lake you exit the tree line and begin climbing up to the top of the east ridge.  The wind was gusty at Cathedral Lake and up to the top of the ridge.  Upon cresting the ridge the wind is steady and strong.  Highly recommend wind breaker and if climbing early morning bring gloves and a hat.  The climb to the top from the ridge to the summit is steady but not overly difficult.   We reached the summit at 9:30 am traveling at a moderate but not overly aggressive pace.  We headed down, stopped and had a bite to eat at Cathedral Lake and were standing back at the trailhead at 12:30pm.  It was a good hike, I only wish that it was a little longer."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66df7c6fb8225aa9c81c"},"Report":{"Rating":"5","Text":"This was a great day hike even in the heat of summer. More than half the trail is heavily shaded and by the time the trees are gone the wind is strong enough to need a windbreaker. The view form the top is amazing. You may also fined the true kings of the mount (Chipmunks) to be so friendly that if you sit still for long enough the will jump on top of you."},"Name":"Mount Tallac, Lake Tahoe"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c81d"},"Report":{"Rating":"5","Text":"We visited for the first time in March of 2014 and again on February 2015. It was beautiful both times, the flowers more better in March though. We also did this guide in reverse, going to the lighthouse first then climbing down. It is tougher on your knees, but the views seemed much better this way. The trail posts could be better, so keep your eyes open to not turn on the wrong trail. If you do go the wrong way try to enjoy it XD."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c81e"},"Report":{"Rating":"5","Text":"The drive alone going up to the trail was terrifying. No rails at all on those winding cliffs so be thankful there are no alcohol and drugs permitted.\n\r\nMy first time hiking in a mountain and they say this hike is moderate. But this Grand Loop hike is a strenuous one due to the steep elevation changes and loose gravel on the terrain. If you have bad knees or ankles then avoid this hike.\n\r\nWhat are the dangers you ask? Well some of the sections on this mountain trail have some steep and scary cliffs where you would rather not have a slip and fall. I was concerned for the 4 teenagers I had with me and we got through it.\n\r\nYour acrophobia (fear of heights) will be tested on this hike. We actually saw a group of hikers turn back the other way because of a particularly steep section with a narrow trail. Bring a camera because the views are priceless. The only thing bad we could say about The Grand Loop hike is that our feet and legs were pretty sore the next day but overall this hike will give you an everlasting experience. \n\r\nGrand loop hike Footage:\r\nhttps://www.youtube.com/watch?v=5HoI-rYulK0"},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c81f"},"Report":{"Rating":"4","Text":"I found it a strenuous hike because of loose gravel, high elevation and sun. About 1/3 of the hike is under shades. I did not have a hat and got almost sun sick around noon. I suggest to start the hike early morning and bring a lot of water, wear hat and sunglasses. Enjoyt the panoramic view to all the bay area from this trail."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c820"},"Report":{"Rating":"5","Text":"We did this walk on New Year's Day 2014.  Our group was five people who are reasonably fit (a college athlete, 4 regular runners, etc.) with limited hiking experience.\n\r\nWe found the terrain slightly challenging but very enjoyable.  The route starts out largely downhill on a wide fire road.  We took a detour on Eagle Peak Trail (just for fun) once we reached Murchio Gap and took another detour down Meridian Ridge before retracing our steps.\n\r\nDespite poor air quality in the Bay Area on the day of our hike we were rewarded with spectacular views in all directions and a nice afternoon's worth of exercise.\n\r\nThe hike is definitely worth undertaking but one shouldn't underestimate the need for water and layered clothing as we went from very comfortable warm weather at the start to cold and windy weather near the end after most of our group had worked up a decent sweat."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c821"},"Report":{"Rating":"5","Text":"I would rate this hike as difficult due to some very steep sections, but the views are amazing every step of the way and are your reward for taking this hike. \n\r\nThe drive up is a little scary due to all of the cyclists - with few kick-outs, you have to really be sure before passing or being passed by on the long windy road to the top.\n\r\nThe Grand Loop took us a bit under 3 hours. We started before 10AM and were practically alone for the first half of the hike. We passed a couple of mountain bikers along the road to Merchio Gap and by the time we got to Summit trail, the parking lot was full and the top of the mountain was crowded. \n\r\nBring LOTS of water. There is little cover and you will want to stay hydrated for the steep sections. A lot of hikers had poles. If I were to do this trail again, I would use them."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c822"},"Report":{"Rating":"5","Text":"Great day hike! It was listed as a moderate hike but I would say it's more difficult. There are many parts that are very steep going down and up. Watch out for mountain bikers who might be skidding down fast and not see you around corners. Each hiker needs to carry their own water, snacks and have good boots on. Sunscreen is a must because much of it is exposed to direct sunlight. Overall it is well worth the time and effort. Amazing how far around northern California you can see."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c823"},"Report":{"Rating":"4","Text":"Amazing views!\r\nTough for a novice like me, but worth it at the end.\r\nMapmyhike app showed 1,400' cumulative climb and 6,075 calorie burn before batteries gave out just under the summit.  \n\r\nRemember to take lots of water.  Our Camelback style backpack water tanks ran out just under the summit.\n\r\nEnjoy the views and the work out!"},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c824"},"Report":{"Rating":"4","Text":"Very enjoyable hike. Views are incredible, although the sky was a little hazy the day I went. If you can catch a clear the day after a rain storm, it would be stunning.\n\r\nMost of it was flat to pretty moderate pitch, but there are a few extended sections of some pretty steep pitch. Check the weather, much of the loop is exposed and it will be scorching in the summer."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c825"},"Report":{"Rating":"4","Text":"Amazing Land.. I hope can back again .. :)"},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c826"},"Report":{"Rating":"5","Text":"Great hike. Very scenic. I would rate it somewhere between moderate to difficult, because some sections are pretty steep. \n\r\nSome things to note:\n\r\n1. The first few sections are flat or even on a downward slope, but the rest of the sections more than compensate for it.\n\r\n2. It is easy to miss the road that connects point #5 (Murchio Gap) to point #7 (Prospector's Gap); we missed it and took a slightly longer route.\n\r\n3. Pay close attention to the trail at Prospector's Gap. There are three roads from there, but the trail continues along the narrowest of them -- as noted in the guide above, follow the signpost that says  \"to summit trail, 1.02 miles\".\n\r\n4. From Prospector's Gap on, the trail is narrow. Watch out for folks on mountain bikes!"},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c827"},"Report":{"Rating":"4","Text":"Greta Hike, I recommend starting at the Summit, not as the guide says at Camp 23. Great Views, Not too hot."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c828"},"Report":{"Rating":"5","Text":"Drove to several places up on Mt. Diablo, Saw some of the great rock formations with petroglyphs. There are great areas for bicyclists, hikers and wheel chairs to go in this park. At the top of the mountain is a wonderful nature center with the history of the Mountain and local Indian legends. Information of the wildlife and a great little gift shop there as well!!! They have gret areas for photography and general viewing! You can see the Golden Gate Bridge from the top of the mountain and most other areas around the mountain!!!( Weather pemitting of course!) Call ahead for hours, bacuase the center closes alittle early!!! Well worht the trip though!!! There are also areas for fossil hunting aroung the mountain!!! Not on park porperty of course!!! I have been up on the mountain several times and it has been worth it every time!!!"},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c829"},"Report":{"Rating":"5","Text":"My favorite loop in the East Bay! This 6 miles are a great workout and you'll get some excellent views along the way."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e07c6fb8225aa9c82a"},"Report":{"Rating":"4","Text":"I went on this loop with the EveryTrail team last October and had a great time. The views of the bay area from the trail were spectacular--I could even see Mt. Tam and the Sutro tower in San Francisco. \n\r\nThere were a number of sections along the trail that were exceptionally steep, which would be difficult for younger kids or anyone with knees that don't always cooperate.  Overall I liked the park and the trail, and hope to come back sometime soon."},"Name":"Mount Diablo's Grand Loop"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c82b"},"Report":{"Rating":"5","Text":"trail loves must visit here.... wonderful experience"},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c82c"},"Report":{"Rating":"5","Text":"First off started to late got their at 9:30 am. had to park down the hill hike up to get a pass place it on dashboard then hike up to trail hike.the hike itself was great very quiet and scenic.I recommend going during the week or on weekends get their at 7:00 am."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c82d"},"Report":{"Rating":"5","Text":"very nice indeed ..  great love this place"},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c82e"},"Report":{"Rating":"5","Text":"I loved it! I took my little sheltie with me and we had a great time. It wasn't too hard, and it is so incredibly beautiful! Definitely going back."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c82f"},"Report":{"Rating":"5","Text":"It was my husband's birthday and we were thinking of enjoying some excitements. So we quickly decided to go for hiking. I was a bit confused if I could really do that. But I found the hiking really slow and enjoyable. I'll definitely have a visit again and of course this time will be accompanied with lots of friends. I'm quite sure this time we will have a great fun together."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c830"},"Report":{"Rating":"4","Text":"Great Hike in the morning before work.  Had a quick hike to the falls at 6:00 AM and got back for work in time.  Easy hike.  The last .6 miles up is easy if you are in shape."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c831"},"Report":{"Rating":"3","Text":"Nice trail. The hubby and I enjoyed it, but I wasn't impress with the waterfall. Over all it was a good time."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c832"},"Report":{"Rating":"5","Text":"Great hike, unfortunately my 10yo didn't make it all the way (he has low muscle tone so sometimes conks out sooner than other kids his age), insisted on turning around about .5mi short of the falls - I gave in because I was a little worried about him making it back up the steep hill at the beginning. My hubby and 12yo made it all the way to the falls and back. If this hike is 'easy' I'm a little worried what a 'moderate' hike looks like. I did love it and want to do it again, maybe with a little more endurance work my youngest can go all the way, or at least DH and I can switch off who turns back early."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c833"},"Report":{"Rating":"5","Text":"The wife and I decided to start hitting the trails as part of our \"Stay Active\" resolution. So we picked this trail as a kick off to our campaign! \r\nGreat trail! \r\nAt the start, its very easy (all downhill). The trail is clearly marked so there is no confusion where to go. \r\nThe falls are beautiful and breath-taking. BUT.... no one mentioned the hike back!!!\r\nThat last .5 miles back is all uphill! Butt kicker! But manageable. \r\nOnce we hit the top, it was all worth it. \r\nAll in all, a great day and a great start to our outdoors adventures."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c834"},"Report":{"Rating":"4","Text":"It was just another Sunday in Los Angeles and I felt like getting out of the city.  It was a quick and easy ride to this trail and worth every minute of it.  We will definitely be going back to the area to do some of the larger hikes in the near future."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c835"},"Report":{"Rating":"4","Text":"Tons of shade, great way to spend a hot day outside.  I went up on a Wednesday, and there was plenty of parking and very few people."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c836"},"Report":{"Rating":"5","Text":"Love Love Love it ... just make sure to take water shoes, you will get wet crossing the creek to get to the final destination but WELL WORTH IT!!"},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c837"},"Report":{"Rating":"5","Text":"Great hike but I hate that last hill."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c838"},"Report":{"Rating":"4","Text":"This was a nice slow hike, good for the kids and to enjoy friends company."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e37c6fb8225aa9c839"},"Report":{"Rating":"5","Text":"Pros: I loved this hike, was easy to get to, lots of shade lots of access to the stream, beautiful scenery, streams were easy to cross and lots of rocks to sit on once you reach the falls. Cons: Small public parking lot so I paid $10 to park in the packing station's lot, too many off-leash dogs. The pros far outweigh the cons, so try it for yourself."},"Name":"Sturtevant Falls"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83a"},"Report":{"Rating":"5","Text":"if you haven't been there, well you should! I have been there with my wife and it was one of our most lovely vacations ever!"},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83b"},"Report":{"Rating":"5","Text":"4. Sınıf Din Kültürü Yıldırım Yayınları Çalışma Kitabı Cevapları\n\r\n4. Sınıf Din Kültürü ve Ahlak Bilgisi Çalışma Kitabı Cevapları Yıldırım Yayınları Tüm Sayfalar. Sitemizde 4. Sınıf Din Kültürü ve Ahlak Bilgisi Çalışma Kitabı Cevapları Yıldırım Yayınları Tüm Sayfalar cevaplarını bulabilirsiniz. Öncelikle siz kendiniz yapmayı deneyin. Burdaki amacımız size yapamadığınız sorularda, yada aklınıza takılan, yerlerde yardımcı olmaktır. Lütfen burdan kontol ediniz, burdan bakıp aynısını yazmak öğrenmeniz açıısndan faydalı olmayacaktır. 2014-2015 Eğitim öğretim yılı.\n\r\nhttp://www.sinifevraklari.com/2014/09/4snf-din-kulturu-yldrm-yaynlar-calsma.html"},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83c"},"Report":{"Rating":"5","Text":"loved this place.... i recommend it to everyone"},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83d"},"Report":{"Rating":"5","Text":"Beautiful bridge in sf,Ca. If u wanna go there and see the pleasant view. go with our cab. plz..visit www.yellowcabexpress.com"},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83e"},"Report":{"Rating":"5","Text":"The views were just perfect, and it even looked like there were some folks swimming down at Marshall Beach. I was surprised there weren't more visitors, since this seems like a thing you *should* do as a tourist visiting SF."},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c83f"},"Report":{"Rating":"5","Text":"I loved the view and climbing around the big rocks on the beach.  Even on a cool foggy night, it was an enjoyable, short hike.  It was too foggy to see the sunset but it was scenic nonetheless.  There wasn't much parking near the north end of the trail, the next time I will drive a little farther down."},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c840"},"Report":{"Rating":"4","Text":"Great one to do with the little one. Lots of wild sage and dill growing on the trail too."},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e47c6fb8225aa9c841"},"Report":{"Rating":"5","Text":"This is possibly one of the top trails in San Francisco.  The hike is short but you have great views of the beaches, cliffs, and of course the Golden Gate Bridge the entire hike (if you go south to north). There are a number of old bunkers along the trail that are great for kids to play on, and you can see across to Marin Headlands on a fairly clear day.\n\r\nYou can extend the hike by starting at Lands End to the south or by continuing to Crissy Field after you reach the golden gate bridge."},"Name":"Batteries to Bluffs Trail"}
{"_id":{"$oid":"579a66e67c6fb8225aa9c842"},"Report":{"Rating":"5","Text":"Great place to visit with your family"},"Name":"Marin Headlands"}
{"_id":{"$oid":"579a66e77c6fb8225aa9c843"},"Report":{"Rating":"5","Text":"i visited this place last december.. will definitely visit again"},"Name":"The Lost Coast Trail"}
{"_id":{"$oid":"579a66e77c6fb8225aa9c844"},"Report":{"Rating":"5","Text":"Great trip.  I take my son and nephews aged 11 to 14 backpacking each year at different locations.  They all agreed this was the best trip yet.  We took three nights and four days for a more leisurely pace with camps at Cooskie Creek, Big Creek, and Shipman Creek.\n\r\nA few logistical comments:\r\n - shuttle seems expensive at first, but well worth it afterwards.\r\n - 'Impassable at high tide' on the charts means impassable with tides above about 3 feet on the tide tables.  Impassable zones are easiest to hike with absolute low tides.  Large rolling rocks litter the wave zones at high tide.  Hard flat sand is uncovered below the rocks at absolute low tide.\r\n - Permitting is very easy compared to hikes on the more popular Sierra trips.  Lost Coast is a top-rated trip that can be easily organized only days in advance.\r\n - Bear cans are easily rented at the BLM office on the way into Shelter Cove.\r\n - Clean fresh water is plentiful.  I prefer to keep the load light and recommend no water filtration system - just iodine tablets.  All creeks on the map, along with other uncharted creeks, were flowing with clear water even during the current drought summer (August 2014)."},"Name":"The Lost Coast Trail"}
{"_id":{"$oid":"579a66e77c6fb8225aa9c845"},"Report":{"Rating":"5","Text":"The Lost Coast is the star of our \"Off The Map\" video series on GearJunkie.com. This episode was filmed in March, 2012, on a two-day trek of the route. Check it out. . .\n\r\nhttp://gearjunkie.com/off-the-map"},"Name":"The Lost Coast Trail"}
{"_id":{"$oid":"579a66e87c6fb8225aa9c846"},"Report":{"Rating":"4","Text":"Fantastic place. I will come here in next year"},"Name":"Mariposa Grove of Giant Sequoias"}
{"_id":{"$oid":"579a66e87c6fb8225aa9c847"},"Report":{"Rating":"5","Text":"truly a great place... awesome"},"Name":"Mariposa Grove of Giant Sequoias"}
{"_id":{"$oid":"579a66e87c6fb8225aa9c848"},"Report":{"Rating":"5","Text":"what a place... very nice.. i would awesome"},"Name":"Cathedral Lakes, Yosemite NP"}
{"_id":{"$oid":"579a66e97c6fb8225aa9c849"},"Report":{"Rating":"5","Text":"This is a fantastic, highly recommended hike. Beware: despite going in June, there was a lot of snow on the trail. Make sure to wear sturdy, waterproof boots so get good grip on the icy parts and be careful. The entire way up is steep, and doesn't really let up until you reach the top. Once there, the views are great. It was very windy and sunny, so bring layers and sunscreen. We stopped for lunch and spent time enjoying the peak. the way down is scarier, because there are some steep, snowy parts. We just slid down(even though you get wet) and recommend doing this!"},"Name":"Lassen Peak, Lassen Volcanic National Park"}
{"_id":{"$oid":"579a66e97c6fb8225aa9c84a"},"Report":{"Rating":"5","Text":"had so much fun there last year"},"Name":"Lassen Peak, Lassen Volcanic National Park"}
{"_id":{"$oid":"579a66e97c6fb8225aa9c84b"},"Report":{"Rating":"4","Text":"This walk was amazing! Being a holiday weekend, the trail was quite crowded; but overall I had an absolute blast. Lassen Nt'l Park tends to be quite warm (if not hot) in the summer, but at the base it was cool and by the top we had traversed across snowpack and the wind was whipping our hair. I would definitely recommend layers and lots of sunscreen!"},"Name":"Lassen Peak, Lassen Volcanic National Park"}
{"_id":{"$oid":"579a66e97c6fb8225aa9c84c"},"Report":{"Rating":"4","Text":"I went here after a 4-day backpacking trip in nearby Trinity Alps and decided to tack on an extra day before driving back to San Francisco.  The trail was covered with snow a good part of the way, but it was compacted pretty well.\n\r\nThe hike was tougher than exected, due to the elevation and the fact that we didn't have breakfast because we only prepared for 4 days.  the views from the top were amazing! We saw shasta in the distance, and even some people skiing down from the top.\n\r\nOn the way down we glissaded down the side and shaved off an hour or so, and it was SO MUCH FUN!\n\r\nWould be interesting to hike this again later in the season when there is less snow, and after a good breakfast."},"Name":"Lassen Peak, Lassen Volcanic National Park"}
{"_id":{"$oid":"579a66ea7c6fb8225aa9c84d"},"Report":{"Rating":"4","Text":"I have been to Mission Peak two times and I will be going back again soon. It is a very very good workout.  Really easy to get to, since you'll see a herd of people walking uphill to the park. Make sure to plan ahead of time, I got a citation for being there after 6.30. Luckily, I didn't have to pay, but you might not be as lucky."},"Name":"Horse Heaven Trail to Mission Peak"}
{"_id":{"$oid":"579a66eb7c6fb8225aa9c84e"},"Report":{"Rating":"5","Text":"One of my favorite things about SF is that you can live in the city, and at any point easily bike out here. This trail is incredibly beautiful; the ruins of the Sutro Baths were the most breathtaking part of the trail. Parts of the Cliff House railbed are preserved along the trail - imagine taking the train along these cliffs! It must have been a marvelous era, when safety wasn't such a big concern. Along the trail, you can see where the Yelamu Ohlone tribe once lived, hunting, fishing and gathering along the coast. Beware that you might not see shipwrecks if the tide is high – I didn't, though the lighthouse was visible."},"Name":"Find Nature at Lands End"}
{"_id":{"$oid":"579a66eb7c6fb8225aa9c84f"},"Report":{"Rating":"5","Text":"My favorite getaway in the city.  Few people who live in San Francisco know about this great area with amazing views and nice hiking trails.  On a nice day pack a lunch and stop off at one of the many viewpoints or walk down to one of the few secluded beaches to enjoy the sound of the waves crashing on the jagged rocks.\n\r\nOn a clear day you can see the Marin Headlands across the bay and the Golden Gate Bridge in the distance."},"Name":"Find Nature at Lands End"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c850"},"Report":{"Rating":"5","Text":"I've done this hike twice and thoroughly enjoyed it. The trail is steep and challenging, particularly the last few hundred yards up the fire road (how the hell they get ANY vehicle up this is beyond me) is SO steep that all of our group slipped and fell on the almost 45 degree slope on our way down.\n\r\nBut I would like to urge readers in search of the steepest climbs in the Bay Area to visit Henry Coe State Park, which has several climbs including the infamous \"shortcut\" up to Mount Sizer, Steer Ridge, and more that are just as steep, longer, and harder. There's a saying that one does not go to Henry Coe to train for the Sierras, but one goes to the Sierras to train for Henry Coe that is not too far off!"},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c851"},"Report":{"Rating":"5","Text":"This hike is definitely not for the weak. While the elevation change is large, but not absurdly high, it is divided into multiple interspersed very steep components that get your heart rate and your legs burning. The trail on which you hike changes from gravel, to rocks, to grass, which keeps the trail from getting stale. If you're also a fan of being out in the sun, then this trail is definitely for you.\n\r\nA few members of my team could not make it up all the way making us cut the hike short, which speaks to how difficult this hike is; not for beginners. That being said, if you are a regular hiker, this is both a fun, challenging, and rewarding trip!"},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c852"},"Report":{"Rating":"5","Text":"This hike is an absolute must, and I agree with aseeburger that the hike lives up to its billing as a strenuous hike, I took 5 hours to complete it, and usually do 10 mile hikes like this in under 4.  I also agree with aseeburger about trekking poles, the 100 dollars I spent on trekking poles the day before was so worth it!\n\r\nI parked at the end of Regency Drive (make sure you get a Good map, you may have to stop by the Mitchell Canyon Vistor Center for that, I was unable to find a good topo map with marked distances for the park online).  The reason you need a good map is because once you get to Trail Ride Road, the trails do not show up on Google (funny thing, I had 4G coverage nearly the entire hike...) until you get to the North Peak Road, which is a good 2000 feet in elevation and a few miles you have to navigate blind, although it is somewhat of a straight shot admittedly.  \n\r\nBest thing was, I did not see a soul until I got to North Peak, a solid 2 hours in (and 3000 vertical feet)!  Saw some deer, and heard a lot of wonderful mountain quiet.  Getting to the top of Mount Olympia and seeing the desolate, gorgeous view was the highlight of the hike.  North Peak, with all of the communication installations stuck on the top was kind of a let down.  Not worth the STEEP hike up from North Peak Trail, unless you just want to bag the peak IMO.\n\r\nStart early (Mitchell Canyon Visitor center is open at 9 on weekends) and enjoy the solitude of the hike (until you get close to Diablo and can hear the shouts from the tourists on the top...)\n\r\nWonderful hike, will do it again soon!!!\n\r\nOne thing that peeved me was the mountain bike tracks on the hiker only trails.  Some bike tracks I saw were in VERY tight single file terrain with steep drop offs.  If I had been unfortunate enough to run into one of them at the wrong spot it could have been disastrous.  Fortunately I did not, but it kind of ruined the enjoying nature part when I kept worrying about getting knocked off the trail at the next turn by a illegal biker.  Not a game changer, just a downer."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c853"},"Report":{"Rating":"4","Text":"This was my first experience in Mt. Diablo State Park.  I was looking for a good all day hike to take in and this one fit the bill.  The ascent isn't very bad.  There were a few spots where I got fairly gassed, but was able to complete it without too much trouble.  The descent on the other hand was brutal.  Steep trails with loose rock that cover most of the descent had my knees screaming at me toward the end.  Coming back down the road right before North Peak summit was downright scary, very steep and almost all loose rock.  If I do this again (and I probably will) I think I'll skip that ascent, the North Peak is pretty marred by radio towers and such anyway.  The highlight of the trip for me was actually Mt. Olympia summit,  it's just a summit should be, nothing else there with beautiful views all around you.  Most of the trails are very cozy and beautiful, but be careful of the poison oak which is very close to the trail in certain places.  \n\r\nOverall a very fun hike.  The descent makes me knock it down a star due to the sheer amount of loose rocky steep trails destroying my ankles and knees."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c854"},"Report":{"Rating":"4","Text":"I made the mistake of going to the wrong gate but decided to follow the same trails with some adjustments. I parked at Juniper campground and went down all the way down via some other trails \u0026 back creek trail to start over. Climbing on Olympia peak with tired legs was tough. North peak has a very tough 200 yards section where I slipped once while coming down but no damage done :) North peak to main summit was OK but it felt very tough as I was exhausted by then. I am giving it 4 stars as the trail is not well marked at times and there are no restrooms or places to rest till you reach main peak summit. Overall it was very satisfying."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c855"},"Report":{"Rating":"5","Text":"Absolutely loved this trail.  Took an easy pace with a first time climber and even hit the summit of Mt. Diablo.  The description was right saying if you took bald creek trail back you would be exhausted but it is worth it.  The views from all over this area were incredible.  I cant wait to hike it again.  Be prepared to be out there all day though."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c856"},"Report":{"Rating":"5","Text":"Just came back from that trail, including the main peak of Mt. Diablo - 14 miles in total. One thing people need to remember is if there are a few routes to the top, the shortest one is likely to be the steepest. This route sounds scary because of the mileage, but out the really steep parts are about a mile in total, the rest is fairly mild. \n\r\nThe views were amazing. It's good to wear layers because there are some cold and windy areas and some hot and dry. Some trails on the way back are cut into clay, so I guess they could get very muddy after rain. \n\r\nOverall, it's a great way to spend a day, highly recommended."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c857"},"Report":{"Rating":"5","Text":"Good hike.  Note that the fastest way back to the trailhead would be Prospector's Gap-\u003eMiddle Trail-\u003eMeridian Ridge-\u003eDonner Canyon.  You didn't list that possibility, bit it's way more direct than back creek.  Another possibility you didn't mention is the all-fire-road return, which goes prospector's gap-\u003emeridian ridge-\u003edonner canyon.  For those who didn't bring trekking poles."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ec7c6fb8225aa9c858"},"Report":{"Rating":"4","Text":"This was a beautiful hike - but the description wasn't kidding when it said it's strenuous and a tough climb to the top.  Once you get there, the view is amazing.\n\r\nIt was the perfect temperature despite being early Summer.  The way back down (option 1) is still a tough scramble down and over loose terrain and at times, steep declines.  If I would do anything differently, it would be to bring trekking poles - these would've been huge and prevented the few slides I took when getting back down. \n\r\nOverall, beautiful.  But definitely make sure you're in good enough shape to handle it."},"Name":"North Peak at Mount Diablo State Park"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c859"},"Report":{"Rating":"4","Text":"Great 10 mile loop, filled with Elk and whale spottings. Easy hike, bring a windbreaker, as there isn't much wind cover if it's whipping in."},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c85a"},"Report":{"Rating":"5","Text":"Dress in layers. We saw a lot of hikers wearing shorts and short sleeves turning back around to leave the trail because of the cold wind."},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c85b"},"Report":{"Rating":"5","Text":"Absolutely amazing. You definitely want to bring a windbreaker, though -- windy as all well. But well worth it for unobstructed ocean views, and I recommend eating your lunch/snack at Tomales Point and take in all the splendor. Amazing."},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c85c"},"Report":{"Rating":"5","Text":"We were fortunate to have perfect weather for this hike, but I imagine it could be uncomfortable if you did this hike on a windy day, therefor I strongly suggest checking the forecast before going. For viewing wildlife, you probably can't top this hike, and the massive 700 lb. elk are just spectacular! I highly recommend this hike, even for the less experienced or less fit hikers among us. Overall, the hike is pretty easy for a 10 mile hike."},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c85d"},"Report":{"Rating":"5","Text":"Very relaxing and peaceful hike. Overall the terrain was not too demanding. Most likely you will see elk and deer for the majority of the hike. They were extremely calm and were not too far from the trail. I picked up a vibe that they were respecting me and trusting that I would stay on the path and not get too close and respect them back, so definitely stay on the path. I'd recommend going in the morning because it's cooler and not too many people are there yet. Amazing views, definitely worth the 10 miles!"},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ed7c6fb8225aa9c85e"},"Report":{"Rating":"5","Text":"The trail at the Point area itself is heavily overgrown and it's easy to loose the main trail. Seems to be a lack of trail maintenance not happening in the Point Reyes area maybe from lack of funding?"},"Name":"Tomales Point at Point Reyes National Seashore"}
{"_id":{"$oid":"579a66ee7c6fb8225aa9c85f"},"Report":{"Rating":"4","Text":"Don't even try to park on Stanford Ave on weekends. There are other entrances to the park, notably one at Foothill and Campus Loop. Parking on the university campus is abundant and in most places not restricted on weekends.\n\r\nThe trail has almost no shade - prepare enough water."},"Name":"The Stanford Dish Hike"}
{"_id":{"$oid":"579a66ee7c6fb8225aa9c860"},"Report":{"Rating":"4","Text":"This is a very good hike centrally located for many in the south bay and peninsula. It has very nice views of the surrounding area and makes for a good morning hike. However, the sheer number of a people on the trail in a major drawback. Its hard to  get away from the hustle and bustle of society when there are hundreds, if not thousands, of people on the trail on a weekend morning. I would probably go back, but its not my first choice for hiking."},"Name":"The Stanford Dish Hike"}
{"_id":{"$oid":"579a66ee7c6fb8225aa9c861"},"Report":{"Rating":"5","Text":"@Trailking: Bikes are prohibited and so are dogs. Unfortunately (in my opinion at least) the rules are a bit strict at the Dish. You can't even go off trail for more than 10 meters before an official comes and summons you back on trail. A friend of mine who has lived in the area for more than 50 years told me that (obviously) this trail was very different when he was a kid: everyone could go where they wanted, and there was a network of trails (as opposed to one paved loop that exists today). \n\r\nStill, the Dish is a great loop for  run, or family hike. I still go there almost every week."},"Name":"The Stanford Dish Hike"}
{"_id":{"$oid":"579a66ee7c6fb8225aa9c862"},"Report":{"Rating":"4","Text":"This was my go-to hike/run for years and is still one of favorites. It's such an accessible hike for people near Palo Alto, and it affords incredible views of the valley and bay, thanks to the generosity of Stanford University and the foresight of the Stanford family to preserve the open spaces. Be on the look out for everything from tarantulas to prarie dogs to low-flying hawks and of course the myriad satellite dishes talking to ET :-)"},"Name":"The Stanford Dish Hike"}
{"_id":{"$oid":"579a66ee7c6fb8225aa9c863"},"Report":{"Rating":"5","Text":"This guide has great information. It almost looks as if bikes could be ridden on some portions of the route. Are they prohibited or just not recommended?"},"Name":"The Stanford Dish Hike"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c864"},"Report":{"Rating":"5","Text":"Epic hike, not too crowded, even on a beautiful Saturday!\r\nGreat signage! Harkins ridge has some of the prettiest views of any hike I have ever been on. \r\nI strongly recommend this hike."},"Name":"Purisima Creek Redwoods"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c865"},"Report":{"Rating":"5","Text":"The type of hike you can do over and over and over again!"},"Name":"Purisima Creek Redwoods"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c866"},"Report":{"Rating":"4","Text":"Love this hike! Big trees, walk along the creek. Lotsa Banana slugs and newts when it's been raining, so watch your step. Not super sunny because of all the trees, so bring layers. We've gone back here a few times and every time it's awesome!"},"Name":"Purisima Creek Redwoods"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c867"},"Report":{"Rating":"4","Text":"I hiked this trail on Sunday. It took about 7 hrs, but we spent quite a bit of time down in the Gulch, because there's just so much to explore (we saw lots of interesting wildlife). The only reason why I'm giving this 4 stars and not a 5 is because: 1) we didnt really ever find a nice sunny hillside to relax on for an hour or so, and 2) because I agree with those who have said this trip is probably nicer in reverse."},"Name":"Purisima Creek Redwoods"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c868"},"Report":{"Rating":"5","Text":"sounds like a COOOOOOOOOOL place... gonna visit it sooner"},"Name":"Alum Rock Exploration"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c869"},"Report":{"Rating":"5","Text":"just loved it... visited twice in a year ;)"},"Name":"Alum Rock Exploration"}
{"_id":{"$oid":"579a66ef7c6fb8225aa9c86a"},"Report":{"Rating":"5","Text":"There is parking outside the park. You can walk in through a side gate. It's a bit of a walk to get to the actual campground but its a nice walk. Shaded on some parts. Creeks along the trail. After going past all the picnic area, you will see the path to the hiking trails and see all the old grottos and water outlets. Lots of blue jays. Saw a baby deer."},"Name":"Alum Rock Exploration"}
{"_id":{"$oid":"579a66f17c6fb8225aa9c86b"},"Report":{"Rating":"5","Text":"uffff.... it was a narrow escape"},"Name":"Briones Regional Park Exploration"}
{"_id":{"$oid":"579a66f17c6fb8225aa9c86c"},"Report":{"Rating":"5","Text":"i remember that day... i was feelin sick.. but mt freinds gave me a great time"},"Name":"Briones Regional Park Exploration"}
{"_id":{"$oid":"579a66f17c6fb8225aa9c86d"},"Report":{"Rating":"4","Text":"The trails are easy to walk on, and you have great views of the local mountains including Mt. Diablo. I have taken many photos of birds, insects, deer, etc... Make sure you take a insect spray for ticks. They do have ticks with lyme disease there, so be careful. I have never ahd any issues though! Bring water to drink, it can get hot in areas with no cover!!"},"Name":"Briones Regional Park Exploration"}
{"_id":{"$oid":"579a66f17c6fb8225aa9c86e"},"Report":{"Rating":"3","Text":"OK, we got to meet some newts on this one. Anyone seen newts on their hikes?"},"Name":"Briones Regional Park Exploration"}
{"_id":{"$oid":"579a66f37c6fb8225aa9c86f"},"Report":{"Rating":"5","Text":"This is great! I have been at Pescadero several times enjoying the sunset and views, but never explored away from the beach. Will definitely follow this guide on my iPhone next time."},"Name":"Pescadero State Beach Exploration"}
{"_id":{"$oid":"579a66f47c6fb8225aa9c870"},"Report":{"Rating":"5","Text":"I've heard of Sibley Volcanic Preserve and often desired to explore it, but never found where to start!  This site (and downloadable app) is my key to a great adventure - thanks!  Also, I will be sharing this entire \"vitual field trip\" with my 6th grade science students at MJHS this spring, as we discuss volcanoes ;)  Hopefully, I'll inspire many of them to take the walk, too!!"},"Name":"Sibley Volcanic Regional Preserve Exploration"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c871"},"Report":{"Rating":"5","Text":"amazing place.... just loved it"},"Name":"Eaton Canyon"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c872"},"Report":{"Rating":"4","Text":"Anyone know if there's water flowing this year? anyone who's been here recently?:) would appreciate the inside scoop, thank you."},"Name":"Eaton Canyon"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c873"},"Report":{"Rating":"5","Text":"Awesome Waterfalls!!!! I don't recommend for young children, under 7, streams can be somewhat difficult for them to cross... If your not paying attention for hidden signs you will completly miss the signage marked for the falls... Once you get to the falls it's a great place to relax and eat lunch before heading back..."},"Name":"Eaton Canyon"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c874"},"Report":{"Rating":"5","Text":"The beginning of the hike was easy but I don't recommend taking kids younger than 6, it's hard getting across some of the streams but well work the hike to the falls."},"Name":"Eaton Canyon"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c875"},"Report":{"Rating":"5","Text":"This article is very interesting , I was amazed to read\n\nsbobet\njudi bola\njudi online\nprediksi bola"},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c876"},"Report":{"Rating":"5","Text":"Absolutely lovely.  The ascent is not terribly steep, but is unrelenting and without a lot of shade.  The lovely views, however, are a compensation, and in my mind would justify the effort by themselves.  But once the trail tops out, it becomes absolutely stunning.  We took the first (unmarked) trail to the left, and by picking randomly at the various branchings managed to see four of the five lakes, each of them with a unique and striking beauty.  Trail markings are virtually nonexistent, so be sure to bring some kind of map, if only on your cellphone.\n\r\nThe greatest confirmation of this hike's high rating is that I went with six rather jaded 18-25 yeard-olds, and all of them gushed about the esperience.\n\r\nI do recommend to come early, as we did.  We had the lakes mostly to ourselves, but on our descent passed about 40 people upward bound."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c877"},"Report":{"Rating":"5","Text":"The lakes are beautiful and there is plenty of shade once you get to the lakes. There is a steady and steep ascent on the way to the lakes and steady deline on the way back. There are some rocky and narrow paths that are too narrow and unstable for a stroller. Very dog friendly. Keep your eye out for the lakes, you will come to a point where the path splits and there is a sign telling you the PCT goes one way and the lakes are another way but the trail towards the lakes is hidden by some fallen trees. I cant imagine doing this when it is snowy or icy though."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c878"},"Report":{"Rating":"4","Text":"It is a very beautiful hike and even more picturesque at the end. It takes a while to see all the lakes, but the best place to hang out is around the 2 biggest lakes. Bring some food, drinks and a blanket and spend the whole day there. Very peaceful and serene. \n\r\nThe hike itself is of average difficulty (7 out of 10). If one takes it slow, its very enjoyable. There is a lot elevation gain and the trail gets a little rocky at places, but nothing manageable. I saw kids, families and people of all ages attempt this.  Its a dog friendly area, and pretty shaded near the lakes."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c879"},"Report":{"Rating":"4","Text":"Worth the effort.  After a good climb we ate lunch next to one of the lakes with a cool breeze.  Still a little snow on the ground which made the time my the lake that much more refreshing.  The climb is on a south facing trail so bring water.  Even in May the trail was crowded but everyone was friendly."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c87a"},"Report":{"Rating":"4","Text":"Thanks to everyone for the comments and the likes. Based on your views, we've changed this hike from 'Easy' to 'Moderate'."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c87b"},"Report":{"Rating":"4","Text":"Panoramic views toward Alpine Ski Resort and Granite Chief Wilderness.  \n\r\nI would not rate this as an easy hike either.  The near-1,000' elevation gain in 2 miles is not for the rank beginner. I also slipped a few times on the decent on sandy sections on the boulders. \n\r\nMild temps, lack of accumulated snow on the trail and relatively few other hikers made this a very enjoyable hike for mid-November.  I only found 2 of the 5 lakes.  The trail linking them wasn't abundantly obvious on the day I hiked.  There was a bit of packed ice and snow in sections."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c87c"},"Report":{"Rating":"4","Text":"Warning, I'm a begining hiker age 39, and this was tough.  The path is very traveled which is a plus but its not easy as described.....as you climb 900 ft in 2.5 miles to the lakes.  some of the trail is granite face too...saw a lot of age groups from young to senior. The reward was the lake beautiful, warm enough to swim....i enjoyed it pack a lunch and drinks."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f57c6fb8225aa9c87d"},"Report":{"Rating":"5","Text":"I would not say this is an \"easy\" hike since it is 2 miles of steady climbing.  My mapmyride hike had it at a catagory 2 climb.  980 vertical feet in 2 miles.  It is very beautiful with very little shade."},"Name":"Five Lakes, Granite Chief Wilderness, Lake Tahoe"}
{"_id":{"$oid":"579a66f67c6fb8225aa9c87e"},"Report":{"Rating":"4","Text":"As a newcomer to the region, I'd been by this trailhead a few times and decided today was the day to tackle it. Was not disappointed. Fantastic experience. Lots of route-finding and some granite scrambles and if it's a day like today, you might find the route rather exposed to the sun in places, so bring a lot of water, a good wide-brimmed hat, sunscreen, and don't be shy to wet your shirt in the creek if you want. You'll see a number of different life zones, including bare granite with sparse vegetation, redwood forest interspersed with pinions--pinions are Nevada trees that smell like vanilla as you walk by, and if you put your nose up to the bark you get a strong whiff of caramel or butterscotch--manzanita groves, and finally raging rapids, swimming holes, and waterfalls. I saw lots of people of all ages and walks of life. Good for just about everyone. Just be sure to be prepared for the elements, and it's easy to lose the main trail, but don't get discouraged, there are multiple ways to hike up.\n\r\nThe only major bummer of course is parking. I was able to park (along with many others) in what looked like private property about 100 years west of the trailhead parking. I did worry a bit about coming back and finding my car towed, but I spent"},"Name":"Horsetail Falls, Lake Tahoe"}
{"_id":{"$oid":"579a66f67c6fb8225aa9c87f"},"Report":{"Rating":"4","Text":"Visiting this easy-access cascade for the second time with my college-grad daughter, I decided to go the whole route and make it up to the top of the falls to see Avalanche Lake.  Mission accomplished, yes, and the destination was enjoyable, but with this disclaimer: Two-thirds of this hike is VERY difficult for the inexperienced hiker!  Also for an old guy like me! \n\r\nI am sixty, in excellent condition, very nimble on my feet, and yet, it was challenging. . . ultimately not such an enjoyable trek, due to the boulder-hopping and maneuvering one must do while trying to discern the rocky trail.  Caution: After the lower Cascade Vista alongside Pyramid Creek, the trail practically disappears into the vast expanse of granite after officially entering Desolation Wilderness.  It's up to you to make your way to the top of the crest, but once you're there, near the top of the falls, the dirt trails appear once again and Avalanche Lake (a small one) is close at hand, and a relaxing place to rest.  \n\r\nThe descent was more demanding, because by then, the blisters and leg fatigue began to be troublesome.  However---I have to give credit where it's due: the beautiful views and the rushing water provide relief all along the way.  I won't be doing the full hike again, ever, but I will visit the Cascade Vista again, for sure.  I'm grateful for the experience.  I learned that I cannot push myself into such vigorous climbs, nor expect my guests to desire the same."},"Name":"Horsetail Falls, Lake Tahoe"}
{"_id":{"$oid":"579a66f67c6fb8225aa9c880"},"Report":{"Rating":"4","Text":"Thanks for the comments and all the 'likes'. We added a comment to remind folk that the parking lot is closed in off-season months."},"Name":"Horsetail Falls, Lake Tahoe"}
{"_id":{"$oid":"579a66f67c6fb8225aa9c881"},"Report":{"Rating":"4","Text":"Difficult to navigate, mostly due to rocky nature of the trail, there are sparse signs but for most of the trail we had to repeatedly wait and guess. we saw many others confused (perhaps someone familiar with the trail should mark arrows on rocks with the paint?, I've seen this in other places). But as long as you stick close to the river you are fine. It is a moderate trail. Takes about 2 hours for relax climbing to get to the falls. Not a huge water fall in Autumn. But trail is scenic and fun, and of course you hike along pyramid creek."},"Name":"Horsetail Falls, Lake Tahoe"}
{"_id":{"$oid":"579a66f67c6fb8225aa9c882"},"Report":{"Rating":"4","Text":"I was glad to try a new hike in the Lake Tahoe area. My friends chose this hike because it wasn't too difficult for the children. Our plan was to hike up to the base of Horsetail falls, but we never quite got there due to time, heat and most of the hikers were ready for burgers at Izzy's. The trail was nice when it was near Pyramid Creek, but the parts on the rocks that were exposed to the sun were not as nice. As the trail got higher up, it was harder to find. We stopped at a point where the trail was getting lost in the brush. We could see Horsetail Falls from this spot. On the way down we took the rest of the lower loop which was mostly on very steep, flat rocks. This wasn't as fun. We somehow got off trail and ended up at US 50 a few 100 yards from the parking lot, which is not where we parked because it was full. We parked across the freeway along a forest road. Not sure if that was allowed, but we got no tickets. I'd like to try the hike again and get to the top of the water falls. Even if you don't get to Horsetail Falls, there are plenty of smaller water falls along the way to enjoy."},"Name":"Horsetail Falls, Lake Tahoe"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c883"},"Report":{"Rating":"5","Text":"met a girl there... i was fun ;)"},"Name":"Castle Rock State Park Loop: Saratoga Gap and Ridge Trails"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c884"},"Report":{"Rating":"5","Text":"very nature rich... great experience"},"Name":"Castle Rock State Park Loop: Saratoga Gap and Ridge Trails"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c885"},"Report":{"Rating":"4","Text":"Beautiful hike. The rock formations and the views of the valley are excellent. The nearby gun club certainly takes away from the tranquility of your hike while hiking the Ridge Trail. I liked the different terrain and trail types encountered on this loop hike."},"Name":"Castle Rock State Park Loop: Saratoga Gap and Ridge Trails"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c886"},"Report":{"Rating":"5","Text":"I ditched out of work early on a Monday to head out to this hike! The view is amazing. We took the Saratoga Gap trail (~7.3 miles) up and around (clockwise). The trip took us about 2.5 hours at a moderate walk. I have been here a few times before, and will definitely be going back! But as a warning if you go on a weekend, go early, it gets pretty busy."},"Name":"Castle Rock State Park Loop: Saratoga Gap and Ridge Trails"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c887"},"Report":{"Rating":"5","Text":"The views on this hike are amazing."},"Name":"Castle Rock State Park Loop: Saratoga Gap and Ridge Trails"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c888"},"Report":{"Rating":"5","Text":"This is place is truly relaxing. It's been an exact year since we visited this place. We went a little further than the allowable margin, me and hubby both been stubborn. Guess we're just adventurious then."},"Name":"Lower Yosemite Falls"}
{"_id":{"$oid":"579a66f77c6fb8225aa9c889"},"Report":{"Rating":"4","Text":"This is usually a mandatory stop when you are spending a few days in the Valley.  It's fun to climb on the rocks to get closer, but it is usually VERY crowded here during summer, and you can't appreciate the full height of the falls from up close, because you can only see the bottom segment.\n\r\nBut the hike is so quick, that there is no reason to skip it."},"Name":"Lower Yosemite Falls"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88a"},"Report":{"Rating":"5","Text":"life time experience... had a great trip there"},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88b"},"Report":{"Rating":"5","Text":"Just Loved It... i visited it with My childhood friends.. it took us 7hrs... had a great time"},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88c"},"Report":{"Rating":"4","Text":"I did this loop sole doing the whole thing backward.  Upper winter creek - visit hoegees camp - mt. zion trail and summit - spruce camp - upper fall - chantry flat.  I started at around 8 am and the whole thing lasted about 5 hours.\n\r\nI ran into a young Asian gentleman with his 5-6 year old son at upper winter creek who camped at hoegees camp and coming back to Chantry Flat.  I looked at his backback and admired his packing skills.  The backback looked so neat it even looked like a wooden box.  I asked him if it wasn't cold at night, but he shrugged off mentioning warm sleeping bag.\n\r\nPersonally upper winter creek trail has good open mountain view and near Sturtvant Camp had good canyon views.\n\r\nA great one.  Next time I am going to Mt. Wilson via Sturtvant Camp and come back via Upper Winte Creek - I think it is 13 miles RT, but I also heard that it feels more like 15 miles.  But I will see."},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88d"},"Report":{"Rating":"5","Text":"We had a great time doing this hike. It took us about 5 hrs, we chose to do the lower winter trail at the end to cut out 1 mile because it was getting dark. Plan on doing this again in the early morning. Bring plenty of water, bug spray and snacks. be on the lookout for bears too!"},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88e"},"Report":{"Rating":"5","Text":"We called it a Mothers Day Hike because that's what the celebrant wanted to do for Mothers Day and what an awesome treat we got.  Enjoyed the Water Fall. Very Scenic and mind freeing, talk about free therapy. The Creek/brook provided coolness and a very comfortable temperature while hiking along it, but you will definately feel the heat once you move away from it. Took water and light snacks, many areas where you can sit by the creek for a light bite. The Climb up the asphalt hill at the end was very challenging especially in the last few turns when your butt will really feel the shift in gradient. In the end though it was all worth it... Highly recommend this trail and i will be doing it again. We finished the day off going to Old Town Pasadena where you can find some great restaurants and watering holes, what ever your heart desires."},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66f87c6fb8225aa9c88f"},"Report":{"Rating":"5","Text":"LOVE love loved it. We did the loop in 4hr 10min lots of water crossing some small and lots of wide ones so make sure you take an extra pair of socks. Did this hike at 830 An on a  pretty cool day in the mid 60s pack a light snack and plenty of water"},"Name":"Big Santa Anita Canyon Loop with Upper Trail"}
{"_id":{"$oid":"579a66fa7c6fb8225aa9c890"},"Report":{"Rating":"4","Text":"Today, our third hike here in as many weeks. Wildflowers still great, especially along stream beds. Saw Lewis' Monkeyflower (Mimulus lewisii) for 3rd time in 40 years. Delphinium bloom just incredible but lost on many as they are often buried in lush lupine stands this year. 3 pink lupine on the Roundtop outlet stream!\n\r\nHave hiked the Winnemucca/Roundtop/Woods loop 20+ times. I saw a lot of families today following your suggested route from campground up to Round Top Lake and back down from Winnemucca. As many times as I have done this, I believe the reverse route is much more friendly, pleasant, etc. The dust, grade, exposure (little shade) and trail(?) condition on the Lost Cabin Mine leg are trying for experienced hikers, never mind folks out for a Sunday stroll. I'd change this recommendation to follow the Woods Lake inlet stream trail up to Lake Winnemucca, over the pass to Roundtop Lake and down to Woods Lake."},"Name":"Round Top \u0026 Winnemucca Lake, Carson Pass"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c891"},"Report":{"Rating":"5","Text":"This is a great, not so hard, hike through Uvas Canyon.  Waterfalls are a great draw and definitely the highlight of the area. They are something unique we don't see very much in the bay area."},"Name":"Waterfall Tour of Uvas Canyon County Park"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c892"},"Report":{"Rating":"5","Text":"It was amazing, we got a bit of rain, but at the end it was all worth it"},"Name":"Waterfall Tour of Uvas Canyon County Park"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c893"},"Report":{"Rating":"5","Text":"Great place to go to beat the summer heat. Not too strenous, lots of shade, cool misty waterfalls, not too many people on the trail, and enough varied terrain to keep the kids from getting bored"},"Name":"Waterfall Tour of Uvas Canyon County Park"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c894"},"Report":{"Rating":"5","Text":"Great trail, great area! This was a nice, not too hard hike. The recommendation given here to go up to Donner Peak is good advice. It is well worth it. Note that this deviation is not signed, so you'll have to be alert (and pay attention on the way up, so that you can retrace your steps on the way down)."},"Name":"Mt Judah \u0026 Donner Peak, Tahoe National Forest"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c895"},"Report":{"Rating":"5","Text":"Climbed this trail on New Years! It had been over a month since the last snow, but the snow was still pretty deep - totally bare ground in some places, but up to your knees in others.  The snow also made it kind of hard to find the trail sometimes, but the map on the everytrail app helped a ton! Beware that donner summit road doesn't get plowed, so best to park on one of the plowed roads and walk to the trail head. Totally gorgeous. We had a great time!"},"Name":"Mt Judah \u0026 Donner Peak, Tahoe National Forest"}
{"_id":{"$oid":"579a66fb7c6fb8225aa9c896"},"Report":{"Rating":"3","Text":"Maybe it was me but we couldn't find the trail head from these directions. We ended up parking by Sugar Bowl and then climbing Mt. Lincoln following the cat track/road up to the top. We had a nice hike but the terrain wasn't particularly varied since it was a ski resort.  On the other hand, it had great cell coverage if we got in trouble when we climbed down the back way over the lava."},"Name":"Mt Judah \u0026 Donner Peak, Tahoe National Forest"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c897"},"Report":{"Rating":"5","Text":"One of the best hiking trail around love the hike. but make sure you take a lot of water. Beautiful!!"},"Name":"Navajo Loop and Queen's Garden Trail"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c898"},"Report":{"Rating":"5","Text":"No question that you should do the trail in reverse going down the much steeper Navajo Trail from Sunset Point and finish by doing Queen's Garden Trail back up to Sunrise Point ( I think).  After some serious hiking you would not want to finish by hiking the steep switchbacks up to Sunset Point. Yaktrax are an excellent suggestion. There were ice patches I could have skated on in Feb and I fell on one of them. Wall St is closed until spring and you need to be aware of this. They cite a federal code or law that prohibits passage and it looked dangerous."},"Name":"Navajo Loop and Queen's Garden Trail"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c899"},"Report":{"Rating":"5","Text":"I did the trail in reverse early Feb. 2012. I saw nobody for the whole 2 hours. They put a sign and said the Wall street section is closed for the winter. But I went through anyway. The trail on Wallstreet is covered with ice and snow. So going up is a lot easier than going down. Hiking boots are required. YakTrax is recommended. The snow melted on Queen's garden trail. It is muddy. Warm when the sun is out."},"Name":"Navajo Loop and Queen's Garden Trail"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c89a"},"Report":{"Rating":"5","Text":"I've always done the loop in the reverse direction as this, but either way it's one of the most beautiful hikes I've ever done.  I like having the big views on the way down, instead of having those to my back on the way up."},"Name":"Navajo Loop and Queen's Garden Trail"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c89b"},"Report":{"Rating":"5","Text":"Love the hike!! Went up there in June the only problem is there a lot of people kind of sad when there is over crowding. Love the view!!"},"Name":"Delicate Arch"}
{"_id":{"$oid":"579a681a7c6fb8225aa9c89c"},"Report":{"Rating":"5","Text":"Loved this trail! I would say the hardest part of this hike was the lack of shaded areas to rest, we were able to find a few and I would definitely suggest stopping at the few that exist when you have the opportunity. Most of this trail is under direct sunlight so the little shady spots you can find are a big life saver!"},"Name":"Delicate Arch"}
{"_id":{"$oid":"579a681b7c6fb8225aa9c89d"},"Report":{"Rating":"5","Text":"Absolutely loved LOVED this trail and all it had to offer. I would however say that I wouldn't at all consider it an \"easy\" hike as a lot of it was not marked and it definitely required some scrambling up and around rocks, just make sure you are comfortable with that and you should be fine. The sand also slowed us down a lot, as we did the entire trail and all the extra little trails off of it to see the other arches. It is 100% worth the effort though! Just wanted to warn people of the scrambling parts because when we were doing it we ran into quite a few people who nearly fell off certain parts and couldn't do quite a few of the parts of it. All that aside I would go back again and again to do this hike!"},"Name":"Devils Garden and the Primitive Trail"}
{"_id":{"$oid":"579a681b7c6fb8225aa9c89e"},"Report":{"Rating":"5","Text":"Certainly the best hike in Arches for the number and variety of arches be square inch.  And good for escaping the worst of the crowds in the more remote back sections.  But, although the terrain is straightforward with no significant elevation change, scrambling or exposed sections, I certainly wouldn't describe this hike as 'easy'.  As an experienced local hiker, I wouldn't rate any hike of this length around Moab as 'easy', except during the much cooler months.  With 'carry-outs' a growing problem, especially among the ill-prepared and those with little experience in longer desert hikes, Devil's Garden can catch you out quickly if you're not prepared.  It gets HOT!  Real hot.  A comfortable 80F at the trailhead can quickly feel like 100 plus once you're in the middle of those fins with no breeze and radiant heat from the sand and the rock hitting you from all directions.  So if you're doing the loop, I'd recommend taking that gallon of water (per person) with you.  You'll use most of it.  And carrying out what you don't use is always a much better feeling than being left short."},"Name":"Devils Garden and the Primitive Trail"}
{"_id":{"$oid":"579a681b7c6fb8225aa9c89f"},"Report":{"Rating":"5","Text":"Great hike. We just did and out and back to Double O Arch with short side trips to Navajo, Partition, Tunnel, and Pine Tree Arch on the way back. Great job on the Guide Trip"},"Name":"Devils Garden and the Primitive Trail"}
{"_id":{"$oid":"579a681b7c6fb8225aa9c8a0"},"Report":{"Rating":"5","Text":"This is definitely my favorite hike in the park.  Delicate Arch is also a great little hike, but this one gets you away from the crowds a bit after the first mile or two.\n\r\n1-3 hours (as listed) seems pretty optimistic, especially if you are stopping at all the arches along the way and taking in the sights.  I'd definitely plan on a little more time, probably closer to 4 hours."},"Name":"Devils Garden and the Primitive Trail"}
{"_id":{"$oid":"579a681b7c6fb8225aa9c8a1"},"Report":{"Rating":"5","Text":"My favorite hike in Arches.  This hike has everything, you probably pass around 12-15 different amazing arches by the time you are finished.  The first sections are a lot more crowded than the further sections, but it was all fun to walk around.\n\r\nMake sure to bring lots of water--we ran out with about a mile or so left, and it was HOT.  The final section of the primitive trail was very sandy, and it took us longer than expected because it was hard to keep momentum up."},"Name":"Devils Garden and the Primitive Trail"}
{"_id":{"$oid":"579a681c7c6fb8225aa9c8a2"},"Report":{"Rating":"5","Text":"Great family hike and walking in the cool river was amazing! Just don't carry electronics in your backpack they will get wet! We walked over 2 hours and sometimes in chest deep water, it was awesome! Wear water shoes. Just wish we would of started earlier to do the entire trail from end to end. Hoping to do it again!"},"Name":"The Narrows - Zion National Park"}
{"_id":{"$oid":"579a681c7c6fb8225aa9c8a3"},"Report":{"Rating":"5","Text":"I've done this hike twice, and am going back to do it yet again this summer (2014).\n\r\nThere are a lot of good reviews on it.  \n\r\nI would like to add that if you have the ability to, you should hike all the way past Mystery Canyon and the Narrows into Orderville Canyon.  The walls feel like you could almost touch them from side to side and a lot of the tourists drop out well before this part of the canyon, but it's not so secluded that you won't see anyone.\n\r\nIt's just not the narrows until you've hiked to \"the NARROWS\". \n\r\nAs others have said, this hike is best during a hot summer (correction, almost all summers are hot here) day.  Check the visitor center to get a decent weather report on thunderstorms in the area as an added precaution to flash floods.  In some parts, specifically the beginning, you have to wade through natural swimming pools with waterfalls dropping into it.  Beat that Hollywood Hills celebrities (j/k)!\n\r\nI've done this hike in sandals with no issues.  Don't even think about bring flip flops.  Just don't.  But if you can get a better water shoes like booties, crocs, etc, i'd highly recommend it.  When I first did this canyon as a naive 16 year old, all I brought were an old pair of Payless shoes.  So they were soaked by the end.  The friend I brought along was less than enthusiastic about it, but thanked me for not letting him turn back once we reached the end.\n\r\nLastly...beware of Europeans in Speedos! ha."},"Name":"The Narrows - Zion National Park"}
{"_id":{"$oid":"579a681c7c6fb8225aa9c8a4"},"Report":{"Rating":"5","Text":"This was awesome! I went to Zion as part of a week-long south west road trip after graduation.  It was about 95 degrees on the day we got here, so hiking to Angels landing did not seem like much fun.  Instead we walked through the cool water for 2 hours and had a blast."},"Name":"The Narrows - Zion National Park"}
{"_id":{"$oid":"579a681d7c6fb8225aa9c8a5"},"Report":{"Rating":"4","Text":"It's a nice little hike and it is family friendly. Our 4-year-old daughter walked about 90% of it. The only downside, is that it is not so secret and fairly short, so you have to put up with people that have no hiking etiquette. Oh yes, not only is it wrong about being dog friendly, it is EXIT #285!!!!"},"Name":"Cecret Lake"}
{"_id":{"$oid":"579a681d7c6fb8225aa9c8a6"},"Report":{"Rating":"4","Text":"It's an easy hike with a good reward at the end.  Families can do this hike with no problem.  The site is incorrect.  Cecret Lake is not dog friendly and carries a fine of $300 if you bring your dog."},"Name":"Cecret Lake"}
{"_id":{"$oid":"579a681d7c6fb8225aa9c8a7"},"Report":{"Rating":"2","Text":"Didnt get a chance to hike the trail. According to the police in Alta...Dogs are not allowed so I would take the \"Dog Friendly\" off the trail description. I will return to hike the trail soon."},"Name":"Cecret Lake"}
{"_id":{"$oid":"579a68217c6fb8225aa9c8a8"},"Report":{"Rating":"3","Text":"Two comments -\n\r\nFirst - I have no idea what \"two man-made bushes\" means.  We started following a drainage that had lots of footoprints instead of the trail that was just 40 feet farther down the road.  \n\r\nSecond.  This was not an easy hike.  Once we got on the trail, it was easy to follow.  The difficult part was climbing down a small gully, with one brief exposed section.  We were prepaired for this and it was a non-issue.    Once we got to the rim, things got confusing.  There were many, many cairns, but they lead straight down, never up.  I stoped my group (non-hikers) and went down at least 500 to 800 feet and didn't find the kiva.  Because of the vertical terrain, it was hard to tell if I was on the correct route or not.  I kept feeling I was on the some trail that lead to the bottom rather than a trail that lead to the Kiva.  The route I followed was well marked with cairns every ten feet or so. If I was on the correct route and just didn't go far enough, I would say the route is far from easy, it is difficult and requring good athletic ability.  The climb back up was of course not easy. The non-hikers would find it outright brutal.  \n\r\nIn summary - This is NOT an easy route, to find and follow."},"Name":"False Kiva Hike"}
{"_id":{"$oid":"579a68217c6fb8225aa9c8a9"},"Report":{"Rating":"5","Text":"This app (guide) for False Kiva was extremely helpful  kept me from false trails and wasting energy.  I would rate it more difficult than Easy (snow ice in spots and the final climb to the alcove was challenging)The cairns place in stragetic places were very helpful also"},"Name":"False Kiva Hike"}
{"_id":{"$oid":"579a68217c6fb8225aa9c8aa"},"Report":{"Rating":"5","Text":"I just wanted to say 'thank you' for your work. This link was my main resource when I first visited False Kiva back in Jul '12. I know a lot of people try to keep this spot a secret, but many people find it nonetheless. But in the spirit of keeping it secret, I only share it with those whom I know have the best intentions of visiting the site and not ruining it. Again, thank you!"},"Name":"False Kiva Hike"}
{"_id":{"$oid":"579a68217c6fb8225aa9c8ab"},"Report":{"Rating":"5","Text":"Had a great day on the trail as part of Cruise Moab 2009 event. A lot of fun!"},"Name":"Fins \u0026 Things 4x4 Trail, Moab, UT"}
{"_id":{"$oid":"579a68217c6fb8225aa9c8ac"},"Report":{"Rating":"5","Text":"Had a great day on the trail as part of Cruise Moab 2009 event. A lot of fun!"},"Name":"Fins \u0026 Things 4x4 Trail, Moab, UT"}
{"_id":{"$oid":"579a68237c6fb8225aa9c8ad"},"Report":{"Rating":"5","Text":"This is the easist trail in Zion. I fell Angles landing and observation point trails offer better view but those are significant more difficult."},"Name":"Canyon Overlook Trail"}
{"_id":{"$oid":"579a68237c6fb8225aa9c8ae"},"Report":{"Rating":"5","Text":"I had forgotten how well protected this trail was designed.  It even allows young children the chance to witness dizzying heights more common to the difficult trails in the park."},"Name":"Canyon Overlook Trail"}
{"_id":{"$oid":"579a68247c6fb8225aa9c8af"},"Report":{"Rating":"5","Text":"Hiked this with Grand Hikers hiking club from Sun City Grand in AZ.  Beautiful hike on a beautiful weather day, although a bit cold and breezy at the start and in Echo Canyon.  The view from Observation Point is great, looking down on Angels Landing.  I definitely recommend this in-and-out hike and would do it again."},"Name":"Observation Point"}
{"_id":{"$oid":"579a68247c6fb8225aa9c8b0"},"Report":{"Rating":"5","Text":"I've been to Zion 6 times now and Observation Point twice. The first time was as a side trip from the East Rim Trail and the hike up from there was grueling after 10 miles on the East Rim. I'm not afraid of heights but I was already weak by the time I got to the switch backs and the exposure made me nervous. Still a great hike and well worth the view!\n\r\nThere is a better (in my opinion) way to get to Observation Point; Contact one of the local adventure companies and pay $25 for a one way shuttle to the East Mesa Trail head, from there, it's a short 3.2 mile flat hike out to Observation Point with views of Mystery Canyon and other views along the way. When you're ready to head back, take the normal route down through the switchbacks, past echo canyon and down into the park where you can take a free shuttle back to your car at the visitor center. This is a much less strenuous way to see Observation Point and still see the beauty of the main trail up from the valley."},"Name":"Observation Point"}
{"_id":{"$oid":"579a68247c6fb8225aa9c8b1"},"Report":{"Rating":"5","Text":"This is a very good guide for the summer hike. I did the trail in the winter (early Feb. 2012). The first part of the trail is fully covered in the snow and ice. Additional traction such as Yaktrack is a must. After the slot canyon, then the road is under sunlight. So all the snow melt. The last section (along the rim) is a little muddy because of the melting snow. A fit person can hike up in 1.5 hours and come down in another hour."},"Name":"Observation Point"}
{"_id":{"$oid":"579a68247c6fb8225aa9c8b2"},"Report":{"Rating":"5","Text":"Observation Point is by far my most favorite maintained trail in Zion National Park.  Steep switchbacks, slot canyons, and stunning views!  The first 1/3 of the hike is tucked up against the East side of the Main canyon and can be hiked early in the morning before the Summer Sun makes it's way over the canyon."},"Name":"Observation Point"}
{"_id":{"$oid":"579a68277c6fb8225aa9c8b3"},"Report":{"Rating":"5","Text":"This is a sweet hike. I've done it many times. It's my go to hike if I can't think of any good places to go. I went up with a few friends and we camped on the top of the cave. Lots of fun but make sure you go when it's warm."},"Name":"Garner Cave"}
{"_id":{"$oid":"579a68277c6fb8225aa9c8b4"},"Report":{"Rating":"5","Text":"I was wrong about the poop in the cave, you'll notice a little bit of animal activity but there is nothing in there other than crickets. The cave is awesome and the hike up there offers you some amazing views. I was going to get an exact GPS coordinates but I forgot to charge it. So I'll include that next time we go up to get into the mud rooms that are suppose to be in there. Awesome time up there though, and the directions on this guide are pretty simple."},"Name":"Garner Cave"}
{"_id":{"$oid":"579a68287c6fb8225aa9c8b5"},"Report":{"Rating":"5","Text":"Loved the hike!  Could have entered where I parked and taken a short trail under the road, looked like many have done that.  Saw just a few people, great rocks to hike on somewhat steep at times but only for a short time.  Saw a herd of Big Horn sheep that walked right past us."},"Name":"Many Pools - Zion National Park"}
{"_id":{"$oid":"579a68287c6fb8225aa9c8b6"},"Report":{"Rating":"5","Text":"As a family hike goes, this was pretty great. We were fortunate to have perfect weather and the entire hike was completely ours. Still, for our four kids family (6 to 17), the hike gave everyone great views, some minor scrambling and much to do as we hiked past the many small, but interesting pools."},"Name":"Many Pools - Zion National Park"}
{"_id":{"$oid":"579a68287c6fb8225aa9c8b7"},"Report":{"Rating":"4","Text":"Many Pools was my first hike (off the beaten trail) in 2011.  Beautiful spring day.  I just wish it would have lasted longer!"},"Name":"Many Pools - Zion National Park"}
{"_id":{"$oid":"579a682a7c6fb8225aa9c8b8"},"Report":{"Rating":"5","Text":"Great easy hike for the entire family!"},"Name":"Mossy Cave, Bryce Canyon"}
{"_id":{"$oid":"579a682a7c6fb8225aa9c8b9"},"Report":{"Rating":"5","Text":"Thanks.  Have you seen my podcasts about Bryce?  Beautifulplaces.tv"},"Name":"Mossy Cave, Bryce Canyon"}
{"_id":{"$oid":"579a682c7c6fb8225aa9c8ba"},"Report":{"Rating":"5","Text":"I'm just back from Zion, where I did the Narrows top-down. The campsites have been moved. For instance, site #1 is now past the waterfall, down by Deep Creek. Do yourself a favor and get an updated map from the rangers at the visitors center.\n\r\nCheers,\r\nSteen"},"Name":"The Narrows (Top-Down) - Zion National Park"}
{"_id":{"$oid":"579a682d7c6fb8225aa9c8bb"},"Report":{"Rating":"5","Text":"Top ten favor for run, bike."},"Name":"Sardine Peak - Ogden Outlook"}
{"_id":{"$oid":"579a682f7c6fb8225aa9c8bc"},"Report":{"Rating":"5","Text":"I climbed Lady Mountain in about 1968, back when it was a maintained trail that appeared on the map you got when you entered the Park for the $2.00 park day use fee. (I still have that map)  I climbed it alone, in the middle of the day, in the summer, with no water, and no rope/harness/gear.  In those days, all the steep places where you would rig a rope today had fixed chains anchored, the yellow arrows were brightly visible, and there was an anchored aluminum ladder at one point, and an aluminum bridge at another point.  I had scouted the trail just enough to see the chains, so I returned to camp for a pair of gloves, since the chains were hot and my hands tender.  I did take a walkie-talkie with me,\r\nand I talked with my folks about every 10-15 minutes.  The view from the top was amazing.  There was an Olympic-sized swimming pool just across the street to the west of the Lodge, and it looked as if you could dive off the edge of Lady Mountain and land in the pool.  After I climbed back down, I was really hot and dry, and got a pineapple shake at the soda fountain just north of the gift shop.  Of course I should have taken a couple of quarts of water, but I was an impetuous teenager, with more gumption than sense."},"Name":"Lady Mountain - Zion National Park"}
{"_id":{"$oid":"579a682f7c6fb8225aa9c8bd"},"Report":{"Rating":"5","Text":"Lady Mountain might just be the perfect scramble route."},"Name":"Lady Mountain - Zion National Park"}
{"_id":{"$oid":"579a682f7c6fb8225aa9c8be"},"Report":{"Rating":"5","Text":"Lady Mountain was my first summit hike off the beaten path in Zion National Park.  I was hooked the moment I stepped off the \"freeway trail\" of Emerald Pools into the solitude of a summit ascent."},"Name":"Lady Mountain - Zion National Park"}
{"_id":{"$oid":"579a68327c6fb8225aa9c8bf"},"Report":{"Rating":"5","Text":"Very demanding physically, but rewarded by spectacular views."},"Name":"Snowbasin - Needles Trail"}
{"_id":{"$oid":"579a68337c6fb8225aa9c8c0"},"Report":{"Rating":"5","Text":"Red Butte is everything a technical hike should be; unbelievable views, following the route is challenging, not to much rope work, but just enough to keep the route to yourself!"},"Name":"Red Butte - Kolob Terrace"}
{"_id":{"$oid":"579a68387c6fb8225aa9c8c1"},"Report":{"Rating":"5","Text":"its really superbbbbb"},"Name":"Box Canyon"}
{"_id":{"$oid":"579a68387c6fb8225aa9c8c2"},"Report":{"Rating":"5","Text":"AWESOME PLACE... MUST VISIT EVERYONE ONCE IN LIFE"},"Name":"Box Canyon"}
{"_id":{"$oid":"579a68387c6fb8225aa9c8c3"},"Report":{"Rating":"5","Text":"beautiful place.... just heaven ...nice people"},"Name":"Box Canyon"}
{"_id":{"$oid":"579a68397c6fb8225aa9c8c4"},"Report":{"Rating":"5","Text":"I'm not sure what I enjoyed the most; hiking up the massive 900 foot slickrock slab, eating a leisurely lunch on top of a Hoodoo overlooking Parunuweap Canyon, or watching the endless stream of cars crawl along Hwy-9 just before dropping into the canyon above Cockeye Falls.  What a great backcountry route."},"Name":"Cockeye Falls - Zion National Park"}
{"_id":{"$oid":"579a68397c6fb8225aa9c8c5"},"Report":{"Rating":"4","Text":"I'm not sure which held my attention the most.  The hundreds of different colors from the amphitheater or the several thousand year old Bristlecone Pine trees.\n\r\nPS. I'm not sure why Everytrail is now having us rate and review our own guides.  It seems a little self serving to me.  My apologies."},"Name":"Spectra Point Trail - Cedar Breaks National Monument"}
{"_id":{"$oid":"579a683a7c6fb8225aa9c8c6"},"Report":{"Rating":"5","Text":"I had a chance to hike this summit again with a good friend and his son (age 11 + friend also age 11).  What a fun hike. We added our names to the registry (added paper also) and on the way down my friend told me how cool it was to sign the registry (his first time) on the peak of something spectacular!  I couldn't agree more."},"Name":"Progeny Peak - Zion National Park"}
{"_id":{"$oid":"579a683a7c6fb8225aa9c8c7"},"Report":{"Rating":"5","Text":"I love this summit hike!  Short rewarding peak, and the beautiful Two Pines Arch along the way."},"Name":"Progeny Peak - Zion National Park"}
{"_id":{"$oid":"579a683c7c6fb8225aa9c8c8"},"Report":{"Rating":"5","Text":"This is a very steep slickrock scramble that has amazing views of Zion. It turns a wonderful hike into a fantastic backcountry adventure."},"Name":"East Temple Saddle - Zion National Park"}
{"_id":{"$oid":"579a683d7c6fb8225aa9c8c9"},"Report":{"Rating":"5","Text":"Usually on a backcountry route I'll see the occasional footprint or two.  Not on The Bartizan!  Nothing but animal tracks! Standing at the western edge of Cedar Breaks National Monument the view of the amphitheater is unmatched as is the view into Ashdown Gorge Wilderness area."},"Name":"Bartizan Arch - Cedar Breaks National Monument"}
{"_id":{"$oid":"579a683d7c6fb8225aa9c8ca"},"Report":{"Rating":"5","Text":"This guide presents the non-technical route for The Subway.  I would recommend that you review the technical portion and complete the canyon top to bottom if your skills permit.  There are several good trip descriptions of the entire Subway route available under community trips."},"Name":"The Subway - Zion National Park"}
{"_id":{"$oid":"579a68747c6fb8225aa9c8cb"},"Report":{"Rating":"4","Text":"We've done the northern loop twice, only seeing 3 of the 10 falls. We're hoping to get back down soon for the full loop. The part we saw was lovely, easy to hike with little ones (our 2 \u0026 1/2 year old walked the whole 3+ miles of that loop), and they particularly loved the Last-of-the-Mohicans feel of walking in the cavern behind the North Falls.\n\r\nIt definitely felt like an adventure to our kids (ranging in age from infant to 13 at the time of the hike), and was a great, doable family getaway."},"Name":"Ten Falls Canyon Trail"}
{"_id":{"$oid":"579a68747c6fb8225aa9c8cc"},"Report":{"Rating":"5","Text":"Great place to visit with your friends"},"Name":"Ten Falls Canyon Trail"}
{"_id":{"$oid":"579a68747c6fb8225aa9c8cd"},"Report":{"Rating":"5","Text":"Amazing location, so many awesome waterfalls.  Nice job on the guide write up, very well done."},"Name":"Ten Falls Canyon Trail"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8ce"},"Report":{"Rating":"4","Text":"Great first summit for me! Very Challenging.  Im in my 40s.  I live at sea level.  My hiking partner was very experienced.\n\r\nStarted the hike at 0630am. Hit summit at Noon. Back to trailhead at 345pm.  Spent about 30 minutes on the summit. Took a lengthy snack break on the way back.  Took a lot of rest breaks on the way up.\n\r\nThe conditions of the forest trail, meadows area is accurate.  The conditions of the climbing portion were extremely dry.  The only snow we crossed was at the top.  Temperatures were 40s when we started and pretty much stayed the same as we climbed up.  The wind remained light and was not a factor, however, we noticed it picking up on the descent.  We kept getting questioned about how windy was it at the top.  Usually, from poorly dressed hikers.  Let me stress that shorts and tee shirts are probably not the smartest things to climb in.  One, its very dry and the volcanic rock is powdery and loose making it a dirty task. Two, with the sun out you have to worry about exposure at altitude.  We saw some people who were going to feel the pain once the realized how sunburn they got.  Three, the conditions on any mountain can change rapidly...usually for the worse.  On a side note we saw a group of younger guys that were way overdressed for the occasion and carrying too much gear starting out.  We passed them in the first mile through the forest as they were stripping down because they were overheating.  Even though, I (not my partner) was going slow we didn't see those guys again until we were scrambling down the mountain.   \n\r\nThe current drought and heat wave in the area means you also need to plan to take more water or a filter to replenish water along the way.  The glacial pool before you start up to the false summit provides an excellent refresh point if you have filter.  I recommend 3 quarts of water at a minimum if you are a novice like I am.  I burned out of my 2 quarts at the summit and had to refresh at the glacial pool going down.\n\r\nThe trail length is stated at 12 miles round trip.  However, that is probably calculated by as the crow flies.  We used an iPhone App with pace counter/gps that usually runs pretty true.. and if anything shortchanges on the distance we hike.  We had almost 17 miles round trip.  Trust me, We did not deviate from the trail.  There was enough people on the trail and it was clearly marked.  The maze of switchbacks near the summit could be a factor as well as their were several alternate former connecting trails that were closed for reclamation.  We also heard from several local hikers the trail was much farther than marked."},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8cf"},"Report":{"Rating":"5","Text":"i visited this place last december.. will definitely visit again"},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8d0"},"Report":{"Rating":"5","Text":"My wife and I decided to hike the sister for our 9 year anniversary. This was our first time trying a hike of any level. We read this description and the reviews and thought it would be fun. About half way up the woods we knew it was going to be VERY hard for us. My wife did not want to continue to the top but I encouraged her to keep going a little further. It helped when we heard quite a few other couples saying that they did not want to continue either. We ended up making it all the way to right before the saddle at Lewis glacier. We are very proud of ourselves. The views are amazing and next year after training and getting more in shape we will try again with more confidence and knowledge. The last mile was really the hardest part for us. We are still very sore the night after. Great trip."},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8d1"},"Report":{"Rating":"5","Text":"This was my first time on the mountain and it was difficult. The payoff was worth it though! Keep in mind that the altitude affects everyone in some way. Listen to your body and slow down if need be.  Take plenty of breaks, pack the protein (you'll need energy! ) and a good amount of water. If it's your first time hiking a 10000 plus foot mountain, you'll enjoy having the bragging rights!"},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8d2"},"Report":{"Rating":"5","Text":"This is a great hike.  I love these non-technical scrambles, have also done Mt St Helens (WA) and Mt McGloughlin in Southern Oregon.\n\r\nThis trip summary was really well done, and gives a good description of the hike.\n\r\nWe hiked in on a Monday, camped that night at Morraine Lake, then hiked to the summit, and returned to our campsite for the evening.  It was a really nice way to do it, made it a little more of an adventure.\n\r\nWe traveled with a 13 year old, and it took us close to 12 hours.  We saw a lot of folks who made it up and back anywhere from 6 to 8 hours (from Morraine Lake).\n\r\nIt was quite cold at the summit.  Take a warm coat, even if you don't think you will need one!"},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68757c6fb8225aa9c8d3"},"Report":{"Rating":"5","Text":"A challenging climb but with a great payoff at the summit. It's true that if you can't handle the first 2.5 miles of the hike, the last mile to the summit will tear you apart. Many people turned around the day we went up because of scree and improper shoes. \n\r\nThe trail is easy enough to keep to until half way up the mountain where there was still 20% snow on the trail. We brought snow shoes, but they were not necessary. Plenty of backpacking spots; rock wind barriers and flat ground. \n\r\nI recommend hiking this trail on a full moon and getting to the summit at sunrise. Bring flashlights and be safe!"},"Name":"South Sister Summit"}
{"_id":{"$oid":"579a68767c6fb8225aa9c8d4"},"Report":{"Rating":"5","Text":"8. Sınıf Fen ve Teknoloji Dikey Yayıncılık Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/8-sinif-fen-ve-teknoloji-dikey-yayinlari-calisma-kitabi-cevaplari-2014-2015.html"},"Name":"Mt. Hood Via South Side Timberline Approach"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8d5"},"Report":{"Rating":"5","Text":"5.Sınıf Sosyal Bilgiler Harf Eğitim Yayınları Çalışma Kitabı Cevapları\r\n5. Sınıf Sosyal Bilgiler Harf Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınıf Sosyal Bilgiler Harf Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/5snf-sosyal-bilgiler-harf-egitim_2.html"},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8d6"},"Report":{"Rating":"4","Text":"Ciekawy krajobraz, naprawdę warto się tam wybrać! :)"},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8d7"},"Report":{"Rating":"5","Text":"This was a beautiful hike. It was not a hard hike, but very wonderful. You walk through lushes forest, over creeks and next to the ever flowing river. You leave the gravel parking lot into beautiful green trees. Once your a little heated from the hike, you end up right back next to the river for the perfect time to chill off. Along the trail you end up getting right on top of the river. You come up 30+ feet over these cliff edges overlooking the river you  recently just effortlessly dipped your head in.  It weaves in and out, around and on logs all the way the magnificent Blue Pool.\r\n Here is a video of my adventure \u003e\r\nhttp://www.youtube.com/watch?v=DbtpcpyxIW4\u0026feature;=youtu.be"},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8d8"},"Report":{"Rating":"5","Text":"Beauty everywhere. Do not hike on a Saturday afternoon. There were too many Mt. Bikes coming down the trail at me and too many people. Also too hot going over the lava beds. To get to the pool You have to do some hard rock climbing to get up and then down to it - I did not.\r\nI want to go back and do a weekday morning hike with more time. Took me 1.5 hours to go up and then 1 hour to get back down."},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8d9"},"Report":{"Rating":"5","Text":"WOW, AMAZINGLY BEAUTIFUL. this place is just beautiful, we took the hike and im not going to say its easy but its not hard at all.  I'm a bigger girl and i made it just fine, i acutally seen old old people that looked like they were on their last breathe take the hike.  It's a long hike though, the thing that sucks about the hike is that theirs rocks and tree roots sticking out of the ground.  I almost fell a few times.  But once you get there it will all be worth it, not sure how people jump off of it, we tried to look where we could get back to feel the water and no luck.  we felt the water a little ways down and OMG it was freezing so i can only imagine how cold the blue pool is.  Enjoy the hike its so beautiful."},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68777c6fb8225aa9c8da"},"Report":{"Rating":"5","Text":"Great short hike with a gorgeous destination. This is a small section of the larger McKenzie River Trail, which is known nationwide as one of the best mountain biking trails in the country. Watch out for bikers approaching fast while going downhill.\n\r\nIf you are backpacking the McKenzie River trail, there are a few suitable campsites just north of Tamolitch pool off the trail."},"Name":"McKenzie River Trail: Hike to Tamolitch/Blue Pool"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8db"},"Report":{"Rating":"4","Text":"Check your directions against this website. If a road is closed and you're not prepared for it, it would be pretty difficult to get to. Use this link for directions:\r\nhttp://www.fs.usda.gov/recarea/siuslaw/recreation/recarea/?recid=42457\n\r\nI used Google Maps and it took me down some road labeled as private. I continued anyway. The road was not kind to my poor old car. I'm glad I made it out. Luckily I got to the trail head and had some 3G connectivity on my phone to find the proper way back. There was an abandoned old car on this road. I suggest using the above link for directions and not adding another car to this road's collection!\n\r\nThe hike was nice. Very easy getting to the lower falls. Somewhat more difficult to hike back to the trail head, but I'd rate the entire hike as easy to moderate. Good shade on a hot day. Good forest smells. Tall trees everywhere. Great bird sounds and the hike follows the river, so nice ambient noises. Oh, and lots of bugs!\n\r\nThis guide shows a \"junction\" (#3 \u0026 #4) and stops and then doubles back to the north-something trail. The lower falls is just past the junction (so, not actually on the guide). Very beautiful! It has a great deck space to view both lower falls and eat. I then doubled back and went on to the swimming hole (from the guide) which was nice, but not warm enough for me to want to swim. \n\r\nVery beautiful hike!"},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8dc"},"Report":{"Rating":"5","Text":"awesome place...Great experience"},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8dd"},"Report":{"Rating":"5","Text":"5.Sınıf Fen ve Teknoloji Sevgi Yayınları Çalışma Kitabı Cevapları\r\n5. Sınıf Fen ve Teknoloji Sevgi Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınf Fen ve Teknoloji Sevgi Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/5snf-fen-ve-teknoloji-sevgi-yaynlar_2.html"},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8de"},"Report":{"Rating":"4","Text":"Ultimate place for hangout"},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8df"},"Report":{"Rating":"4","Text":"When we got there it had signs that there are some trail closures.  BUT we did hike past the lower falls for quite awhile and finally came across a tree over the trail.  It was cross-able (with some risk) but we decided it was time to turn back anyway.  There may have been more trail blockage beyond that.  We ended up with 8 miles out and back.  So 4 miles to the tree over the trail (including the off trail to lower falls).  For some reason even though you know you are climbing down...the climb back seemed especially brutal!  Curious of the elevation gain.  BUT it was also end of hike and getting hot.  \n\r\nGREAT swimming holes!  AND very few people! The trip TO...also a bit brutal....17 miles of back roads - half of which are gravel (or at least feels).  The drive for the 17 miles is about 45 min. to an hour in itself.\n\r\nBEAUTIFUL FALLS!  No matter where you are coming from...plan a whole day!  Unless you are just going to the falls and back.  But even then plan a good part of your day."},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68787c6fb8225aa9c8e0"},"Report":{"Rating":"5","Text":"Great hike and the waterfalls are impressive, especially early in the year when the water is raging. The hike back uphill to your car is definitely a drag, though!"},"Name":"Kentucky Falls"}
{"_id":{"$oid":"579a68797c6fb8225aa9c8e1"},"Report":{"Rating":"5","Text":"5. SINIF MATEMATİK DERSİ YILDIRIM YAYINLARI ÖĞRENCİ ÇALIŞMA KİTABI CEVAPLARI\r\n5. Sınıf Matematik Yıldırım Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınıf Matematik Yıldırım Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2013/08/5-sinif-matematik-dersi-yildirim-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Mary's Peak"}
{"_id":{"$oid":"579a687a7c6fb8225aa9c8e2"},"Report":{"Rating":"5","Text":"5.Sınıf Türkçe FCM Yayınları Çalışma Kitabı Cevapları\r\n5. Sınıf Türkçe FCM Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınıf Türkçe FCM Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/5snf-turkce-fcm-yaynlar-calsma-kitab.html"},"Name":"Sweet Creek Falls Trail"}
{"_id":{"$oid":"579a687a7c6fb8225aa9c8e3"},"Report":{"Rating":"5","Text":"Arapça 6 Meb Yayınları Çalışma Kitabı Cevapları\r\nArapça 6 Meb Yayınları Çalışma Kitabı Cevapları \n\r\nArapça 6 Meb Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.derskalemi.com/2015/02/arapca-6-meb-yayinlari-calisma-kitabi-cevaplarii.html"},"Name":"Sweet Creek Falls Trail"}
{"_id":{"$oid":"579a687a7c6fb8225aa9c8e4"},"Report":{"Rating":"5","Text":"I love this trail! Very beautiful and very wet. It can be rather cold and wet during the early Spring. The trail has amazing wooden walkways that are impressive by themselves."},"Name":"Sweet Creek Falls Trail"}
{"_id":{"$oid":"579a687b7c6fb8225aa9c8e5"},"Report":{"Rating":"5","Text":"6.Sınıf Müzik Çalışma Kitabı Cevapları Meb Yayınları\r\n6. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları\n\n\r\n6. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nÖncelikle siz kendiniz yapmayı deneyin. Buradaki amacımız size yapamadığınız sorularda, ya da aklınıza takılan, yerlerde yardımcı olmaktır. 6. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevaplarını lütfen buradan kontrol ediniz, buradan bakıp aynısını yazmak öğrenmeniz açısından faydalı olmayacaktır.\n\r\nhttp://www.sinifevraklari.com/2014/07/6snf-muzik-calsma-kitab-cevaplar-meb.html"},"Name":"Mt Defiance Summit"}
{"_id":{"$oid":"579a687b7c6fb8225aa9c8e6"},"Report":{"Rating":"4","Text":"Bring your bug spray! I usually only worry about mosquitos when I'm going to be hanging around water, but dang. Not a drop in site and they were all over!"},"Name":"Mt Defiance Summit"}
{"_id":{"$oid":"579a687b7c6fb8225aa9c8e7"},"Report":{"Rating":"4","Text":"It's a really nice hike. The directions are a little off...you actually drive further than a half-mile to the turn, so keep driving until you come to a T in the road, which is South Drift Creek Road, and then turn right and look for the sign to the trailhead."},"Name":"Drift Creek Falls"}
{"_id":{"$oid":"579a687b7c6fb8225aa9c8e8"},"Report":{"Rating":"4","Text":"6. SINIF FEN VE TEKNOLOJİ Fenbil Yayınları ÇALIŞMA KİTABI CEVAPLARI\n\r\n6.Sınıf Fen ve Teknoloji Fenbil Yayınları Çalışma Kitabı Cevapları Sayfa, 6.Sınıf Fen ve Teknoloji Fenbil Yayınları Çalışma Kitabı Sayfa Cevap Anahtarı, 6.Sınıf Fen ve Teknoloji Fenbil Çalışma Kitabı sayfa, 6.Sınıf Fen ve Teknoloji Fenbil Yayınları Çalışma Kitabı Cevap Anahtarı bul, 6.Sınıf Fenbil Fen ve Teknoloji Çalışma Kitabı Cevapları, Fenbil Yayınları 6.Sınıf Fen ve Teknoloji Çalışma Kitabı Cevap Anahtarı çöz, 6.Sınıf Fen ve Teknoloji Fenbil Yayınları Çalışma Kitabı Cevap Anahtarı ödev, Fenbil \n\r\nhttp://www.sinifevraklari.com/2014/09/6-sinif-fen-ve-teknoloji-fenbil-yaynlar.html"},"Name":"Drift Creek Falls"}
{"_id":{"$oid":"579a687c7c6fb8225aa9c8e9"},"Report":{"Rating":"4","Text":"6. Sinif ingilizce Evrensel iletişim Yayinlari Çalişma Kitabi Cevaplari 2014-2015\r\n6. Sinif ingilizce Evrensel iletişim Yayinlari Çalişma Kitabi Cevaplari 2014-2015\n\r\n6.Sınıf İngilizce Evrensel iletişim Yayınları Çalışma Kitabı Cevapları Sayfa, 6.Sınıf İngilizce Evrensel iletişim Yayınları Çalışma Kitabı Sayfa Cevap Anahtarı, 6. Sınıf İngilizce Evrensel iletişim Çalışma Kitabı sayfa, 6.Sınıf İngilizce Evrensel iletişim Yayınları Çalışma Kitabı Cevap Anahtarı bul, 6.Sınıf Evrensel iletişim İngilizce Çalışma Kitabı Cevapları, Evrensel iletişim Yayınları 6.Sınıf İngilizce Kitabı Cevap Anahtarı çöz, 6 .Sınıf İngilizce Evrensel iletişim Yayınları Çalışma Kitabı Cevap Anahtarı ödev, Evrensel iletişim \n\r\nhttp://www.sinifevraklari.com/2014/09/6-sinif-ingilizce-evrensel-iletisim-yayinlari-calisma-kitabi-cevaplari-2014-2015.html"},"Name":"Iron Mountain"}
{"_id":{"$oid":"579a687d7c6fb8225aa9c8ea"},"Report":{"Rating":"4","Text":"6. Sinif Sosyal Bilgiler Evren Yayincilik Çalişma Kitabi Cevaplari\r\n6. Sinif Sosyal Bilgiler Evren Yayincilik Çalişma Kitabi Cevaplari\n\r\n6. Sinif Sosyal Bilgiler Evren Yayınları Çalışma Kitabı Cevapları Evren Yayıncılık yayınlanmıştır. 6. Sınıf Sosyal Bilgiler Evren Yayınları Çalışma kitabı cevapları sitemize eklenmiştir.\n\r\nhttp://www.sinifevraklari.com/2014/09/6-sinif-sosyal-bilgiler-evren-yayincilik-calisma-kitabi-cevaplari.html"},"Name":"Diamond Peak Standard Summit Route"}
{"_id":{"$oid":"579a687d7c6fb8225aa9c8eb"},"Report":{"Rating":"4","Text":"6. Sınıf Matematik Sevgi Yayınevi Çalışma Kitabı Cevapları\n\r\n6. Sınıf Matematik Çalışma Kitabı Cevapları Sevgi Yayınevi, Matematik 6.Sınıf Sevgi Yayınevi Çalışma Kitabı ve cevapları. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Bu sayfamızda Sevgi Yayınevi 6. Sınıf Matematik Çalışma Kitabı ve cevapları 2013 2014 çözümlerine göz atabilirsiniz. 6. Sınıf Sevgi Yayınevi Matematik Çalışma Kitabı\n\r\nhttp://www.sinifevraklari.com/2014/09/6snf-matematik-sevgi-yaynevi-calsma.html"},"Name":"Fall Creek Falls Trail"}
{"_id":{"$oid":"579a687e7c6fb8225aa9c8ec"},"Report":{"Rating":"3","Text":"6. SINIF TÜRKÇE GİZEM YAYINLARI ÖĞRENCİ ÇALIŞMA KİTABI CEVAPLARI\n\r\n6. Sınıf Türkçe Çalışma Kitabı Cevapları Gizem Yayincilik, Türkçe 6. Sınıf Gizem Yayincilik Çalışma Kitabı ve cevapları. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Bu sayfamızda Gizem Yayincilik 6. Sınıf Türkçe Çalışma Kitabı ve cevapları 2014 2015 çözümlerine göz atabilirsiniz. 6.Sınıf Gizem Yayincilik Türkçe Çalışma Kitabı \n\r\nhttp://www.sinifevraklari.com/2013/08/6-sinif-turkce-gizem-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Fern Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8ed"},"Report":{"Rating":"4","Text":"7. Sinif Matematik Ada Yayinlari Çalışma Kitabi Cevaplari 2014-2015\n\r\n7. Sinif Matematik Ada Yayinlari Çalışma Kitabi Cevaplari sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/7-sinif-matematik-ada-yayinlari-calisma-kitabi-cevaplari-2014-2015.html"},"Name":"Susan Creek Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8ee"},"Report":{"Rating":"4","Text":"7. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları\n\r\n7. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2013/11/7-sinif-muzik-calisma-kitabi-cevaplari.html"},"Name":"Drift Creek Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8ef"},"Report":{"Rating":"4","Text":"This is a pretty busy trail, but the suspension bridge and falls are worth it!"},"Name":"Drift Creek Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8f0"},"Report":{"Rating":"5","Text":"Great easy hike for the family. The waterfall was beautiful and a sight not to be missed. We took our 3 and 5 year old along and they made it with no problem."},"Name":"Drift Creek Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8f1"},"Report":{"Rating":"5","Text":"we have great time hike. It is light rain and mud to easy slick."},"Name":"Drift Creek Falls Trail"}
{"_id":{"$oid":"579a687f7c6fb8225aa9c8f2"},"Report":{"Rating":"5","Text":"Was a nice sunny day when I visited.  The bridge and waterfall are amazing.  Do not miss."},"Name":"Drift Creek Falls Trail"}
{"_id":{"$oid":"579a68817c6fb8225aa9c8f3"},"Report":{"Rating":"3","Text":"7.Sınıf İngilizce Lider Yayınları Çalışma Kitabı Cevapları\n\r\n7.Sınıf İngilizce Lider Yayınları Çalışma Kitabı Cevapları Sayfa, 7.Sınıf İngilizce Lider Yayınları Çalışma Kitabı Sayfa Cevap Anahtarı, 7.Sınıf İngilizce Lider Çalışma Kitabı sayfa, 7.Sınıf İngilizce Dersi Lider Yayınları Çalışma Kitabı Cevap Anahtarı bul, 7.Sınıf Lider İngilizce Çalışma Kitabı Cevapları, Lider Yayınları 7.Sınıf İngilizce Kitabı Cevap Anahtarı çöz, 7.Sınıf İngilizce Lider Yayınları Çalışma Kitabı Cevap Anahtarı ödev, Lider\n\r\nhttp://www.sinifevraklari.com/2014/09/7snf-ingilizce-lider-yaynlar-calsma.html"},"Name":"Pittock Mansion From Lower MacLeay Park"}
{"_id":{"$oid":"579a68817c6fb8225aa9c8f4"},"Report":{"Rating":"4","Text":"was not aware that there were so many trails in forest park it helped to know that once you cross the road it is the Wild \r\nWood trail to the top.  Wonderful walk"},"Name":"Pittock Mansion From Lower MacLeay Park"}
{"_id":{"$oid":"579a68827c6fb8225aa9c8f5"},"Report":{"Rating":"5","Text":"nice trails.... wonderful experience"},"Name":"Mount Pisgah"}
{"_id":{"$oid":"579a68827c6fb8225aa9c8f6"},"Report":{"Rating":"4","Text":"i loved the trails and beautiful site scenes"},"Name":"Mount Pisgah"}
{"_id":{"$oid":"579a68827c6fb8225aa9c8f7"},"Report":{"Rating":"5","Text":"8. Sınıf Türkçe Yıldırım Yayınları Çalışma Kitabı Cevapları\r\n8. Sınıf Türkçe Yıldırım Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2013/08/8-sinif-turkce-dersi-yildirim-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Mount Pisgah"}
{"_id":{"$oid":"579a68837c6fb8225aa9c8f8"},"Report":{"Rating":"5","Text":"This hike was amazing! We started at the Triple Falls trailhead and made our way to horsetail falls. It is not an \"easy\" hike. There is a lot of steep inclines, loose rocks, a few large trees down that you have to go under or over.. I would say its more intermediate/hard. However, well worth it!"},"Name":"Ponytail Falls and Triple Falls Loop Hike"}
{"_id":{"$oid":"579a68847c6fb8225aa9c8f9"},"Report":{"Rating":"5","Text":"had so much fun there....just amazing"},"Name":"Peavy Arboretum"}
{"_id":{"$oid":"579a68847c6fb8225aa9c8fa"},"Report":{"Rating":"5","Text":"8. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları\n\r\n8. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\n\r\nhttp://www.sinifevraklari.com/2014/05/8snf-muzik-meb-yaynlar-calsma-kitab.html"},"Name":"Peavy Arboretum"}
{"_id":{"$oid":"579a68847c6fb8225aa9c8fb"},"Report":{"Rating":"4","Text":"This trail was beautiful and very well maintained. We did cross paths with about 8 people over the 4 hours we spent on the trails exploring. The area is amazingly beautiful and quite cool on hot days."},"Name":"Peavy Arboretum"}
{"_id":{"$oid":"579a68857c6fb8225aa9c8fc"},"Report":{"Rating":"5","Text":"This trail was great and the falls were gorgeous. However, as a heads up, on the trail toward Green Peak Falls we saw some bear prints in the mud. Keep an eye out!"},"Name":"Alsea Falls and Green Peak Falls"}
{"_id":{"$oid":"579a68857c6fb8225aa9c8fd"},"Report":{"Rating":"5","Text":"7. Sınıf Türkçe Evren Yayınları Çalışma Kitabı Cevapları\n\r\n7. Sınıf Türkçe Evren Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler\n\r\nhttp://www.sinifevraklari.com/2013/08/7-sinif-turkce-dersi-evren-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Alsea Falls and Green Peak Falls"}
{"_id":{"$oid":"579a68857c6fb8225aa9c8fe"},"Report":{"Rating":"4","Text":"The falls were beautiful! It was fun also that Alsea Falls is right at the beginning of the trip and then you get to trek out to Green Peak Falls so its two for one hike which I love! \n\r\nWe went on the look for the tree house which was a little tricky to find but we did find it. It wasn't much to see in our opinion but it was still fun trying to find it up in the tree tops. It is way up there but the pic on here actually helped us to find it. \n\r\nGreen Peak Falls were amazing and the hike itself was so beautiful through the moss covered trees, loads of clover lining the trail and the gorgeous cool water! I would totally do this hike again!"},"Name":"Alsea Falls and Green Peak Falls"}
{"_id":{"$oid":"579a68887c6fb8225aa9c8ff"},"Report":{"Rating":"5","Text":"8. Sınıf İngilizce Atlantik Yayınları Çalışma Kitabı Cevapları\n\r\n8. Sınıf İngilizce Atlantik Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/8-sinif-ingilizce-atlantik-yayinlari-calisma-kitabi-cevaplari.html"},"Name":"Triangulation Peak and Boca Cave"}
{"_id":{"$oid":"579a68897c6fb8225aa9c900"},"Report":{"Rating":"5","Text":"I hiked the eastern portion of this trail while hiking down to Tamolitch pool, making this part of a 2 day backpacking trip. We camped near Tamolitch pool and the Clear Lake trail was at the very beginning and end of our hike, which was great! The paved path through the volcanic flows is wild to look at."},"Name":"Clear Lake Trail"}
{"_id":{"$oid":"579a68897c6fb8225aa9c901"},"Report":{"Rating":"5","Text":"Great hike, nice way to get above the perma-fog in the valley.  Like said before, once it gets really steep you're almost there.  Keep going, the views are some of the best in Oregon.  Panorama of the Cascades from Mt. Hood to Mt. Ashland.  One note: the road off Lost Creek is Eagles Rest not Eagles Crest.  Other than that the directions on here are great and lead you right to the trailhead."},"Name":"Mount June Summit Trail"}
{"_id":{"$oid":"579a68897c6fb8225aa9c902"},"Report":{"Rating":"5","Text":"I love this trail! I usually combine it with a hike along Sawtooth Ridge to Hardesty Mountain to the Northwest.\n\r\nWhile backpacking in this trail system, I've noticed that there is a lot of air traffic overhead."},"Name":"Mount June Summit Trail"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c903"},"Report":{"Rating":"3","Text":"AWESOME PLACE... MUST VISIT EVERYONE ONCE IN LIFE\""},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c904"},"Report":{"Rating":"4","Text":"A bit steep - good workout. Watch out for poison oak!\r\nWe hiked up during those wildfires, so all the views were nonexistent due to the smoke. Beautiful trail, though. Will have to go back for the view."},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c905"},"Report":{"Rating":"5","Text":"BEST PLACE ON EARTH....."},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c906"},"Report":{"Rating":"5","Text":"amazing place.... so beautiful"},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c907"},"Report":{"Rating":"3","Text":"7. Sınıf Sosyal Bilgiler Evren Yayınları Çalışma Kitabı Cevapları \n\r\n7. Sınıf Sosyal Bilgiler Evren Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2013/08/7-sinif-sosyal-bilgiler-dersi-evren-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688b7c6fb8225aa9c908"},"Report":{"Rating":"4","Text":"Nice hike.  A bit wet in the beginning but a fun hike."},"Name":"Spencer Butte"}
{"_id":{"$oid":"579a688c7c6fb8225aa9c909"},"Report":{"Rating":"5","Text":"Awesome hike. Not difficult or technical, but very beautiful, especially with all the snow."},"Name":"Tamanawas Falls Loop"}
{"_id":{"$oid":"579a688d7c6fb8225aa9c90a"},"Report":{"Rating":"4","Text":"5. Sınıf Arapça Çalışma Kitabı Cevapları – Meb Yayınları\r\n5. Sınıf Arapça Meb Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınıf Arapça Meb Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/06/5-snf-arapca-calsma-kitab-cevaplar-meb.html"},"Name":"Mt. Tabor City Park"}
{"_id":{"$oid":"579a688e7c6fb8225aa9c90b"},"Report":{"Rating":"4","Text":"5.Sınıf Müzik Çalışma Kitabı Cevapları Meb Yayınları\r\n5. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları\n\r\n5. Sınıf Müzik Meb Yayınları Çalışma Kitabı Cevapları yayınlanmıştır. Meb yayınlarının 5.Sınıf Müzik Çalışma Kitabı Çalışma kitabı cevapları sitemize eklenmiştir.\n\r\nhttp://www.sinifevraklari.com/2014/07/5snf-muzik-calsma-kitab-cevaplar-meb.html"},"Name":"McDowell Creek Falls"}
{"_id":{"$oid":"579a688f7c6fb8225aa9c90c"},"Report":{"Rating":"3","Text":"7. Sinif Fen ve Teknoloji Koza Yayinlari Çalişma Kitabi Cevaplari 2014-2015\n\r\nKoza 7.Sınıf Fen ve Teknoloji Koza Yayınları Çalışma Kitabı Cevapları Sayfa, 7.Sınıf Fen ve Teknoloji Koza Yayınları Çalışma Kitabı Sayfa Cevap Anahtarı, 7.Sınıf Fen ve Teknoloji Koza Çalışma Kitabı sayfa, 7.Sınıf Fen ve Teknoloji Koza Yayınları Çalışma Kitabı Cevap Anahtarı bul, 7.Sınıf Koza Fen ve Teknoloji Çalışma Kitabı Cevapları, Koza Yayınları 7.Sınıf Fen ve Teknoloji Çalışma Kitabı Cevap Anahtarı çöz, 7.Sınıf Fen ve Teknoloji Koza Yayınları Çalışma Kitabı Cevap Anahtarı ödev, Koza \n\r\nhttp://www.sinifevraklari.com/2014/09/7-sinif-fen-ve-teknoloji-koza-yayinlari-calisma-kitabi-cevaplari.html"},"Name":"Old Growth Trail"}
{"_id":{"$oid":"579a68907c6fb8225aa9c90d"},"Report":{"Rating":"5","Text":"very good thanks for this."},"Name":"Portland Highlights"}
{"_id":{"$oid":"579a68907c6fb8225aa9c90e"},"Report":{"Rating":"5","Text":"so beautiful...mind blowing"},"Name":"Portland Highlights"}
{"_id":{"$oid":"579a68907c6fb8225aa9c90f"},"Report":{"Rating":"5","Text":"http://www.sinifevraklari.com/2014/03/4-sinif-fen-ve-teknoloji-gun-yayinlari-calisma-kitabi-cevaplari.html"},"Name":"Portland Highlights"}
{"_id":{"$oid":"579a68907c6fb8225aa9c910"},"Report":{"Rating":"4","Text":"5. SINIF İNGİLİZCE YILDIRIM YAYINLARI ÖĞRENCİ ÇALIŞMA KİTABI CEVAPLARI\r\n5. Sınıf İngilizce Yıldırım Yayınları Çalışma Kitabı cevapları\n\r\n5. Sınıf İngilizce Yıldırım Yayınları Çalışma Kitabı cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2013/09/5-sinif-ingilizce-yildirim-yayinlari-ogrenci-calisma-kitabi-cevaplari.html"},"Name":"Portland Highlights"}
{"_id":{"$oid":"579a68917c6fb8225aa9c911"},"Report":{"Rating":"4","Text":"Great hike! Nice dirt trail, multiple swimming holes. Very nice hole 1.5 miles from parking spot. chilly water!!"},"Name":"Fall Creek Trail"}
{"_id":{"$oid":"579a68927c6fb8225aa9c912"},"Report":{"Rating":"5","Text":"It's a great trip! The trail can be muddy in winter and crowded in summer. Early morning on weekends and midweek evenings are ideal."},"Name":"Hagg Lake Mountain Biking Loop"}
{"_id":{"$oid":"579a68937c6fb8225aa9c913"},"Report":{"Rating":"4","Text":"CEM VEB OFSET YAYINLARI 4.Sınıf Türkçe Çalışma Kitabı Cevapları\r\n4. Sınıf Türkçe Cem Veb Ofset Yayınları Çalışma Kitabı Cevapları \n\r\n4. Sınıf Türkçe Cem Veb Ofset Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/cem-veb-ofset-yayinlari-4snf-turkce.html"},"Name":"Ramona Falls - Mt Hood"}
{"_id":{"$oid":"579a68947c6fb8225aa9c914"},"Report":{"Rating":"4","Text":"4. Sınıf Matematik Tutku Yayınları Çalışma Kitabı Cevapları\n\r\n4.Sınıf Matematik Tutku Yayınları Çalışma Kitabı Cevapları sitemizde yayınlanmıştır. Öğrencilerimizin derslerine yardımcı olmaya devam ediyoruz. Kitap içinde ve ünite sonunda bulanan soruların cevaplarını sitemizde yer almaktadır. Çalışma kitabı cevapları aşağıda sistemli olarak listelenmiştir. Cevap anahtarını arayanlar aşağıdaki sayfa numaralarıyla istediği sayfadaki cevapları inceleyebilirler.\n\r\nhttp://www.sinifevraklari.com/2014/09/tutku-yaynlar-4snf-matematik-calsma.html"},"Name":"Eagle Creek - PCT"}
{"_id":{"$oid":"579a68947c6fb8225aa9c915"},"Report":{"Rating":"5","Text":"I did the 26.5mi loop that takes you in on the Eagle Creek trail to Wahtum Lake, where it then meets up with the Pacific Crest Trail. The Eagle Creek Trail is actually not \"part\" of the Pacific Crest Trail, though some PCT through-hikers choose to take the Eagle Crest Trail through that part of the state because it's a nicer hike (waterfalls, etc) than the actual PCT route, which goes up on the Benson Plateau to the NE of the Eagle Creek Trail. So, to get to the Pacific Crest Trail via the Eagle Creek Trail, it's more like 13mi in and then a junction. Definitely recommend this trail system though.\n\r\nhttp://www.portlandhikersfieldguide.org/wiki/Wahtum_Lake_via_Eagle_Creek_Hike"},"Name":"Eagle Creek - PCT"}
{"_id":{"$oid":"579a68e27c6fb8225aa9c916"},"Report":{"Rating":"4","Text":"Always love it!  Stomping grounds for 30yrs!\r\nBy the way, it's not \"Devil's Crevice\"... It IS Devils Ladder. Not too hard to make it up once you are tall enough ;)  \r\nAs a child, I could never make stage 3..  but after hitting about 15.. not too bad. \r\nOf course... a couple more hours hike back ~ way more awesome! (and hidden  ;)   )"},"Name":"Jump Creek - Sands Basin"}
{"_id":{"$oid":"579a68e27c6fb8225aa9c917"},"Report":{"Rating":"5","Text":"Gbraach and I visited and explored the area. The east side of Jump Creek was burned by a range fire this spring/summer. All the \"Cheat Grass\" is gone, at least until next spring.\n\r\nWe explored the Poison Creek Waterfall area also. I added three POIs and photos and video to this Guide.\n\r\nBe careful hiking around riparian areas here as Poison Ivy is thick."},"Name":"Jump Creek - Sands Basin"}
{"_id":{"$oid":"579a68e37c6fb8225aa9c918"},"Report":{"Rating":"5","Text":"I soloed the Magruder in July 2015 on my fully loaded 2013 BMW R1200GS motorcycle. I completed the route from Elk City, ID to Conner, MT in about six hours. The portion from Dry Saddle to the Montana side was rough with three sections that had been washed out. The last 40 miles to Conner were in a cold downpour. Had the weather cooperated, I would've camped out one night. Instead I opted for a hotel room in Hamilton. A memoriable ride never the less."},"Name":"Magruder Corridor Guide"}
{"_id":{"$oid":"579a68e37c6fb8225aa9c919"},"Report":{"Rating":"5","Text":"Great review, makes me want to do the next trip"},"Name":"Magruder Corridor Guide"}
{"_id":{"$oid":"579a68e37c6fb8225aa9c91a"},"Report":{"Rating":"5","Text":"The best guide I have seen on Every Trail.\r\nGreat Job!"},"Name":"Magruder Corridor Guide"}
{"_id":{"$oid":"579a68e47c6fb8225aa9c91b"},"Report":{"Rating":"5","Text":"I added a short video recorded with my pocket camera to the Chinook Campground POI (#1). The video is of Chinook Salmon spawning in the Secesh River near the auto bridge on Warren Wagon Road."},"Name":"Loon Lake Loop"}
{"_id":{"$oid":"579a68e67c6fb8225aa9c91c"},"Report":{"Rating":"5","Text":"Kennymill and I visited the area from March 11 through March 12, 2015.\n\r\nI added a new POI (Austin Butte Overlook) and photos to several other POIs.\n\r\nThe major change in the area is that the roads in the Austin Trail area were graded during the last range fire.\n\r\nThe views from the canyon overlooks are still spectacular."},"Name":"Northwest Rim of the Bruneau River (Owyhee County, Idaho)"}
{"_id":{"$oid":"579a68e67c6fb8225aa9c91d"},"Report":{"Rating":"5","Text":"I added a photo of the Idaho Parks \u0026 Recreation Map showing the Roberson Pack Trail.\n\r\nI enjoy visiting the area. You never know what you will see."},"Name":"Northwest Rim of the Bruneau River (Owyhee County, Idaho)"}
{"_id":{"$oid":"579a68e67c6fb8225aa9c91e"},"Report":{"Rating":"5","Text":"These are some spectualar areas to see and experience. Like Ed said this is a rocky, rocky area and several of the trails shown on maps are not there nor have ever been there, so have alternate routes.\n\r\nPlan a trip to these places and many, many others in the Owyhee desert area. This is the next best place you can be next to heaven.\n\r\nKenny"},"Name":"Northwest Rim of the Bruneau River (Owyhee County, Idaho)"}
{"_id":{"$oid":"579a68e87c6fb8225aa9c91f"},"Report":{"Rating":"5","Text":"awesome place... must visit everyone"},"Name":"Josephine Lake"}
{"_id":{"$oid":"579a68e87c6fb8225aa9c920"},"Report":{"Rating":"5","Text":"The highway road sign at the Josephine Lake Road is gone, but the sign for FR 316 on the dirt road is still there.\n\r\nI added photos of the Chinook Salmon Counting Station on Lake Creek and of the headwaters of the Secesh River to the POIs."},"Name":"Josephine Lake"}
{"_id":{"$oid":"579a68e87c6fb8225aa9c921"},"Report":{"Rating":"5","Text":"Another great job Ed. This is a great area to ride and you never run out of trails."},"Name":"Josephine Lake"}
{"_id":{"$oid":"579a68ea7c6fb8225aa9c922"},"Report":{"Rating":"5","Text":"We visited the southern part of the wilderness several times in May, 2013.\n\r\nThousands of acres of the wilderness burned in a lightning started range fire in 2012. I added photos and a video showing the damage to the Holman Cabin area.\n\r\nI also added a track and photos of the Potholes area. I did not add any POIs as the scenic canyon views were at least two to four miles from the outer edge of the wilderness and we didn't hike to them."},"Name":"Big Jacks Creek Wilderness Guide (Owyhee County, Idaho)"}
{"_id":{"$oid":"579a68ea7c6fb8225aa9c923"},"Report":{"Rating":"5","Text":"I have had reports that a range fire burned a portion of the Wilderness around Comical Turn and Holman Cabin. It will be the spring of 2013 before I will be able to check it out."},"Name":"Big Jacks Creek Wilderness Guide (Owyhee County, Idaho)"}
{"_id":{"$oid":"579a68eb7c6fb8225aa9c924"},"Report":{"Rating":"5","Text":"We discovered the Humbolt Mine on this trip. I added it as a POI to this guide. It is about a mile hike off the California Road. The map shows a shorter route to the mine, but we didn't take it."},"Name":"Burgdorf, Idaho"}
{"_id":{"$oid":"579a68eb7c6fb8225aa9c925"},"Report":{"Rating":"5","Text":"More great areas to ride ATV's! Idaho has everything to offer for the ATVer, hiker, horse back rider and even the walkers.\r\nGreat job!"},"Name":"Burgdorf, Idaho"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c926"},"Report":{"Rating":"5","Text":"I added a short Trail Camera video of a wolf to this guide."},"Name":"Salmon River Mines - Old gold and silver mines"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c927"},"Report":{"Rating":"5","Text":"I just returned from camping at the Pete Creek Trail Head for about 14 days with my horses. I videoed friends riding their horses across the Lake Creek Meadow there and added the video to this guide.\n\r\nMost of the campgrounds in the area have \"Closed\" signs on them. The USFS is afraid that beetle killed trees in the campgrounds will fall on someone. Camping is at your own risk in these areas. This doesn't seem to deter many campers.\n\r\nThe voracious horse flies are another matter. Maybe some kind of beetle can start eating them."},"Name":"Salmon River Mines - Old gold and silver mines"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c928"},"Report":{"Rating":"5","Text":"I have rode some of these areas and they are absolutly beautiful and full of history.\r\nGreat job!"},"Name":"Salmon River Mines - Old gold and silver mines"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c929"},"Report":{"Rating":"5","Text":"Thanks  mighkel . I updated POIs #4 and #5 to reflect the bureaucratic infighting taking place in the area. \n\r\nThe U.S. Fish \u0026 Wildlife Service is showing its disdain for campers safety."},"Name":"Burgdorf Camping Areas"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c92a"},"Report":{"Rating":"5","Text":"POI 4, Jeanette Campground was closed when we were up there last.\n\r\nGreat write-up though!  Thanks!"},"Name":"Burgdorf Camping Areas"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c92b"},"Report":{"Rating":"5","Text":"I added a short Trail Camera video of a wolf to this guide."},"Name":"Burgdorf Camping Areas"}
{"_id":{"$oid":"579a68ec7c6fb8225aa9c92c"},"Report":{"Rating":"5","Text":"Most of the campgrounds in the area have \"Closed\" signs. There are a lot of beetle killed trees in the campgrounds and the USFS is concerned some might fall. Camping is still allowed \"AT Your Own Risk\". \n\r\nThe only one completely closed is the one in POI #2. Potable water is still available here."},"Name":"Burgdorf Camping Areas"}
{"_id":{"$oid":"579a68ed7c6fb8225aa9c92d"},"Report":{"Rating":"5","Text":"We visited the area in 2013 and explored two more old gold mines. I added three more POI's and more photos to this guide.\n\r\nOne of the mines had several structures. Both had old mining equipment."},"Name":"Pony Meadows-Bear Lake"}
{"_id":{"$oid":"579a68ed7c6fb8225aa9c92e"},"Report":{"Rating":"5","Text":"Friends fished Bear Lake in July, 2012 and reported the lake is full of stunted brook trout. This is a fairly common occurrence with lakes with brookies.\n\r\nThey also advised the road uphill to Keystone Meadows was rough and somewhat washed out. They said it is a better ATV road than a full sized vehicle road."},"Name":"Pony Meadows-Bear Lake"}
{"_id":{"$oid":"579a68ed7c6fb8225aa9c92f"},"Report":{"Rating":"5","Text":"A beautiful mountain area to explore, and lots to explore. Camp here for a week or two and you still won't see all the trails.\r\nAnother fine job...."},"Name":"Pony Meadows-Bear Lake"}
{"_id":{"$oid":"579a68ee7c6fb8225aa9c930"},"Report":{"Rating":"5","Text":"We visited the Warren Dredge and the grand kids went fishing in the Dredge Ponds. Everyone caught a few rainbow trout.\n\r\nIt was hot, and dusty due to lack of rainfall. It was also smoky due to nearby forest fires.\n\r\nThe trails are clear.\n\r\nEveryone had a good time in spite of the hot, dry, and smoky weather."},"Name":"Dredge Ponds"}
{"_id":{"$oid":"579a68ef7c6fb8225aa9c931"},"Report":{"Rating":"5","Text":"Some friends and I ATV'd to the Hettinger Ranch and hiked to the pictoglyphs. It was very warm along the river.\n\r\nI added videos and photographs to this guide and did an ET Trip on the ride.\n\r\nThe \"Rattlesnake\" video was made in this area, but not on this ride."},"Name":"Smith Knob - Hettinger Ranch"}
{"_id":{"$oid":"579a68ef7c6fb8225aa9c932"},"Report":{"Rating":"5","Text":"Friends and I ATV'd to the Hettinger Ranch. The weather was good and the conditions for photos were great. I added several photos to this guide. I also did an ET Trip on the ride.\n\r\nThe foot/horse trail downriver doesn't seem to get much use as grass is thick in the middle of the trail. \n\r\nThe road to the ranch is in good condition."},"Name":"Smith Knob - Hettinger Ranch"}
{"_id":{"$oid":"579a68f07c6fb8225aa9c933"},"Report":{"Rating":"5","Text":"Stumbled across your Warren write up. Wow! I see your other guides, some places of which I've been too, and others I intend too. Great posts. In regards to one of the hunters you ran into, several years ago my father-in-law traveled on the trail from the Hettinger Ranch into the Frank. He almost lost a mule when the pack hit the side and pushed the mule over...almost. Luckily, the mule saved itself. Father-in-law took a different way out and will never ride that trail again. Thanks for your detail and efforts here and your other guides! Great Stuff."},"Name":"Warren - South Fork Salmon River - Pilot Peak Lookout, Idaho"}
{"_id":{"$oid":"579a68f07c6fb8225aa9c934"},"Report":{"Rating":"5","Text":"wizonkiz,\n\r\nAs you know, I am a fair weather rider. Maybe we will have decent weather for next year. It would really be nice to have a smoke free ride. Most of the photos and videos in the guide are hazy due to the forest fires smoke.\n\r\nThanks for the kind words."},"Name":"Warren - South Fork Salmon River - Pilot Peak Lookout, Idaho"}
{"_id":{"$oid":"579a68f07c6fb8225aa9c935"},"Report":{"Rating":"5","Text":"Ed, great review, too bad I didn't see it before we made the trip a couple years ago, we missed so much stuff we didn't know about until seeing this, maybe next year!!! Sorry we missed seeing you this fall, we were a few days late I quess...Wiz"},"Name":"Warren - South Fork Salmon River - Pilot Peak Lookout, Idaho"}
{"_id":{"$oid":"579a68f77c6fb8225aa9c936"},"Report":{"Rating":"5","Text":"This was my first 'real hike' since I was a kid (I'm 35).  I've recently lost weight and taken up running but it's not really satisfying to me.  I'd been wanting to try hiking some of the trails in the area and finally on the recommendation of a friend tried this one.  It was a lot more challenging than I expected, but still a great trail for a novice or someone not in the best of shape.  And boy are the views worth it!  I can't wait to come back with the partner and dogs and make a day trip out of it!"},"Name":"Poo-Poo Point via Chirico Trail"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c937"},"Report":{"Rating":"5","Text":"Awesome hike! One of my favorite views in Washington for a day hike. I recommend going up to middle and upper ledge to leave the crowd unless you go early morning. Be careful on the ledge! I wrote an article about the hike with more info and pics if needed. http://www.fitlivinglifestyle.com/guide-to-rattlesnake-ridge-trail-in-the-pacific-northwest/"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c938"},"Report":{"Rating":"4","Text":"i want to visit this  place"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c939"},"Report":{"Rating":"4","Text":"gud place for roaming"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93a"},"Report":{"Rating":"5","Text":"Lovely place.. must visit everyone"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93b"},"Report":{"Rating":"5","Text":"rattlesnake-ridge- NICE Place"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93c"},"Report":{"Rating":"5","Text":"lovely place... very nice people"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93d"},"Report":{"Rating":"4","Text":"Mind Blowing place.... beautiful"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93e"},"Report":{"Rating":"4","Text":"superbbb place... just awesome"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c93f"},"Report":{"Rating":"5","Text":"this place is really awesome"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c940"},"Report":{"Rating":"5","Text":"Very Beautiful place..."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c941"},"Report":{"Rating":"4","Text":"Great spots... one should visit with fiends only"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c942"},"Report":{"Rating":"5","Text":"nice place...must visit evevryone"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c943"},"Report":{"Rating":"5","Text":"awesome place.. great trip it was... love it"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c944"},"Report":{"Rating":"5","Text":"Great place.. had so much fun with my friends there"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c945"},"Report":{"Rating":"5","Text":"very nice place...memorable moments there"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c946"},"Report":{"Rating":"5","Text":"lovely... amazing trip.. best so far"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c947"},"Report":{"Rating":"5","Text":"have so many memories at this place ...love it"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c948"},"Report":{"Rating":"5","Text":"Tremendous.. awesome, superb, fabulous place it is..."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c949"},"Report":{"Rating":"5","Text":"tremendous place.... Great Trail"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94a"},"Report":{"Rating":"5","Text":"nice place for elders :)!!!!!!!!!"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94b"},"Report":{"Rating":"5","Text":"most natural place on the planet :)"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94c"},"Report":{"Rating":"5","Text":"Very Nice Place darling it"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94d"},"Report":{"Rating":"5","Text":"condition at this send"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94e"},"Report":{"Rating":"4","Text":"great place rattle snake ridge"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c94f"},"Report":{"Rating":"4","Text":"After a short hike to Snoqualmie Falls decided to cover Rattlesnake also as the weather had improved.\n\r\nReached the parking lot around 2:30. Not many people were there. The lake was overflowing. The trail is in good shape. The hike is gentle in the beginning but becomes steep around the first mile. The views were fabulous as you step out on the ledge from the trail. The mountains, the lakes and the valley were awesome. The weather was playing tricks. Could see rain, clouds and sunshine all at the same time. With so few people it was very peaceful.\n\r\nSpend around 40 minutes at the ledge and did not venture further to the other ledges higher up. Was down in the parking lot by 5:45 and headed back. \r\nMore details and picture at http://sunilshikes.wordpress.com/2014/04/01/rattlesnake-ledge-03-29-2014/"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c950"},"Report":{"Rating":"4","Text":"i just loves this place"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c951"},"Report":{"Rating":"4","Text":"many lakes. wildlife is amazing"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c952"},"Report":{"Rating":"4","Text":"pretty cool place gets too hot in summers thoughRattlesnake Ridge"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c953"},"Report":{"Rating":"4","Text":"Very nice place for adventurous people"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c954"},"Report":{"Rating":"5","Text":"everyone loves this place"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c955"},"Report":{"Rating":"4","Text":"was lucky to see 2 rattlesnakes here"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c956"},"Report":{"Rating":"4","Text":"had great time with all my friends"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c957"},"Report":{"Rating":"5","Text":"everyone should love this place"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c958"},"Report":{"Rating":"4","Text":"nice place for youngsters"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c959"},"Report":{"Rating":"5","Text":"great place.. found a rattlesnake too"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95a"},"Report":{"Rating":"4","Text":"Just quick drive from SEA. had great fun"},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95b"},"Report":{"Rating":"5","Text":"FAVORITE VIEW of any easy/mod hike within a quick drive from Seattle."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95c"},"Report":{"Rating":"5","Text":"This was my first real hike in WA (so take my review from the perspective of someone who is a novice hiker and not that great in shape).  Though the trail is rated as \"easy,\" I would say that it was a pretty tough hike due to the constant steep slopes.  So may not be the best trail for children for their first time hiking.  The view at the top as everyone says, of course, is definitely worth the trip."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95d"},"Report":{"Rating":"4","Text":"Arrived Seattle just this week and HAD to take advantage of the hiking before it got too cold and rainy. It's only about 30-45 mins from Seattle downtown for this 2-3 hr trail to and back.\n\r\nThe ascent it steep all the way up.  But seeing the number of kids that were going up this trail, can't really say it's too hard.  You're rewarded at the top with great views since the ledge has no trees growing on it. \n\r\nGreat lake at the bottom for throwing pebbles (lots of flat ones)."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95e"},"Report":{"Rating":"5","Text":"Gorgeous scenery all the way to the top. It was quite foggy on this day, so the view was obscured. Starts of fairly easy and gets a bit steep closer to the end."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c95f"},"Report":{"Rating":"5","Text":"My friend Amanda and I decided that we wanted to start hiking (neither of us have lived in Washington state that long and we both wanted to take some time and some of the more or less free sources of recreation), which led us to climbing up a mountain yesterday! I think that we were a happy mixture of pretty prepared and horribly unprepared. At the bottom, it was flat and green with a few trees that had been knocked down after the snow/ice storm we had gotten a week ago. It did, however, kind of reinforce to me that I have been horribly inactive lately and that I need to get better about it.  I also learned that the craziest things can motivate me to keep going (I was going to give up with only .50 or so miles to go until someone said that there was a cave at the top. Of course the first thing in my mind was “I have to see if it’s the G.D. bat cave” and continued to go).\n\r\nOverall, it was a really fun hike and the people that we met on the trail going up/down were all very nice as well as encouraging. I would like to do this hike again later on in the year after it has gotten a little bit warmer and the skies a little bit clearer."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f87c6fb8225aa9c960"},"Report":{"Rating":"5","Text":"My friend Amanda and I decided that we wanted to start hiking (neither of us have lived in Washington state that long and we both wanted to take some time and some of the more or less free sources of recreation), which led us to climbing up a mountain yesterday! I think that we were a happy mixture of pretty prepared and horribly unprepared. At the bottom, it was flat and green with a few trees that had been knocked down after the snow/ice storm we had gotten a week ago. It did, however, kind of reinforce to me that I have been horribly inactive lately and that I need to get better about it.  I also learned that the craziest things can motivate me to keep going (I was going to give up with only .50 or so miles to go until someone said that there was a cave at the top. Of course the first thing in my mind was “I have to see if it’s the G.D. bat cave” and continued to go).\n\r\nOverall, it was a really fun hike and the people that we met on the trail going up/down were all very nice as well as encouraging. I would like to do this hike again later on in the year after it has gotten a little bit warmer and the skies a little bit clearer."},"Name":"Rattlesnake Ridge"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c961"},"Report":{"Rating":"5","Text":"the trail is currently closed from the lower part west of the falls. the falls are still accessible from the east side ololi state park, see reviews at WTA.org http://www.wta.org/go-hiking/hikes/twin-falls-state-park"},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c962"},"Report":{"Rating":"5","Text":"Easy, consistently great no matter the season (mud is expected in the rain!!).  This is my standard go-to hike for visitors or just when I want a quick, easy hike with my dog."},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c963"},"Report":{"Rating":"5","Text":"Went there when our puppy was about 4 months and just wanted to head out so that our terrier could get use to hikes gradually.  We didn't visit both falls, but small portion that we did was quite nice.  \n\r\nThe trail follows the river so you get water views throughout the hike.  It's pretty easy with a mild incline so it's great for beginners with a good payout in terms experience over effort."},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c964"},"Report":{"Rating":"5","Text":"Perfect for families and kids, especially for first timers.  Beautiful scenery along the trail, which follows the river for much of it.  Plenty of places to rest and sit along the rocks of the river for picnics and playing in the waters of the river.  There are some steep slopes, but easier compared to Rattlesnake.  Waterfall is not nearly as impressive as Snoqualmie Falls, but still worth the hike!"},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c965"},"Report":{"Rating":"4","Text":"NOT - I repeat - NOT \"easy.\"  Should be rated \"moderate.\"  It is definately beautiful and the first 1/2 mile is easy but then it starts up and goes up and down and up again to the bridge across the falls.  The view was worth the hike but people should know what they are getting into.  We are healthy and in good shape and it was not a problem but it really is not \"easy.\"  The grade is very steep and since you go up and down and up and down you do get a break but the ups are steep enough that they should be rated moderate.  In order for a hike to be rated \"easy\" it should be easy the entire way.  So if you are in good shape and have good knees - enjoy!!!!  It is a BEAUTIFUL hike."},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c966"},"Report":{"Rating":"4","Text":"I am not a regular with hiking. But I liked the trail. I started my trek by 10:30am and was back in less than 2 hours, without much of a hurry. While the upper fall is the last point on this trail, I actually liked the view of the lower falls. Most of the trail is through deep forestation and hence one can only get limited scenic views (or opportunities to take great photos). But at one can easily approach the water front and enjoy the flowing waters. I did not get into the water (water was very cold), but the more adventures ones can do that. Overall it was a relatively easy trek.\n\r\nDirections: I took I-90 East from Bellevue and took Exit 34. Make right on to 468th Ave SE and go for about a mile. You would see the brown Olallie State Part and Twin Falls Trailhead signs. Make left on SE 159th St and that road ends at the Twin Falls Trailhead. Discover pass is required (and I bought one at Big 5 Sports store), and a single day pass is also available at the pay station right in the paring lot at the Trailhead."},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c967"},"Report":{"Rating":"5","Text":"I have limited experience with hiking, but I have to say that I was overcome by the beauty and lushness of this place.  It was a typically rainy PNW day in the mountains, so the trail was a bit slippery in places, but easy to follow.  The sounds were primarily of rushing water and birds calling, with traffic noise audible from a nearby road at only one point.  I went out fairly late, so I didn't go past the Twin Falls Bridge, but I thoroughly enjoyed stopping there and at the lower viewpoint (and being covered in the mist rising up from the waterfall!), as well as a few little stops along the water on the way up.  No complaints - I had no problems with parking or finding my way there, despite it being a Saturday (albeit late in the day)."},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68f97c6fb8225aa9c968"},"Report":{"Rating":"5","Text":"I guess I'm biased since I work here, but this is the best waterfall hike in the Seattle area!"},"Name":"Twin Falls Trail - Olallie State Park"}
{"_id":{"$oid":"579a68fb7c6fb8225aa9c969"},"Report":{"Rating":"5","Text":"memorable trip...awesome place"},"Name":"The Enchantments"}
{"_id":{"$oid":"579a68fb7c6fb8225aa9c96a"},"Report":{"Rating":"5","Text":"MOSQUITO ALERT!\r\nI was surprised to find no mosquitos at lower elevations, however the Upper Snow Lakes area where I  camped was teeming with mosquitos. I was very lucky to discover a new device at Costco last week called an Off! Clip On Mosquito Protection Fan. It is sold in a two pack and adds a bit of weight to your gear but it is worth its weight in gold. It includes two AAA batteries and clips to your backpack or clothing. It creates a zone around you so you have head to toe mosquito protection and it works! I met some people who used conventional insect repellant and they were suffering. Do yourself a favor and get this device. It includes enough refills to protect two people for the endurance of the trip.\r\nRECOMMENDED TRIP DURATION\r\nMy original plan was to have a three nights, four days trip duration as follows:\r\nDay 1: Hike from Snow Lake trailhead to Upper Snow Lake campsite\r\nDistance from Snow Lake trailhead to Upper Snow Lake campsite: 8 miles\r\nElevation gain from Snow Lake trailhead to Upper Snow Lake campsite: 4,000 feet\r\nDay 2: Hike from Upper Snow Lake campsite to Lake Vivian (the gateway to the core Enchantments), Leprechaun Lake and vicinity\r\nDistance from Upper Snow Lake campsite to Lake Vivian: 1.5 miles\r\nElevation gain from Upper Snow Lake campsite to Lake Vivian: 1,500 feet\r\nDay 3: Hike from Upper Snow Lake campsite to Prusik Pass or Little Annapurna via Lake Vivian\r\nDay 4: Hike from Upper Snow Lake campsite to Snow Lake trailhead\r\nATTENTION: After my journey to the Enchantments this week, my optional recommendation is to make it a two nights, three days trip duration as follows:\r\nDay 1: Hike from Snow Lake trailhead to Upper Snow Lake campsite\r\nDay 2: Hike from Upper Snow Lake campsite to Lake Vivian, Leprechaun Lake and possibly Prusik Pass\r\nDay 3: Hike from Upper Snow Lake campsite to Snow Lake trailhead\r\nThe reason for my suggestion to change the duration is because the hike from Upper Snow Lake campsite to Lake Vivian is one of the most exhilarating, satisfying, fun, exhausting and physically challenging experiences you will ever have. It is like one year’s worth of mountain conditioning classes condensed into one morning. You will arrive at Lake Vivian feeling like a million dollars and at the same time beat up. I think that to do this hike in two consecutive days may be too taxing and will not be enjoyable for some of us. Therefore those frisky studs and studesses who want to do this as a four day adventure are welcome to. Those who want a less extreme experience over three days can do so. It is up to you. Remember, cutting the trip one day short means less food and less clothing = less weight.\n\r\nGETTING THERE\r\nThere is heavy highway construction approaching Monroe.  At times the road is closed except for one lane to let a line of cars serving both directions, including late at night. You can read more about current highway conditions here: http://www.wsdot.wa.gov/projects/sr522/widen/snoriver_us2/\r\nAn alternative is to go to Leavenworth from the I90. Unfortunately there is also substantial highway construction after Snoqualmie pass, so you may get stuck going either route. If you choose to go on I90, here are the directions: Travel east on Interstate-90 past Cle Elum. Take Exit 85 towards Wenatchee. Go east on State Rt. 970 for 12 miles to US-97. Follow Highway 97 north over Blewett Pass for 35 miles to the junction of Highway 2. Turn left and travel west on Highway 2 for a few miles until you arrive in downtown Leavenworth. You can read more about current highway conditions here: http://www.wsdot.wa.gov/News/2012/04/2_ConstructionresumesonI-90.htm\r\nACCOMMODATION BEFORE TRIP\r\nI originally booked a campsite at the Leavenworth KOA for those participants who wanted to arrive on the Friday and set out early on Saturday morning. I wanted to save money and maintain an outdoor temperament by camping at the KOA. After my experience this week, I have CANCELLED THIS PLAN. There are three reasons for this:\r\n1)\u0009The heat in Leavenworth at this time of the year is oppressive and the camp-ground provides little shelter from the sweltering temperature. It is much more preferable to spend time before the hike in an air-conditioned environment so you are fresh and rested when you set out for your hike in the morning.\r\n2)\u0009Sleeping in a van or tent may seem romantic or adventuresome, but is actually quite inconvenient when you have to pack up to get an early start. By staying in a hotel room, your backpacking gear can remain packed and intact overnight so you have a quick, efficient exit in the morning.\r\n3)\u0009My plan was to leave the KOA by 6am after my overnight stay this week, but there was a large group of KOA campers at the river nearby my site that partied until 3am, laughing, shouting, cheering and making a general ruckus. Therefore I had less than four hours sleep and it was not fun. I don’t want to go through that again.\r\nI was recommended to, and have reserved a hotel room at Enzian Inn www.enzianinn.com Their rate of $145 a night includes a superb breakfast that starts at 7.30am or a box of food to go if you want to leave before then.\r\nRESOURCES IN LEAVENWORTH\r\nYou might get lucky like me a few weeks ago and land up at the Leavenworth International Accordion Celebration (I have a pin to prove it), but that’s another story….\r\n1)\u0009McDonalds, 1250 US Highway 2. Opens at 5.30am! Look for big wooden “M” sign.\r\n2)\u0009Der Sportsmann, 837 Front Street. Tel: (509) 548-5623. For last minute gear.\r\n3)\u0009Rudloofs Pizza, 265 U.S. Highway 2. Tel: (509) 548-1505. Great location, food and nice bathroom. On the right as you enter Leavenworth from Seattle.\r\n4)\u0009New! Frozen Yogurtland. Right next to Rudloof’s. Your treat for after the hike.\r\n5)\u0009Safeway, River Bend Drive (visible from U.S. Highway 2 in east Leavenworth) (509) 548-5435. Fresh produce and Starbucks. Opens at 6.30am."},"Name":"The Enchantments"}
{"_id":{"$oid":"579a68fb7c6fb8225aa9c96b"},"Report":{"Rating":"5","Text":"Great job on this Guide.  Very well done.  I got to explore a little of the Enchantments last year backpacking into Stuart Lake.  Such a beautiful place."},"Name":"The Enchantments"}
{"_id":{"$oid":"579a68fc7c6fb8225aa9c96c"},"Report":{"Rating":"5","Text":"This was our second time hiking this trail. The first time we made it to the lower falls, this time we made it all the way to the top! It was beautiful. We left a little later than we should have and had to hike the last mile or so in the dark... I would not recommend it."},"Name":"Wallace Falls Hike"}
{"_id":{"$oid":"579a68fc7c6fb8225aa9c96d"},"Report":{"Rating":"5","Text":"Really fantastic hike, mostly along the water, which makes it even better.  The roaring falls seem to drown everything else, and you really feel like you are there all by yourself.  I would recommend starting the hike before 10am on the weekend.  I saw a boyscout troop, a girlscout troop, and a bunch of other people in the last mile of the hike.  If you are looking to get a peaceful uninterrupted hike, get there early.  Only an hour drive from downtown Seattle."},"Name":"Wallace Falls Hike"}
{"_id":{"$oid":"579a68ff7c6fb8225aa9c96e"},"Report":{"Rating":"4","Text":"We went on this mountain twice, once in mid June and once in mid July... what a difference a month makes!\n\r\nThe first time in June, we hiked up with my mother-in-law.  I was impressed by growing views of Mount Rainier and of the mountain peaks alongside it. After a long flatish run, it suddenly picks up in slope, and you continue zig zagging your way through.  Our first time, we went out to Mason Lake which was absolutely beautiful.\n\r\nOnce you past the treeline, there is almost no more tree cover so it can get very hot in the summer, though there are cool breezes in some parts of the trail.  Brings lots of water, we ran out.  The piles and piles of rocks up of the treeline are impressive to see as well.\n\r\nThe second time in July, as much as I enjoyed the view and great workout, I couldn't get past the aggresive mosquitos that were EVERYWHERE.  It was really too bad because we had a great view at the top of the mountain, but you couldn't stand for 1 minute because of the bugs.  The only way to put up with the bugs were to keep moving... which also meant resting was short and sweet. I ended up with over 30 bites, but I must admit, I tend to be particularly appetizing for mosquitos."},"Name":"Bandera Mountain"}
{"_id":{"$oid":"579a69007c6fb8225aa9c96f"},"Report":{"Rating":"5","Text":"This hike is fantastic.  Make sure you get a WA state pass so you can park.  It's a very steep hike with lots of switchbacks.  Wear good shoes and bring plenty of water and a snack.  Once you get to the top, you come out of the trees for a view that is second to none.  The Haystack is a peak just beyond where this hike ends, and it offers full a 360 degree view.  However, to get to it you have a serious rock scramble.  The two guys I was with made it up, but after going a few feet, I decided to sit it out.  It's very steep and while I wouldn't say I'm afraid of heights, coming down would have been very uncomfortable for me.\n\r\nDon't miss out on Mount Si!"},"Name":"Mount Si"}
{"_id":{"$oid":"579a69007c6fb8225aa9c970"},"Report":{"Rating":"5","Text":"This is a great classic and tough hike.  Especially on weekends, make sure to get to the trailhead early as it fills up. Oh, and remember your Discover Pass as it is required for parking.\n\r\nBe sure to keep going all the way to the haystack (don't just stop at the rocky lunch area) as the haystack scramble is a lot of fun and the top has great views when it is clear (which it wasn't this morning).\n\r\nI have to take issue with the hike stats shown on this page as the hike is an 8-mile round trip, not the 6-miles stated.  And not sure where the \"1-3 hours\" comes from.  It typically takes me 2-2.5 hours to get to the lunch area, and another 20-30 minutes to get to the top of the haystack.  Plan on at least a good half day, but close to a whole day is more reasonable.  We arrived at 9am and got back to the bottom around 2:30, as I recall.\n\r\nBe aware that this hike is not for the timid.  It is fairly steep with a vertical gain greater than most trails.  By half way down I am usually wishing I had a spare set of knees!  Often crowded and always beautiful.  You gotta do it at least once!"},"Name":"Mount Si"}
{"_id":{"$oid":"579a69007c6fb8225aa9c971"},"Report":{"Rating":"4","Text":"I've been to Mount Si several times and haven't been disappointed yet.  As the reviewer says, it's under tree cover for most of the time so it doesn't get too hot, even in the summer... the disadvantage or advantage is that you only really get views at the top.  \n\r\nWhen we went during winter (I think November)... it was quite cold at the top and foggy and didn't get to see the view, so that was disappointing.  Birds were also trying to snatch our lunch away!\n\r\nBack when we went around June, the view was breathtaking and we could actually climb up the haystack since it wasn't so slippery.  On clear days, you can see the Space Needle from up there."},"Name":"Mount Si"}
{"_id":{"$oid":"579a69007c6fb8225aa9c972"},"Report":{"Rating":"5","Text":"It was such a beautiful hike. We went up Wahkeena falls and came down multnomah falls! It took us a couple hours, so if you are looking for a hike and have a couple hours... I definitely recommend this hike."},"Name":"Wahkeena Falls Loop - Columbia River Gorge"}
{"_id":{"$oid":"579a69017c6fb8225aa9c973"},"Report":{"Rating":"5","Text":"Awesome hike that you can take even inexperienced hikers on. The climb is very gentle, but the views are absolutely stunning from just about any stopping point you choose. Just remember to make sure you go when the Sunrise Entrance to the Mt. Rainier national park is open since they do close this entrance for many months of the year."},"Name":"Sunrise Rim Trail Loop and Mt. Freemont Lookout"}
{"_id":{"$oid":"579a69027c6fb8225aa9c974"},"Report":{"Rating":"5","Text":"I loved this trail it was so nice! there was nothing i didn't like about it. I recommend this hike!"},"Name":"Wilderness Cliffs Trail"}
{"_id":{"$oid":"579a69057c6fb8225aa9c975"},"Report":{"Rating":"5","Text":"had so much fun there....just amazing"},"Name":"Dog Mountain"}
{"_id":{"$oid":"579a69057c6fb8225aa9c976"},"Report":{"Rating":"5","Text":"This is a must do hike in late May early June when the Balsom Root are blooming.  The most wildflowers I have ever seen in any hike in my life.\n\r\nSadly it was cloudy on the day that I went so I will have to go back someday."},"Name":"Dog Mountain"}
{"_id":{"$oid":"579a69067c6fb8225aa9c977"},"Report":{"Rating":"5","Text":"Awesome place with amazing environment"},"Name":"Granite Montain"}
{"_id":{"$oid":"579a69077c6fb8225aa9c978"},"Report":{"Rating":"5","Text":"Great hike!  We crossed several snow fields but nothing technical.  Amazing scenery with wildflowers popping up everywhere.  Started on Berry Patch and hiked to Goat Lake then came out two days later on Snowgrass trail."},"Name":"Goat Ridge loop hike"}
{"_id":{"$oid":"579a69097c6fb8225aa9c979"},"Report":{"Rating":"5","Text":"Was in Walla Walla with some friends from Seattle for a wine tour weekend. We used the really cool old limo from Dream Ride Tours and had a kick butt time. \n\r\nIf you're going, make sure you hit Zerba's, 3 Rivers, Le'cole 41, Saviah, Dunham, Dusted Valley etc... there are some really great wineries in Walla Walla!\n\r\nStayed at the Marc: www.marcuswhitmanhotel.com\r\nTook Dream Ride's Limo: www.dreamridecharters.com\r\nAte at the Marc and Whitehouse Crawford: www.whitehousecrawford.com"},"Name":"Walla Walla Wine Country Tour"}
{"_id":{"$oid":"579a69097c6fb8225aa9c97a"},"Report":{"Rating":"5","Text":"I can't wait to try Walla Walla wine and cuisine, this trip looks delicious and fun!"},"Name":"Walla Walla Wine Country Tour"}
{"_id":{"$oid":"579a690b7c6fb8225aa9c97b"},"Report":{"Rating":"5","Text":"We left the trailhead at Campers Bivouac at 6:30 AM. Weather was perfect. \r\nI started off wearing shorts, a long sleeve base layer and a tshirt but I quickly removed the long sleeve base layer and stuck with just the tshirt all the way to the top. \r\nI hiked it with my girlfriend. We are in pretty good shape and hike pretty frequently. Our pace was seemingly quick as we passed quite a few people but we still took a good amount of breathers. \r\nThe first part through the forest up to the bathroom took about 60 minutes. \r\nWe stashed some water behind a tree here so we didn't have to carry it up with us and we could have it on the way down. \r\nAfter the forest you face a boulder field you have to scramble though. \r\nWe brought gardening gloves with the rubber palms for like $5 and they worked awesome to protect your hands and give you a little extra grip when you are maneuvering up the boulder fields. \r\nIt took us 2 hours and 45 minutes to get to the top of the boulder field. \r\nOnce you get to the top of the boulder field, you have loose gravel and ash for the rest of the climb which is pretty tough. In hindsight, we should have thrown our minispikes on and went up the snow path. \r\nThere's clear ground all the way up so you don't need to walk in snow at all if you don't want to. \r\nIt took us about 1 hour 15 minutes to get to the summit with a good amount of short 2-3 min breaks. Your poles will come in huge here. Can't imagine doing that part without poles. \r\nThe wind picks up a little at the top and when you're not moving, you'll want to add a light jacket and a warmer hat maybe. \r\nIf you walk to the left of the summit you'll get some better views into the crater. \r\nWe decided to glissade down. We brought snow pants and a jacket. Also gaiters were a game changer in preventing snow from getting into your boots. The warmer weather has made the snow a little slushier so you can easily control your speed and it never felt like I was out of control. \r\nWe glissaded down the right side of the trail and would have to occasionally walk across some rocks to the next snow patch to glissade down. \r\nIt was a ton of fun and we ended up getting down the mountain in 2 hours and 20 minutes!\r\nOverall the climb was fantastic and I can't wait to do it again!\n\r\nLuke"},"Name":"Mt St Helens - Monitor Ridge Trail"}
{"_id":{"$oid":"579a690c7c6fb8225aa9c97c"},"Report":{"Rating":"5","Text":"I'm interested in using these photos in a power point presentation I'm doing in a couple of weeks.  It's about Mt. St. Helens. Is that allowed?\n\r\nGreat pics!  Fantastic!  \n\r\nIf it is allowed, could you tell me how to download these pics?\n\r\nThanks so much!  (:"},"Name":"Loowit Falls, Mount Saint Helens"}
{"_id":{"$oid":"579a690c7c6fb8225aa9c97d"},"Report":{"Rating":"5","Text":"I don't mind if you use them as long as you tell everyone who took them.  email me at tonyfarley At mac.com and I'll send you the full res shots."},"Name":"Loowit Falls, Mount Saint Helens"}
{"_id":{"$oid":"579a690f7c6fb8225aa9c97e"},"Report":{"Rating":"5","Text":"If you start in White Salmon in the am and stage at the river, you can pause at the high point bench and ck the wind.  If the wind is up, you zip down and hit the water to wdsf or kite.  You're going downhill in the arid section which can get hot on a summer day.   a"},"Name":"Syncline Ridge Run"}
{"_id":{"$oid":"579a69107c6fb8225aa9c97f"},"Report":{"Rating":"5","Text":"Beautiful, not kids friendly, but we saw a couple of them at the camping place. Maybe good for 10 years old or older"},"Name":"Rialto Beach Hike"}
{"_id":{"$oid":"579a69127c6fb8225aa9c980"},"Report":{"Rating":"2","Text":"I got VERY lost in this area.  The trails were very confusing."},"Name":"Wilderness Creek Trail"}
